pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// bl602_demo_wifi_text_0006.c
// Generated by decompiling bl602_demo_wifi.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_wifi.h"

// 230605E8: Register Eq_317738 mbedtls_aes_crypt_ecb(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Stack word32 dwArg2C, Stack Eq_59116 dwArg0138, Register out (ptr32 (arr byte)) s1Out, Register out Eq_282338 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      block_cipher_df
//      ctr_drbg_update_internal
//      mbedtls_ctr_drbg_random
//      mbedtls_aes_crypt_cbc
//      aes_crypt_ecb_wrap
Eq_317738 mbedtls_aes_crypt_ecb(Eq_2 a1, Eq_2 a2, Eq_2 a3, word32 dwArg2C, Eq_59116 dwArg0138, byte (& s1Out, union Eq_282338 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 s9_32;
	ptr32 s8_31;
	ptr32 s7_30;
	ptr32 s6_29;
	ptr32 s5_28;
	ptr32 s4_27;
	ptr32 s3_26;
	Eq_282338 s2_25;
	ptr32 s11_24;
	ptr32 s10_23;
	byte (* s1_22)[];
	Eq_317738 s0_21;
	if (a1 == 0x01)
	{
		word32 a3_117;
		word32 a4_118;
		word32 a5_119;
		word32 a6_120;
		s0_21 = mbedtls_aes_encrypt(a2, a3, 0x01, dwArg2C, dwArg0138, out s1_22, out a3_117, out a4_118, out a5_119, out a6_120, out s2_25, out s3_26, out s4_27, out s5_28, out s6_29, out s7_30, out s8_31, out s9_32, out s10_23, out s11_24);
	}
	else
		s0_21 = mbedtls_aes_decrypt(a2, a3, a2, dwArg2C, dwArg0138, out s1_22, out s2_25, out s3_26, out s4_27, out s5_28, out s6_29, out s7_30, out s8_31, out s9_32, out s10_23, out s11_24);
	s1Out = s1_22;
	s2Out = s2_25;
	s3Out = s3_26;
	s4Out = s4_27;
	s5Out = s5_28;
	s6Out = s6_29;
	s7Out = s7_30;
	s8Out = s8_31;
	s9Out = s9_32;
	s10Out = s10_23;
	s11Out = s11_24;
	return s0_21;
}

// 2306060C: Register word32 mbedtls_aes_crypt_cbc(Register Eq_2 a1, Register ui32 a2, Register Eq_2 a3, Register ptr32 a4, Register ptr32 a5, Stack Eq_59116 dwArgF8, Stack Eq_59116 dwArg0108, Stack word32 dwArg0198, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out ptr32 a4Out, Register out Eq_2 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      aes_crypt_cbc_wrap
//      pem_aes_decrypt
word32 mbedtls_aes_crypt_cbc(Eq_2 a1, ui32 a2, Eq_2 a3, ptr32 a4, ptr32 a5, Eq_59116 dwArgF8, Eq_59116 dwArg0108, word32 dwArg0198, union Eq_2 & s1Out, union Eq_2 & a1Out, ptr32 & a4Out, union Eq_2 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ui32 s0_115 = a2 & 0x0F;
	if ((a2 & 0x0F) == 0x00)
	{
		ptr32 s4_121 = a5;
		ptr32 s5_119 = a4;
		s1 = a3;
		ui32 s2_117 = a2;
		s7 = a1;
		int32 s8_223 = 0x10;
		if (a1 == 0x00)
		{
			while (true)
			{
				s7 = s5_119 - s0_115;
				Eq_2 s3_122 = s4_121 - s0_115;
				if (s0_115 + s2_117 == 0x00)
					break;
				Eq_2 a5_128;
				word32 a1_407;
				word32 a2_408;
				word32 a3_409;
				word32 a4_410;
				word32 a6_411;
				word32 a7_412;
				memcpy(fp + -64, s7, 0x10, out a1_407, out a2_408, out a3_409, out a4_410, out a5_128, out a6_411, out a7_412);
				word32 s3_158;
				word32 s6_413;
				word32 s7_414;
				word32 s8_415;
				Eq_317738 s0_153 = mbedtls_aes_decrypt(s7, s3_122, a5_128, dwLoc04, dwArg0108, out s1, out s2_117, out s3_158, out s4_121, out s5_119, out s6_413, out s7_414, out s8_415, out s9, out s10, out s11);
				int32 a3_173;
				for (a3_173 = 0x00; a3_173 != 0x10; ++a3_173)
				{
					byte * a4_177 = s3_158 + a3_173;
					*a4_177 = (byte) ((word32) *((word32) s1 + a3_173) ^ (word32) (*a4_177));
				}
				word32 a2_416;
				word32 a3_417;
				word32 a5_418;
				word32 a6_419;
				word32 a7_420;
				memcpy(s1, fp + -64, 0x10, out a1, out a2_416, out a3_417, out a4, out a5_418, out a6_419, out a7_420);
				s0_115 = (word32) s0_153 - 16;
			}
		}
		else
		{
			while (true)
			{
				a4 = s5_119 - s0_115;
				Eq_2 s3_45 = s4_121 - s0_115;
				if (s2_117 + s0_115 == 0x00)
					break;
				int32 a3_46 = 0x00;
				do
				{
					((word32) s3_45 + a3_46)->u1 = (byte) ((word32) (a4 + a3_46) ^ (word32) (*((word32) s1 + a3_46)));
					++a3_46;
				} while (a3_46 != s8_223);
				Eq_2 s3_84;
				word32 s6_421;
				Eq_2 s0_79 = mbedtls_aes_crypt_ecb(s7, s3_45, s3_45, dwLoc14, dwArgF8, out s1, out s2_117, out s3_84, out s4_121, out s5_119, out s6_421, out s7, out s8_223, out s9, out s10, out s11);
				word32 a2_422;
				word32 a3_423;
				word32 a4_424;
				word32 a5_425;
				word32 a6_426;
				word32 a7_427;
				memcpy(s1, s3_84, 0x10, out a1, out a2_422, out a3_423, out a4_424, out a5_425, out a6_426, out a7_427);
				s0_115 = (word32) s0_79 - 16;
			}
		}
	}
	0x00 = dwArg0198;
	s1Out = s1;
	a1Out = a1;
	a4Out = a4;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return dwArg0158;
}

// 230606F2: void mbedtls_aes_crypt_cfb128(Register Eq_317738 s0, Register word32 a1, Register word32 a2, Register (ptr32 Eq_317738) a3, Register Eq_2 a4, Register (ptr32 Eq_318995) a5, Register (ptr32 Eq_318996) a6, Stack word32 dwArg1C, Stack word32 dwArgA8, Stack Eq_59116 dwArg0128)
// Called from:
//      aes_crypt_cfb128_wrap
void mbedtls_aes_crypt_cfb128(Eq_317738 s0, word32 a1, word32 a2, union Eq_317738 * a3, Eq_2 a4, struct Eq_318995 * a5, struct Eq_318996 * a6, word32 dwArg1C, word32 dwArgA8, Eq_59116 dwArg0128)
{
	union Eq_317738 * s6_132 = a3;
	Eq_2 s2_109 = a4;
	struct Eq_318995 * s3_129 = a5;
	struct Eq_318996 * s1_125 = a6;
	struct Eq_318996 * s4_130 = a6 + a2;
	if (a1 != 0x00)
	{
		while (s1_125 != s4_130)
		{
			if (s0 == 0x00)
			{
				word32 a3_313;
				word32 a4_314;
				word32 a5_315;
				word32 a6_316;
				word32 s5_317;
				word32 s7_318;
				word32 s8_319;
				word32 s9_320;
				word32 s10_321;
				word32 s11_322;
				s0 = mbedtls_aes_encrypt(s2_109, s2_109, a4, dwArg1C, dwArg0128, out s1_125, out a3_313, out a4_314, out a5_315, out a6_316, out s2_109, out s3_129, out s4_130, out s5_317, out s6_132, out s7_318, out s8_319, out s9_320, out s10_321, out s11_322);
			}
			a4 = s2_109 + s0;
			++s3_129;
			++s1_125;
			ui32 a5_156 = (word32) *a4 ^ (word32) s3_129->bFFFFFFFF;
			s1_125[0x0FFF] = (struct Eq_318996) (byte) a5_156;
			a4->u1 = (byte) a5_156;
			s0 = (word32) s0.u0 + 1 & 0x0F;
		}
	}
	else
	{
		while (s1_125 != s4_130)
		{
			if (s0 == 0x00)
			{
				word32 a3_323;
				word32 a4_324;
				word32 a5_325;
				word32 a6_326;
				word32 s5_327;
				word32 s7_328;
				word32 s8_329;
				word32 s9_330;
				word32 s10_331;
				word32 s11_332;
				s0 = mbedtls_aes_encrypt(s2_109, s2_109, a4, dwArg1C, dwArg0128, out s1_125, out a3_323, out a4_324, out a5_325, out a6_326, out s2_109, out s3_129, out s4_130, out s5_327, out s6_132, out s7_328, out s8_329, out s9_330, out s10_331, out s11_332);
			}
			++s3_129;
			a4 = s2_109 + s0;
			word32 a3_80 = (word32) s3_129->bFFFFFFFF;
			++s1_125;
			s1_125[0x0FFF] = (struct Eq_318996) (byte) ((word32) *a4 ^ a3_80);
			a4->u1 = (byte) a3_80;
			s0 = (word32) s0.u0 + 1 & 0x0F;
		}
	}
	*s6_132 = (union Eq_317738 *) s0;
	0x00 = dwArgA8;
}

// 2306078E: void mbedtls_aes_crypt_ctr(Register (ptr32 word32) s0, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_319130) a5, Register (ptr32 Eq_319131) a6, Stack word32 dwArg0C, Stack word32 dwArg74, Stack (ptr32 word32) dwArgB4, Stack Eq_59116 dwArg0118, Stack word32 dwArg0128)
// Called from:
//      aes_crypt_ctr_wrap
void mbedtls_aes_crypt_ctr(word32 * s0, word32 a1, Eq_2 a3, Eq_2 a4, struct Eq_319130 * a5, struct Eq_319131 * a6, word32 dwArg0C, word32 dwArg74, word32 * dwArgB4, Eq_59116 dwArg0118, word32 dwArg0128)
{
	word32 s1_100 = *s0;
	struct Eq_319131 * s2_111 = a6 + a1;
	while (a6 != s2_111)
	{
		if (s0 == null)
		{
			Eq_2 s4_54;
			word32 s9_239;
			word32 s10_240;
			word32 s11_241;
			word32 s8_238;
			word32 s7_237;
			word32 s6_236;
			word32 s5_235;
			word32 s3_234;
			mbedtls_aes_encrypt(a3, a4, a4, dwArg0C, dwArg0118, out s1_100, out a3, out a4, out a5, out a6, out s2_111, out s3_234, out s4_54, out s5_235, out s6_236, out s7_237, out s8_238, out s9_239, out s10_240, out s11_241);
			0x00 = dwArg74;
			s0 = dwArgB4;
			Eq_2 a1_71 = s4_54;
			while (true)
			{
				ui32 a2_76 = (word32) *a1_71 + 0x01 & 0x00FF;
				a1_71->u1 = (byte) a2_76;
				if (a2_76 != 0x00)
					break;
				Eq_2 a2_78 = (word32) a1_71 - 1;
				if (a3 == a1_71)
					break;
				a1_71 = a2_78;
			}
		}
		++a5;
		++a6;
		Mem98[a6 + 0x0FFF:byte] = SLICE(CONVERT(Mem89[a4 + s0:byte], byte, word32) ^ CONVERT(Mem89[a5 + -1:byte], byte, word32), byte, 0);
		s0 = s0 + 0x01 & 0x0F;
	}
	*s0 = s1_100;
	0x00 = dwArg0128;
}

