pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23060818: Register int32 mbedtls_asn1_get_len(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_315321 a3Out, Register out Eq_315322 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_x509_crt_parse_der
//      mbedtls_asn1_get_tag
//      mbedtls_asn1_get_alg
//      mbedtls_x509_get_serial
//      mbedtls_x509_get_name
int32 mbedtls_asn1_get_len(Eq_2 a1, Eq_2 a2, Eq_2 a5, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_315321 & a3Out, union Eq_315322 & a4Out, union Eq_2 & a5Out)
{
	int32 a0_67;
	Eq_2 a0_5 = *a5;
	Eq_315321 a3_31 = a1 - a5;
	if (a3_31 <= 0x00)
	{
l2306084A:
		a0_67 = -96;
l2306084E:
		a1Out = a1;
		a2Out = a2;
		a3Out = a3_31;
		a4Out = a4;
		a5Out = a5;
		return a0_67;
	}
	else
	{
		ui32 a4_8 = (word32) *a5;
		if ((int32) (byte) a4_8 >= 0x00)
		{
			*((word32) a5 + 1) = a0_5;
			a5 = (word32) *a5;
			*a5 = a2;
			a4 = (word32) a5 + 1;
			goto l2306083E;
		}
		Eq_2 a0_24;
		a4 = a4_8 & 0x007F;
		if ((a4_8 & 0x007F) != 0x02)
		{
			if ((a4_8 & 0x007F) <= 0x02)
			{
				if ((a4_8 & 0x007F) != 0x01)
					goto l23060864;
				if (a3_31 != (a4_8 & 0x007F))
				{
					union Eq_2 * a5_52 = (word32) *((word32) a5 + 1);
					*a5_52 = (union Eq_2 *) a2;
					a0_24 = *a5_52;
					a5 = (char *) a5_52 + 2;
					goto l230608AC;
				}
				goto l2306084A;
			}
			if ((a4_8 & 0x007F) != 0x03)
			{
				if ((a4_8 & 0x007F) != 0x04)
				{
l23060864:
					a1Out = a1;
					a2Out = a2;
					a3Out = a3_31;
					a4Out = a4_8 & 0x007F;
					a5Out = a5;
					return -100;
				}
				if ((a4_8 & 0x007F) < a3_31)
				{
					a3_31 = (word32) *((word32) a5 + 4);
					a4 = (word32) *((word32) a5 + 1) << 24 | (word32) (*((word32) a5 + 2)) << 16 | a3_31;
					union Eq_2 * a5_47 = (word32) *((word32) a5 + 3) << 8 | a4;
					*a5_47 = (union Eq_2 *) a2;
					a0_24 = *a5_47;
					a5 = (char *) a5_47 + 5;
					goto l230608AC;
				}
				goto l2306084A;
			}
			if ((a4_8 & 0x007F) >= a3_31)
				goto l2306084A;
			ui32 a3_28 = (word32) *((word32) a5 + 2);
			a4 = (word32) *((word32) a5 + 1) << 16 | a3_28 << 8;
			union Eq_2 * a5_33 = (word32) *((word32) a5 + 3) | a4;
			*a5_33 = (union Eq_2 *) a2;
			a3_31 = a3_28 << 8;
			a0_24 = *a5_33;
			a5 = (char *) a5_33 + 4;
		}
		else
		{
			if ((a4_8 & 0x007F) >= a3_31)
				goto l2306084A;
			uint32 a5_16 = (word32) *((word32) a5 + 2) << 8 | (word32) (*((word32) a5 + 1));
			union Eq_2 * a5_21 = (word32) (word16) (a5_16 >> 8 | a5_16 << 0x08);
			*a5_21 = (union Eq_2 *) a2;
			a4 = a5_16 << 0x08;
			a0_24 = *a5_21;
			a5 = (char *) a5_21 + 3;
		}
l230608AC:
		*a5 = a0_24;
l2306083E:
		a0_67 = 0x00;
		a1 -= a5;
		a2 = *a5;
		if (a1 >= a5)
			goto l2306084E;
		goto l2306084A;
	}
}

// 230608F4: Register Eq_2 mbedtls_asn1_get_tag(Register Eq_2 a1, Register Eq_2 a2, Register Eq_284113 a3, Register Eq_2 a5, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_284113 a3Out, Register out (ptr32 Eq_284118) a4Out, Register out Eq_2 a5Out)
// Called from:
//      pk_parse_key_pkcs1_der
//      pk_parse_key_sec1_der
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_subpubkey
//      mbedtls_rsa_pkcs1_verify
//      mbedtls_x509_crt_parse_der
//      mbedtls_asn1_get_bool
//      mbedtls_asn1_get_int
//      mbedtls_asn1_get_mpi
//      mbedtls_asn1_get_bitstring
//      mbedtls_asn1_get_bitstring_null
//      mbedtls_asn1_get_sequence_of
//      mbedtls_asn1_get_alg
//      mbedtls_x509_get_name
//      mbedtls_x509_get_ext
Eq_2 mbedtls_asn1_get_tag(Eq_2 a1, Eq_2 a2, Eq_284113 a3, Eq_2 a5, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_284113 & a3Out, struct Eq_284118 & a4Out, union Eq_2 & a5Out)
{
	Eq_319392 a0_5 = *a5;
	if (a1 - a5 <= 0x00)
	{
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return -96;
	}
	else if ((word32) *a5 != a3)
	{
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return -98;
	}
	else
	{
		*((word32) a5 + 1) = a0_5;
		Eq_284113 a3_16;
		Eq_2 a1_17;
		Eq_2 a2_18;
		struct Eq_284118 * a4_19;
		Eq_2 a5_20;
		Eq_2 a0_15 = mbedtls_asn1_get_len(a1, a2, (word32) a5 + 1, out a1_17, out a2_18, out a3_16, out a4_19, out a5_20);
		a1Out = a1_17;
		a2Out = a2_18;
		a3Out = a3_16;
		a4Out = a4_19;
		a5Out = a5_20;
		return a0_15;
	}
}

// 2306091A: Register (ptr32 Eq_315062) mbedtls_asn1_get_bool(Register Eq_2 a1, Register (ptr32 Eq_315062) a2, Register Eq_2 a5, Register out (ptr32 Eq_315062) s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_315067 a5Out)
// Called from:
//      mbedtls_x509_crt_parse_der
union Eq_315062 * mbedtls_asn1_get_bool(Eq_2 a1, union Eq_315062 * a2, Eq_2 a5, union Eq_315062 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_315067 & a5Out)
{
	union Eq_315062 * s0_15 = a0;
	ptr32 a1_20;
	word32 a4_23;
	word32 a2_64;
	word32 a3_65;
	Eq_315067 a5_24;
	Eq_2 a0_18 = mbedtls_asn1_get_tag(a1, fp + ~0x13, 0x01, a5, out a1_20, out a2_64, out a3_65, out a4_23, out a5_24);
	if (a0_18 == 0x00)
	{
		a5_24.u0 = 0x01;
		if (a4_23 == 0x01)
		{
			struct Eq_319450 * a5_30 = (word32) ((word32) *(union Eq_2 *) 0x01 != 0x00);
			a5_30->ptr0000 = a2;
			s0_15 = a5_30->ptr0000;
			a5_30->ptr0001 = s0_15;
			a5_24 = &a5_30->ptr0001;
		}
		else
			a0_18.u0 = -100;
	}
	s1Out = a2;
	a0Out = a0_18;
	a1Out = a1_20;
	a5Out = a5_24;
	return s0_15;
}

// 2306095A: Register Eq_2 mbedtls_asn1_get_int(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out (ptr32 byte) a4Out, Register out Eq_284145 a5Out)
// Called from:
//      pk_parse_key_pkcs1_der
//      pk_parse_key_sec1_der
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_asn1_get_int(Eq_2 a1, Eq_2 a2, Eq_2 a5, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, byte & a4Out, union Eq_284145 & a5Out)
{
	Eq_2 s1_39 = a2;
	Eq_2 s0_15 = a0;
	ptr32 a1_20;
	ptr32 a3_22;
	word32 a2_102;
	byte * a4_23;
	Eq_284145 a5_24;
	Eq_2 a0_18 = mbedtls_asn1_get_tag(a1, fp + ~0x13, 0x02, a5, out a1_20, out a2_102, out a3_22, out a4_23, out a5_24);
	if (a0_18 != 0x00)
	{
l23060992:
		s1Out = s1_39;
		a0Out = a0_18;
		a1Out = a1_20;
		a3Out = a3_22;
		a4Out = a4_23;
		a5Out = a5_24;
		return s0_15;
	}
	else
	{
		a4_23 = (byte *) 0x03;
		a5_24 = (char *) a5_24.u2 - 1;
		if (a5_24 <= ~0x03)
		{
			s0_15 = *((word32) a5_24 - 1);
			a5_24 = (int32) *((word32) a5_24 - 1);
			if (a5_24 >= 0x00)
			{
				*a2 = 0x00;
				while (true)
				{
					a4_23 = (word32) a5_24 - 1;
					if (a5_24 == 0x00)
						break;
					s1_39 = *a5_24;
					struct Eq_319510 * a5_42 = a5_24 << 8 | (word32) (*a4_23);
					a5_42->t0000 = s1_39;
					s0_15 = a5_42->t0000;
					a5_42->t0001 = s0_15;
					a5_24 = &a5_42->t0001;
				}
				goto l23060992;
			}
		}
		a0_18.u0 = -100;
		goto l23060992;
	}
}

