pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 230609B8: Register Eq_2 mbedtls_asn1_get_mpi(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg64, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out (ptr32 ptr32) a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_2) s3Out, Register out (ptr32 Eq_284192) s4Out)
// Called from:
//      pk_parse_key_pkcs1_der
//      mbedtls_pk_parse_subpubkey
Eq_2 mbedtls_asn1_get_mpi(Eq_2 ra, Eq_2 a1, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg64, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, struct Eq_284192 & s4Out)
{
	ptr32 s1_39 = a2;
	ptr32 s0_15 = a0;
	Eq_2 a3_22;
	ptr32 a2_21;
	Eq_2 a1_20;
	Eq_2 a4_23;
	ptr32 * a5_24;
	Eq_2 a0_18 = mbedtls_asn1_get_tag(a1, fp + ~0x13, 0x02, a5, out a1_20, out a2_21, out a3_22, out a4_23, out a5_24);
	if (a0_18 == 0x00)
	{
		ptr32 * a5_34;
		word32 s0_118;
		word32 a2_119;
		word32 a3_120;
		word32 a7_121;
		word32 s4_122;
		word32 s8_123;
		ra = mbedtls_mpi_read_binary(ra, a1_20, dwArg64, a3_22, a4_23, mstatus, dwLoc18, dwLoc08, dwArgB8, dwArgC8, dwArgF8, dwArg0108, dwArg0138, dwArg0148, out s0_118, out s1_39, out a0_18, out a1_20, out a2_119, out a3_120, out a4_23, out a5_34, out a7_121, out s2, out s3, out s4_122, out s8_123);
		s0_15 = *a5_34;
		a5_24 = a5_34 + a4_23;
		*a5_24 = s0_15;
		a2_21 = dwArgA4;
	}
	s0Out = s0_15;
	s1Out = s1_39;
	a0Out = a0_18;
	a1Out = a1_20;
	a2Out = a2_21;
	a4Out = a4_23;
	a5Out = a5_24;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	return ra;
}

// 230609EA: Register Eq_2 mbedtls_asn1_get_bitstring(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out Eq_315179 a5Out, Register out Eq_2 s2Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_asn1_get_bitstring(Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a4Out, union Eq_315179 & a5Out, union Eq_2 & s2Out)
{
	Eq_2 s1_14 = a0;
	ptr32 a1_22;
	word32 a2_75;
	word32 a3_76;
	ptr32 a4_25;
	Eq_315179 a5_26;
	Eq_2 a0_20 = mbedtls_asn1_get_tag(a1, a2, 0x03, a5, out a1_22, out a2_75, out a3_76, out a4_25, out a5_26);
	if (a0_20 == 0x00)
	{
		Eq_2 s0_27 = *a5_26;
		if (a5_26 != 0x00)
		{
			*((word32) a5_26 - 1) = s0_27;
			s1_14 = *((word32) a5_26 - 1);
			a5_26 = (word32) *((word32) a5_26 - 1);
			((word32) s0_27 + 4)->u1 = (byte) a5_26;
			a4_25 = 0x07;
			if (a5_26 <= 0x07)
			{
				s1_14 = *a5_26;
				*((word32) a5_26 + 1) = s1_14;
				*((word32) a5_26 + 9) = *(union Eq_2 *) 0x07;
				*((word32) a5_26 + 8) = s1_14;
				a5_26 = (word32) a5_26 + 8;
				if ((word32) a5_26 + 8 != a1)
					a0_20.u0 = -0x0066;
			}
			else
				a0_20.u0 = -100;
		}
		else
			a0_20.u0 = -96;
	}
	0x00 = (uint16) dwArg38;
	a0Out = a0_20;
	a1Out = a1_22;
	a2Out = dwArg10;
	a4Out = a4_25;
	a5Out = a5_26;
	s2Out = a1;
	return s1_14;
}

// 23060A48: Register Eq_2 mbedtls_asn1_get_bitstring_null(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 word32) a4Out, Register out (ptr32 Eq_284827) a5Out)
// Called from:
//      pk_parse_key_sec1_der
//      mbedtls_pk_parse_subpubkey
//      mbedtls_x509_get_sig
Eq_2 mbedtls_asn1_get_bitstring_null(Eq_2 a1, Eq_2 a2, Eq_2 a5, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, word32 & a4Out, struct Eq_284827 & a5Out)
{
	Eq_2 s1_14 = a2;
	ptr32 a1_19;
	ptr32 a3_21;
	word32 a2_71;
	word32 * a4_22;
	struct Eq_284827 * a5_23;
	Eq_2 a0_17 = mbedtls_asn1_get_tag(a1, a2, 0x03, a5, out a1_19, out a2_71, out a3_21, out a4_22, out a5_23);
	if (a0_17 == 0x00)
	{
		s1_14 = a5_23->t0000;
		a5_23->tFFFFFFFF = s1_14;
		a4_22 = (word32 *) 0x01;
		if (a5_23 <= (struct Eq_284827 *) 0x01)
		{
l23060A78:
			a0_17.u0 = -0x0068;
			goto l23060A7C;
		}
		a5_23->t0001 = a5_23->t0000;
		a4_22 = (word32 *) &a5_23->t0001;
		a5_23 = (word32) a5_23->t0000;
		if (a5_23 != null)
			goto l23060A78;
	}
l23060A7C:
	a0Out = a0_17;
	a1Out = a1_19;
	a2Out = dwArg10;
	a3Out = a3_21;
	a4Out = a4_22;
	a5Out = a5_23;
	return s1_14;
}

// 23060A86: Register Eq_2 mbedtls_asn1_get_sequence_of(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_284113 a3, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s5Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_asn1_get_sequence_of(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_284113 a3, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgE8, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s5Out)
{
	int32 a4_34;
	word32 a2_212;
	word32 a3_213;
	ptr32 a1_170;
	Eq_2 a5_114;
	Eq_2 a0_29 = mbedtls_asn1_get_tag(a1, fp + -36, 48, a5, out a1_170, out a2_212, out a3_213, out a4_34, out a5_114);
	Eq_2 s0_40 = a2;
	Eq_284113 s4_11 = a3;
	Eq_2 s1_190 = a0;
	Eq_2 s3_116 = a1;
	Eq_2 s2_105 = a0_29;
	if (a0_29 == 0x00)
	{
		s1_190 = *a5_114;
		a5_114 = (word32) a5_114 + a4_34;
		if (a1 != a5_114)
		{
l23060AB6:
			s2_105.u0 = -0x0066;
		}
		else
		{
			do
			{
				s5 = (word32) s0_40 + 4;
				do
				{
					s1_190 = *a5_114;
					if (a5_114 >= s3_116)
					{
						*((word32) s0_40 + 0x0C) = 0x00;
						s1_190 = *a5_114;
						if (a5_114 == s3_116)
							goto l23060B00;
						goto l23060AB6;
					}
					Eq_2 a5_46 = (word32) *a5_114;
					*a5_46 = s0_40;
					Eq_2 a3_59;
					Eq_2 a4_60;
					word32 a2_214;
					Eq_2 a0_55 = mbedtls_asn1_get_tag(s3_116, s5, s4_11, a5_46, out a1_170, out a2_214, out a3_59, out a4_60, out a5_114);
					if (a0_55 != 0x00)
					{
						s2_105 = a0_55;
						goto l23060B00;
					}
					Eq_2 s1_63 = *a5_114;
					s0_40 = *((word32) a4_60 + 4);
					*((word32) a5_114 + 8) = s0_40;
					a5_114 += a4_60;
					*a5_114 = s1_63;
				} while (a5_114 >= s3_116);
				Eq_2 s0_83;
				word32 a2_215;
				word32 a3_216;
				word32 a4_217;
				word32 s8_218;
				ra = mycalloc(ra, s1_63, 0x01, 0x10, a3_59, a4_60, a5_114, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out s0_83, out s1_190, out a1_170, out a2_215, out a3_216, out a4_217, out a5_114, out s2_105, out s3_116, out s4_11, out s8_218);
				*(union Eq_2 *) 0x0D = s0_83;
				s0_40.u0 = 0x01;
			} while (true);
			s2_105.u0 = -0x006A;
		}
	}
l23060B00:
	0x00 = (uint16) dwArg0128;
	s1Out = s1_190;
	a0Out = s2_105;
	a1Out = a1_170;
	a5Out = a5_114;
	s2Out = s2_105;
	s5Out = s5;
	return ra;
}

// 23060B1E: Register Eq_2 mbedtls_asn1_get_alg(Register Eq_2 a1, Register (ptr32 Eq_285049) a2, Register Eq_2 a3, Register Eq_2 a5, Stack Eq_2 dwArgB4, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_285058) a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out (ptr32 Eq_285049) s4Out)
// Called from:
//      pk_get_pk_alg
//      mbedtls_x509_get_alg
Eq_2 mbedtls_asn1_get_alg(Eq_2 a1, struct Eq_285049 * a2, Eq_2 a3, Eq_2 a5, Eq_2 dwArgB4, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_285058 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, struct Eq_285049 & s4Out)
{
	word32 a2_147;
	Eq_2 a5_130;
	struct Eq_285058 * a4_128;
	ptr32 a3_126;
	ptr32 a1_124;
	Eq_2 a0_27 = mbedtls_asn1_get_tag(a1, fp + -36, 48, a5, out a1_124, out a2_147, out a3_126, out a4_128, out a5_130);
	Eq_2 s1_133 = a3;
	Eq_2 s3_134 = a1;
	Eq_2 s2_34 = a0_27;
	if (a0_27 == 0x00)
	{
		Eq_319829 s0_35 = *a5_130;
		s2_34.u0 = -96;
		s3_134 = a1 - a5_130;
		if (s3_134 > 0x00)
		{
			Eq_2 a5_38 = (word32) *a5_130;
			a2->t0000 = a5_38;
			s3_134 = Mem40[s0_35 + 0x00:int32] + a5_38;
			word32 a2_148;
			Eq_2 a0_46 = mbedtls_asn1_get_tag(s3_134, dwArgB4, 0x06, a5_38, out a1_124, out a2_148, out a3_126, out a4_128, out a5_130);
			s2_34 = a0_46;
			if (a0_46 == 0x00)
			{
				Eq_319829 s0_54 = *a5_130;
				a4_128 = a2->ptr0004;
				a2->t0008 = a5_130;
				word32 a5_57 = a5_130 + a4_128;
				*a5_57 = s0_54;
				if (a5_57 == s3_134)
				{
					a5_130 = (word32) a3 + 0x0C;
					while (s1_133 != (word32) a3 + 0x0C)
					{
						s1_133->u1 = 0x00;
						s1_133 = (word32) s1_133 + 1;
					}
				}
				else
				{
					struct Eq_319877 * a5_59 = (word32) *a5_57;
					a5_59->t0000 = a3;
					a5_59->t0001 = a5_59->t0000;
					word32 a2_149;
					Eq_2 a0_67 = mbedtls_asn1_get_len(s3_134, (word32) a3 + 4, &a5_59->t0001, out a1_124, out a2_149, out a3_126, out a4_128, out a5_130);
					if (a0_67 == 0x00)
					{
						Eq_319829 s0_75 = *a5_130;
						s1_133 = a4_128->t0004;
						*((word32) a5_130 + 8) = s1_133;
						a5_130 += a4_128;
						*a5_130 = s0_75;
						if (a5_130 != s3_134)
							s2_34.u0 = -0x0066;
					}
					else
						s2_34 = a0_67;
				}
			}
		}
	}
	0x00 = (uint16) dwArg0128;
	a0Out = s2_34;
	a1Out = a1_124;
	a2Out = dwArg0100;
	a3Out = a3_126;
	a4Out = a4_128;
	a5Out = a5_130;
	s2Out = s2_34;
	s3Out = s3_134;
	s4Out = a2;
	return s1_133;
}

