pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23060BD8: Register word32 mpi_sub_hlp(Register Eq_287755 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_287755 a7Out)
// Called from:
//      mpi_montmul
//      mbedtls_mpi_sub_abs
word32 mpi_sub_hlp(Eq_287755 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, ptr32 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_287755 & a7Out)
{
	Eq_2 a5_16 = 0x00;
	Eq_287755 a7_15 = 0x00;
	while (true)
	{
		Eq_319954 a6_8 = a7_15 << 0x02;
		if (a7_15 == a0)
			break;
		struct Eq_319944 * a3_12 = *a4;
		struct Eq_319944 ** a4_18 = a4 - a5_16;
		*a4_18 = (struct Eq_319944 **) a3_12;
		word32 a6_20 = Mem19[a6_8 + a1:int32];
		a4 = a4_18 - a6_20;
		a3_12->t1000 = a4;
		t1 = (word32) (a4 < a5_16);
		a7_15 = (word32) a7_15 + 1;
		a5_16 = (word32) (a4_18 < a6_20) + t1;
	}
	word32 a2_27 = a2 + a6_8;
	while (a5_16 != 0x00)
	{
		struct Eq_319944 * a2_31 = *a4;
		a2_31->t1000 = a4 - a5_16;
		a2_27 = (char *) a2_31 + 4;
		a5_16 = (word32) (a4 < a5_16);
	}
	a2Out = a2_27;
	a4Out = a4;
	a5Out = a5_16;
	a7Out = a7_15;
	return t1;
}

// 23060C22: Register (ptr32 Eq_319987) mpi_mul_hlp(Register Eq_287755 a0, Register (ptr32 Eq_319987) a1, Register (ptr32 Eq_319989) a2, Register (ptr32 Eq_319990) a3, Register out ptr32 a2Out, Register out Eq_319992 a4Out, Register out Eq_319992 a5Out)
// Called from:
//      mpi_montmul
//      mbedtls_mpi_mul_mpi
union Eq_319987 * mpi_mul_hlp(Eq_287755 a0, union Eq_319987 * a1, struct Eq_319989 * a2, struct Eq_319990 * a3, ptr32 & a2Out, union Eq_319992 & a4Out, union Eq_319992 & a5Out)
{
	struct Eq_319989 * a4_11 = a2;
	union Eq_319987 * a7_16 = a1;
	Eq_287755 t1_15 = a0;
	Eq_319992 a5_196 = 0x00;
	while (true)
	{
		Eq_320008 a6_13 = a4_11->dw0000;
		if (t1_15 <= 0x0F)
			break;
		struct Eq_319990 * t5_17 = *a7_16;
		word32 t4_25 = a3 + t5_17 + a5_196;
		++a4_11;
		word32 t4_27 = t4_25 + a6_13;
		a4_11[63] = (struct Eq_319989) t4_27;
		a7_16 = (union Eq_319987 *) ((char *) a7_16 + 64);
		struct Eq_319990 * a5_31 = *((char *) a7_16 - 60);
		up32 a6_32 = (word32) (t4_27 < a6_13) + (bool) ((a3 < t5_17) + (t4_25 < a5_196));
		word32 t4_35 = a3 + a5_31 + a6_32;
		Eq_320031 a5_38 = a4_11->dwFFFFFFC4;
		Eq_320031 t4_39 = (word32) a5_38 + t4_35;
		a4_11->dw0FC4 = (word32) t4_39;
		struct Eq_319990 * a6_43 = *((char *) a7_16 - 56);
		up32 a5_42 = (word32) (t4_39 < a5_38) + (bool) ((t4_35 < a6_32) + (a3 < a5_31));
		word32 t4_46 = a3 + a6_43 + a5_42;
		Eq_320055 a6_49 = a4_11->dwFFFFFFC8;
		Eq_320055 t4_50 = (word32) a6_49 + t4_46;
		a4_11->dw0FC8 = (word32) t4_50;
		struct Eq_319990 * a5_54 = *((char *) a7_16 - 52);
		up32 a6_53 = (word32) (t4_50 < a6_49) + (bool) ((t4_46 < a5_42) + (a3 < a6_43));
		word32 t4_57 = a3 + a5_54 + a6_53;
		Eq_320079 a5_60 = a4_11->dwFFFFFFCC;
		Eq_320079 t4_61 = (word32) a5_60 + t4_57;
		a4_11->dw0FCC = (word32) t4_61;
		struct Eq_319990 * a6_65 = *((char *) a7_16 - 48);
		up32 a5_64 = (word32) (t4_61 < a5_60) + (bool) ((t4_57 < a6_53) + (a3 < a5_54));
		word32 t4_68 = a3 + a6_65 + a5_64;
		Eq_320103 a6_71 = a4_11->dwFFFFFFD0;
		Eq_320103 t4_72 = (word32) a6_71 + t4_68;
		a4_11->dw0FD0 = (word32) t4_72;
		struct Eq_319990 * a5_76 = *((char *) a7_16 - 44);
		up32 a6_75 = (word32) (t4_72 < a6_71) + (bool) ((t4_68 < a5_64) + (a3 < a6_65));
		word32 t4_79 = a3 + a5_76 + a6_75;
		Eq_320127 a5_82 = a4_11->dwFFFFFFD4;
		Eq_320127 t4_83 = (word32) a5_82 + t4_79;
		a4_11->dw0FD4 = (word32) t4_83;
		struct Eq_319990 * a6_87 = *((char *) a7_16 - 40);
		up32 a5_86 = (word32) (t4_83 < a5_82) + (bool) ((t4_79 < a6_75) + (a3 < a5_76));
		word32 t4_90 = a3 + a6_87 + a5_86;
		Eq_320151 a6_93 = a4_11->dwFFFFFFD8;
		Eq_320151 t4_94 = (word32) a6_93 + t4_90;
		a4_11->dw0FD8 = (word32) t4_94;
		struct Eq_319990 * a5_98 = *((char *) a7_16 - 36);
		up32 a6_97 = (word32) (t4_94 < a6_93) + (bool) ((t4_90 < a5_86) + (a3 < a6_87));
		word32 t4_101 = a3 + a5_98 + a6_97;
		Eq_320175 a5_104 = a4_11->dwFFFFFFDC;
		Eq_320175 t4_105 = (word32) a5_104 + t4_101;
		a4_11->dw0FDC = (word32) t4_105;
		struct Eq_319990 * a6_109 = *((char *) a7_16 - 32);
		up32 a5_108 = (word32) (t4_105 < a5_104) + (bool) ((t4_101 < a6_97) + (a3 < a5_98));
		word32 t4_112 = a3 + a6_109 + a5_108;
		Eq_320199 a6_115 = a4_11->dwFFFFFFE0;
		Eq_320199 t4_116 = (word32) a6_115 + t4_112;
		a4_11->dw0FE0 = (word32) t4_116;
		struct Eq_319990 * a5_120 = *((char *) a7_16 - 28);
		up32 a6_119 = (word32) (t4_116 < a6_115) + (bool) ((t4_112 < a5_108) + (a3 < a6_109));
		word32 t4_123 = a3 + a5_120 + a6_119;
		Eq_320223 a5_126 = a4_11->dwFFFFFFE4;
		Eq_320223 t4_127 = (word32) a5_126 + t4_123;
		a4_11->dw0FE4 = (word32) t4_127;
		struct Eq_319990 * a6_131 = *((char *) a7_16 - 24);
		up32 a5_130 = (word32) (t4_127 < a5_126) + (bool) ((t4_123 < a6_119) + (a3 < a5_120));
		word32 t4_134 = a3 + a6_131 + a5_130;
		Eq_320247 a6_137 = a4_11->dwFFFFFFE8;
		Eq_320247 t4_138 = (word32) a6_137 + t4_134;
		a4_11->dw0FE8 = (word32) t4_138;
		struct Eq_319990 * a5_142 = *((char *) a7_16 - 20);
		up32 a6_141 = (word32) (t4_138 < a6_137) + (bool) ((t4_134 < a5_130) + (a3 < a6_131));
		word32 t4_145 = a3 + a5_142 + a6_141;
		Eq_320271 a5_148 = a4_11->dwFFFFFFEC;
		Eq_320271 t4_149 = (word32) a5_148 + t4_145;
		a4_11->dw0FEC = (word32) t4_149;
		struct Eq_319990 * a6_153 = *((char *) a7_16 - 16);
		up32 a5_152 = (word32) (t4_149 < a5_148) + (bool) ((t4_145 < a6_141) + (a3 < a5_142));
		word32 t4_156 = a3 + a6_153 + a5_152;
		Eq_320295 a6_159 = a4_11->dwFFFFFFF0;
		Eq_320295 t4_160 = (word32) a6_159 + t4_156;
		a4_11->dw0FF0 = (word32) t4_160;
		struct Eq_319990 * a5_164 = *((char *) a7_16 - 0x0C);
		up32 a6_163 = (word32) (t4_160 < a6_159) + (bool) ((t4_156 < a5_152) + (a3 < a6_153));
		word32 t4_167 = a3 + a5_164 + a6_163;
		Eq_320319 a5_170 = a4_11->dwFFFFFFF4;
		Eq_320319 t4_171 = (word32) a5_170 + t4_167;
		a4_11->dw0FF4 = (word32) t4_171;
		struct Eq_319990 * a6_175 = *((char *) a7_16 - 8);
		up32 a5_174 = (word32) (t4_171 < a5_170) + (bool) ((t4_167 < a6_163) + (a3 < a5_164));
		word32 t4_178 = a3 + a6_175 + a5_174;
		Eq_320343 a6_181 = a4_11->dwFFFFFFF8;
		Eq_320343 t4_182 = (word32) a6_181 + t4_178;
		a4_11->dw0FF8 = (word32) t4_182;
		struct Eq_319990 * t4_185 = *((char *) a7_16 - 4);
		up32 a6_186 = (word32) (t4_182 < a6_181) + (bool) ((t4_178 < a5_174) + (a3 < a6_175));
		word32 a5_189 = a3 + t4_185 + a6_186;
		Eq_320367 t4_192 = a4_11->dwFFFFFFFC;
		Eq_320367 a5_193 = (word32) t4_192 + a5_189;
		a4_11->dw0FFC = (word32) a5_193;
		t1_15 = (word32) t1_15 - 16;
		a5_196 = (word32) (a5_193 < t4_192) + (bool) ((a5_189 < a6_186) + (a3 < t4_185));
	}
	ui32 a4_201 = a0 >> 0x04 << 6;
	union Eq_319987 * a1_203 = (char *) a1 + a4_201;
	struct Eq_320392 * a2_205 = a2 + a4_201 / 64;
	Eq_319992 a4_206 = 0x07;
	uint32 a0_207 = (word32) a0.u1 + ((a0 >> 0x04) + ~0x0F);
	if (a0_207 > 0x07)
	{
		struct Eq_319990 * a7_208 = *a1_203;
		word32 a4_214 = a3 + a7_208 + a5_196;
		word32 a4_216 = a4_214 + a6_13;
		a2_205[0x0400] = (struct Eq_320392) a4_216;
		struct Eq_319990 * a5_220 = *((char *) a1_203 + 4);
		up32 a6_221 = (word32) (a4_216 < a6_13) + (bool) ((a3 < a7_208) + (a4_214 < a5_196));
		word32 a4_224 = a3 + a5_220 + a6_221;
		Eq_320435 a5_227 = a2_205[1];
		Eq_320435 a4_228 = (word32) a5_227 + a4_224;
		a2_205[0x0401] = (struct Eq_320392) a4_228;
		struct Eq_319990 * a4_231 = *((char *) a1_203 + 8);
		Eq_320448 a6_232 = (bool) ((a4_224 < a6_221) + (a3 < a5_220)) + (word32) (a4_228 < a5_227);
		word32 a5_235 = a3 + a4_231 + a6_232;
		Eq_320459 a6_238 = a2_205[2];
		word32 a5_239 = a5_235 + a6_238;
		a2_205[0x0402] = (struct Eq_320392) a5_239;
		struct Eq_319990 * a4_243 = *((char *) a1_203 + 0x0C);
		up32 a6_242 = (word32) (a5_239 < a6_238) + (bool) ((a3 < a4_231) + (a5_235 < a6_232));
		word32 a7_246 = a3 + a4_243 + a6_242;
		Eq_320483 a4_249 = a2_205[3];
		Eq_320483 a7_250 = (word32) a4_249 + a7_246;
		a2_205[0x0403] = (struct Eq_320392) a7_250;
		struct Eq_319990 * a5_252 = *((char *) a1_203 + 16);
		up32 a4_254 = (word32) (a7_250 < a4_249) + (bool) ((a7_246 < a6_242) + (a3 < a4_243));
		word32 a7_257 = a3 + a5_252 + a4_254;
		Eq_320507 a5_260 = a2_205[4];
		Eq_320507 a7_261 = (word32) a5_260 + a7_257;
		a2_205[0x0404] = (struct Eq_320392) a7_261;
		struct Eq_319990 * a6_263 = *((char *) a1_203 + 20);
		up32 a5_265 = (word32) (a7_261 < a5_260) + (bool) ((a7_257 < a4_254) + (a3 < a5_252));
		word32 a7_268 = a3 + a6_263 + a5_265;
		Eq_320531 a6_271 = a2_205[5];
		Eq_320531 a7_272 = (word32) a6_271 + a7_268;
		a2_205[0x0405] = (struct Eq_320392) a7_272;
		struct Eq_319990 * a4_274 = *((char *) a1_203 + 24);
		up32 a6_276 = (word32) (a7_272 < a6_271) + (bool) ((a7_268 < a5_265) + (a3 < a6_263));
		word32 a7_279 = a3 + a4_274 + a6_276;
		Eq_320555 a4_282 = a2_205[6];
		Eq_320555 a7_283 = (word32) a4_282 + a7_279;
		a2_205[1030] = (struct Eq_320392) a7_283;
		struct Eq_319990 * a5_285 = *((char *) a1_203 + 28);
		up32 a4_287 = (word32) (a7_283 < a4_282) + (bool) ((a7_279 < a6_276) + (a3 < a4_274));
		word32 a6_290 = a3 + a5_285 + a4_287;
		Eq_320579 a5_293 = a2_205[7];
		Eq_320579 a6_294 = (word32) a5_293 + a6_290;
		a2_205[1031] = (struct Eq_320392) a6_294;
		a4_206.u0 = (bool) ((a6_290 < a4_287) + (a3 < a5_285));
		a0_207 += ~0x07;
		a2_205 += 8;
		a1_203 = (union Eq_319987 *) ((char *) a1_203 + 32);
		a5_196.u0 = (bool) a4_206.u0 + (word32) (a6_294 < a5_293);
	}
	union Eq_319987 * t3_301 = (char *) a1_203 + (a0_207 << 2);
	struct Eq_320392 * a6_303 = a2_205;
	while (true)
	{
		Eq_320615 a7_306 = a6_303->dw0000;
		++a6_303;
		if (a1_203 == t3_301)
			break;
		a1_203 = (union Eq_319987 *) ((char *) a1_203 + 4);
		struct Eq_319990 * t1_311 = *((char *) a1_203 - 4);
		word32 a4_316 = a3 + t1_311 + a5_196;
		word32 a4_318 = a4_316 + a7_306;
		a6_303[0x03FF] = (struct Eq_320392) a4_318;
		a4_206 = (word32) (a4_318 < a7_306);
		a5_196 = (word32) a4_206 + (bool) ((a3 < t1_311) + (a4_316 < a5_196));
	}
	while (true)
	{
		struct Eq_320629 * a2_328 = *a4_206;
		a4_206 += a5_196;
		a2_328->t1000 = a4_206;
		if (a4_206 >= a5_196)
			break;
		a5_196.u0 = 0x01;
	}
	a2Out = (char *) a2_328 + 4;
	a4Out = a4_206;
	a5Out = a5_196;
	return a1_203;
}

// 23061008: Register word32 mbedtls_mpi_init(Register Eq_2 a0)
// Called from:
//      mbedtls_rsa_check_privkey
//      mbedtls_rsa_public
//      mbedtls_rsa_private
//      ecp_select_comb
//      ecp_double_jac
//      ecp_normalize_jac
//      ecp_normalize_jac_many
//      mbedtls_ecp_point_init.part.2
//      mbedtls_ecp_keypair_init
//      ecp_add_mixed
//      mbedtls_ecp_check_pubkey
//      mbedtls_ecp_mul
word32 mbedtls_mpi_init(Eq_2 a0)
{
	if (a0 != 0x00)
	{
		*(union Eq_2 *) 0x01 = a0;
		*((word32) a0 + 4) = 0x00;
		*((word32) a0 + 8) = 0x00;
		a5 = 0x01;
	}
	return a5;
}

// 23061018: Register word32 mbedtls_mpi_free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out ptr32 s4Out)
// Called from:
//      mbedtls_rsa_check_privkey
//      mbedtls_rsa_public
//      mbedtls_rsa_private
//      mbedtls_rsa_free
//      mbedtls_mpi_copy
//      mbedtls_mpi_sub_abs
//      mbedtls_mpi_mul_mpi
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_exp_mod
//      mbedtls_mpi_gcd
//      mbedtls_mpi_inv_mod
//      ecp_select_comb
//      ecp_double_jac
//      ecp_normalize_jac
//      ecp_normalize_jac_many
//      mbedtls_ecp_point_free
//      mbedtls_ecp_group_free
//      mbedtls_ecp_keypair_free
//      ecp_add_mixed
//      mbedtls_ecp_check_pubkey
//      mbedtls_ecp_mul
word32 mbedtls_mpi_free(Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		a0Out = a0;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		a6Out = a6;
		s4Out = s4;
		return s1;
	}
	else
	{
		Eq_2 a0_10 = *((word32) a5 + 8);
		Eq_2 s0_11 = a0_10;
		if (a5 != 0x00)
		{
			Eq_2 a0_13 = *((word32) a4 + 4);
			while (true)
			{
				a4 = (word32) a4 - 1;
				if (a4 == ~0x00)
					break;
				*a5 = 0x00;
				a5 = (word32) a5 + 4;
			}
			word32 a2_98;
			word32 a5_99;
			word32 t3_100;
			vPortFree(a0_13, a2, a5, mstatus, dwArg0148, dwArg0188, out s0_11, out s1, out a0_10, out a1, out a2_98, out a3, out a4, out a5_99, out a6, out s4, out t3_100);
		}
		*(union Eq_2 *) 0x01 = s0_11;
		*((word32) s0_11 + 4) = 0x00;
		((word32) s0_11 + 8)->u0 = 0x00;
		a0Out = a0_10;
		a1Out = a1;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		a5Out.u0 = 0x01;
		a6Out = a6;
		s4Out = s4;
		return s1;
	}
}

