pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23061054: Register Eq_2 mbedtls_mpi_grow(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out Eq_320727 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_320733) a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_320736) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_mpi_shrink
//      mbedtls_mpi_copy
//      mbedtls_mpi_safe_cond_assign
//      mbedtls_mpi_lset
//      mbedtls_mpi_read_binary
//      mbedtls_mpi_shift_l
//      mbedtls_mpi_add_abs
//      mbedtls_mpi_mul_mpi
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_exp_mod
Eq_2 mbedtls_mpi_grow(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, union Eq_320727 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_320733 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, struct Eq_320736 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_320733 * a5_139 = (struct Eq_320733 *) 0x02000710;
	if (a1 <= 0x02000710)
	{
		ptr32 a0_126 = 0x00;
		if (a1 > 0x02000710)
		{
			ui32 a2_25;
			word32 s0_217;
			word32 s2_218;
			ra = mycalloc(ra, a1, a1, 0x04, a3, a4, 0x02000710, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_217, out s1, out a1, out a2_25, out a3, out a4, out a5_139, out s2_218, out s3, out s4, out s8);
			s2 = a1;
			if (a1 != 0x00)
			{
				struct Eq_320778 * s0_43 = *((word32) a1 + 8);
				if (a1 != 0x00)
				{
					Eq_2 a2_50;
					word32 a1_219;
					word32 a3_220;
					word32 a6_221;
					Eq_2 a5_47;
					word32 * a4_46;
					memcpy(a1, a1, a2_25 << 2, out a1_219, out a2_50, out a3_220, out a4_46, out a5_47, out a6_221, out a7);
					while (true)
					{
						a5_47 = (word32) a5_47 - 1;
						if (a5_47 == ~0x00)
							break;
						*a4_46 = 0x00;
						++a4_46;
					}
					word32 a0_222;
					word32 a2_223;
					word32 a6_224;
					word32 t3_225;
					vPortFree(a1, a2_50, a5_47, mstatus, dwArg0148, dwArg0188, out s0_43, out s1, out a0_222, out a1, out a2_223, out a3, out a4, out a5_139, out a6_224, out s4, out t3_225);
				}
				*((word32) s1 + 4) = s0_43;
				s0_43->t0008 = a1;
				a0_126 = 0x00;
			}
			else
				a0_126 = ~0x0F;
		}
		0x00 = (uint16) dwArg38;
		s1Out = s1;
		a0Out = a0_126;
		a1Out = a1;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_139;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		return ra;
	}
	else
	{
		s1Out = s1;
		a0Out = ~0x0F;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = (struct Eq_320733 *) 0x02000710;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		return ra;
	}
}

// 230610C2: Register Eq_2 mbedtls_mpi_shrink(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out (ptr32 Eq_320846) s1Out, Register out Eq_320847 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_320847 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_320853) s3Out, Register out ptr32 s8Out)
// Called from:
//      ecp_normalize_jac_many
Eq_2 mbedtls_mpi_shrink(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, struct Eq_320846 & s1Out, union Eq_320847 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_320847 & a5Out, union Eq_2 & s2Out, struct Eq_320853 & s3Out, ptr32 & s8Out)
{
	if (a1 < a4)
	{
		Eq_2 s1_17 = a1;
		uint32 a5_18;
		for (a5_18 = (word32) a4 - 1; a5_18 != 0x00; a5_18 += ~0x00)
		{
			a3 = a5_18 << 0x02;
			a4 = Mem15[a4 + a3:word32];
			if (a4 != 0x00)
				break;
		}
		Eq_2 a5_28 = a5_18 + 0x01;
		if (a1 < a5_28)
			s1_17 = a5_28;
		Eq_2 a1_54;
		struct Eq_320853 * s3_64;
		ptr32 s8_66;
		word32 a5_291;
		word32 s2_292;
		word32 s4_293;
		word32 a2_290;
		word32 s0_289;
		struct Eq_320846 * s1_107;
		ptr32 a4_105;
		ptr32 a3_104;
		Eq_2 ra_60 = mycalloc(ra, s1_17, s1_17, 0x04, a3, a4, a5_28, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_289, out s1_107, out a1_54, out a2_290, out a3_104, out a4_105, out a5_291, out s2_292, out s3_64, out s4_293, out s8_66);
		Eq_320847 a5_121 = ~0x0F;
		if (s1_17 != 0x00)
		{
			struct Eq_320778 * s0_112 = *((word32) a1_54 + 8);
			if (a1_54 != 0x00)
			{
				word32 a7_297;
				Eq_2 a2_79;
				word32 a3_295;
				word32 a1_294;
				word32 a6_296;
				Eq_2 a5_76;
				word32 * a4_75;
				memcpy(s1_17, a1_54, s1_107 << 0x02, out a1_294, out a2_79, out a3_295, out a4_75, out a5_76, out a6_296, out a7_297);
				while (true)
				{
					a5_76 = (word32) a5_76 - 1;
					if (a5_76 == ~0x00)
						break;
					*a4_75 = 0x00;
					++a4_75;
				}
				word32 s4_303;
				word32 t3_304;
				word32 a5_301;
				word32 a0_298;
				word32 a1_299;
				word32 a2_300;
				word32 a6_302;
				vPortFree(s1_17, a2_79, a5_76, mstatus, dwArg0148, dwArg0188, out s0_112, out s1_107, out a0_298, out a1_299, out a2_300, out a3_104, out a4_105, out a5_301, out a6_302, out s4_303, out t3_304);
			}
			s1_107->ptr0004 = s0_112;
			s0_112->t0008 = s1_17;
			a5_121.u0 = 0x00;
		}
		0x00 = (uint16) dwArg38;
		s1Out = s1_107;
		a0Out = a5_121;
		a2Out = dwArg10;
		a3Out = a3_104;
		a4Out = a4_105;
		a5Out = a5_121;
		s2Out = s1_17;
		s3Out = s3_64;
		s8Out = s8_66;
		return ra_60;
	}
	else
	{
		Eq_320847 a0_131;
		Eq_2 a2_132;
		Eq_320847 a5_133;
		ptr32 a3_136;
		ptr32 a4_137;
		struct Eq_320846 * s1_140;
		Eq_2 s2_141;
		struct Eq_320853 * s3_142;
		ptr32 s8_144;
		word32 a1_286;
		word32 a7_287;
		word32 s4_288;
		Eq_2 ra_139 = mbedtls_mpi_grow(ra, a1, a3, a4, mstatus, dwArg10, dwArg14, dwArg38, dwArg0108, dwArg0148, dwArg0188, out s1_140, out a0_131, out a1_286, out a2_132, out a3_136, out a4_137, out a5_133, out a7_287, out s2_141, out s3_142, out s4_288, out s8_144);
		s1Out = s1_140;
		a0Out = a0_131;
		a2Out = a2_132;
		a3Out = a3_136;
		a4Out = a4_137;
		a5Out = a5_133;
		s2Out = s2_141;
		s3Out = s3_142;
		s8Out = s8_144;
		return ra_139;
	}
}

