pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23061142: Register Eq_2 mbedtls_mpi_copy(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_321006 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out (ptr32 Eq_321010) a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out ptr32 a7Out, Register out (ptr32 Eq_321016) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_mpi_add_abs
//      mbedtls_mpi_sub_abs
//      mbedtls_mpi_mul_mpi
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_exp_mod
//      mbedtls_mpi_gcd
//      mbedtls_mpi_inv_mod
//      ecp_double_jac
//      ecp_normalize_jac_many
//      mbedtls_ecp_copy
//      ecp_add_mixed
//      mbedtls_ecp_mul
Eq_2 mbedtls_mpi_copy(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_321006 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, struct Eq_321010 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & a7Out, struct Eq_321016 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 s3_114;
	if (a0 != a1)
	{
		struct Eq_321016 * a1_17 = *((word32) a4 + 8);
		s2 = a1_17;
		if (a4 != 0x00)
		{
			do
				a2 = (word32) a2 - 1;
			while (a2 != 0x00 && *((word32) a4 + a2 * 0x04) == 0x00);
			a1_17->dw0000 + 0x00 = (int32) a0;
			s0 = (word32) a2 + 1;
			Eq_2 a0_51;
			ui32 a2_52;
			word32 s3_230;
			word32 s4_231;
			word32 s8_232;
			ra = mbedtls_mpi_grow(ra, (word32) a2 + 1, a3, a4, mstatus, dwLoc10, dwLoc0C, dwArg18, dwArgE8, dwArg0128, dwArg0168, out s1, out a0_51, out a1, out a2_52, out a3, out a4, out a5, out a7, out s2, out s3_230, out s4_231, out s8_232);
			s3_114 = a0_51;
			if (a0_51 == 0x00)
			{
				Eq_2 a0_77;
				word32 t1_233;
				word32 a1_234;
				word32 a2_235;
				word32 a3_236;
				word32 a4_237;
				word32 a5_238;
				ra = memset(ra, a0_51, 0x00, a2_52 << 2, out t1_233, out a0_77, out a1_234, out a2_235, out a3_236, out a4_237, out a5_238);
				s1 = *((word32) a0_77 + 8);
				word32 a2_239;
				word32 a6_240;
				memcpy(a0_77, s2[8], (word32) a2 + 1 << 0x02, out a1, out a2_239, out a3, out a4, out a5, out a6_240, out a7);
			}
l230611A2:
			s0Out = s0;
			s1Out = s1;
			a0Out = s3_114;
			a1Out = a1;
			a2Out = dwArg48;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5;
			a6Out = dwArg28;
			a7Out = a7;
			s2Out = s2;
			s3Out = s3_114;
			s4Out = dwArg04;
			s8Out = dwLoc1C;
			return ra;
		}
		word32 a0_226;
		word32 a2_227;
		word32 a6_228;
		word32 s4_229;
		s1 = mbedtls_mpi_free(a0, a2, a4, a5, mstatus, dwArg0128, dwArg0168, out a0_226, out a1, out a2_227, out a3, out a4, out a5, out a6_228, out s4_229);
	}
	s3_114.u0 = 0x00;
	goto l230611A2;
}

// 230611B2: Register Eq_2 mbedtls_mpi_safe_cond_assign(Register Eq_2 ra, Register Eq_2 a1, Register Eq_321133 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 (ptr32 Eq_321145)) a2Out, Register out (ptr32 Eq_321145) a3Out, Register out Eq_321146 a4Out, Register out (ptr32 Eq_321145) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_321150 s4Out)
// Called from:
//      ecp_select_comb
//      mbedtls_ecp_mul
Eq_2 mbedtls_mpi_safe_cond_assign(Eq_2 ra, Eq_2 a1, Eq_321133 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, struct Eq_321145 & a2Out, struct Eq_321145 & a3Out, union Eq_321146 & a4Out, struct Eq_321145 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_321150 & s4Out)
{
	ptr32 s0_134 = a0;
	ptr32 a0_20;
	ptr32 s2_30;
	ptr32 s3_31;
	word32 s8_173;
	word32 a7_171;
	word32 s4_172;
	int32 * a1_24;
	struct Eq_321145 * a3_122;
	Eq_321146 a4_123;
	struct Eq_321145 ** a2_120;
	struct Eq_321145 * a5_124;
	ptr32 s1_135;
	Eq_2 ra_28 = mbedtls_mpi_grow(ra, *((word32) a1 + 4), a3, a4, mstatus, dwLoc10, dwLoc0C, dwArg18, dwArgE8, dwArg0128, dwArg0168, out s1_135, out a0_20, out a1_24, out a2_120, out a3_122, out a4_123, out a5_124, out a7_171, out s2_30, out s3_31, out s4_172, out s8_173);
	if (a0_20 == 0x00)
	{
		struct Eq_321201 * a5_44 = 0x00 - a2;
		a2_120 = ((a2 | a5_44) & 0x00FF) >> 7;
		a4_123 = 0x01 - a2_120;
		a3_122 = a2_120 + a3_122;
		Mem53[a4_123 + a5_44 + a3_122:word32] = Mem16[a5_44 + 0x00:word32];
		a5_124 = null;
		while (true)
		{
			s1_135 = a3_122->ptr0004;
			if (a5_124 >= a3_122)
				break;
			struct Eq_321206 * a6_62 = a5_124 << 0x02;
			a1_24 += a6_62;
			a3_122 = a2_120 + Mem56[a3_122 + a6_62:word32] + (a4_123 + Mem56[a1_24 + 0x00:int32]);
			a3_122->a0000[0] = a1_24;
			a5_124 = (struct Eq_321145 *) ((char *) a5_124->a0000 + 1);
		}
		while (true)
		{
			s0_134 = a3_122->ptr0004;
			if (a5_124 >= a3_122)
				break;
			struct Eq_321145 ** a2_79 = a5_124 << 0x02;
			a3_122 = (struct Eq_321145 *) *a2_79;
			a2_120 = a2_79 + a4_123;
			*a2_120 = (struct Eq_321145 **) a3_122;
			a5_124 = (struct Eq_321145 *) ((char *) a5_124->a0000 + 1);
		}
	}
	s0Out = s0_134;
	s1Out = s1_135;
	a0Out = a0_20;
	a2Out = a2_120;
	a3Out = a3_122;
	a4Out = a4_123;
	a5Out = a5_124;
	s2Out = s2_30;
	s3Out = s3_31;
	s4Out = dwArg04;
	return ra_28;
}

// 23061238: Register Eq_2 mbedtls_mpi_lset(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_321254 s1Out, Register out ptr32 a1Out, Register out (ptr32 Eq_321256) a2Out, Register out (ptr32 Eq_321257) a3Out, Register out (ptr32 Eq_321258) a4Out, Register out (ptr32 Eq_321259) a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_321262) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_mpi_read_binary
//      mbedtls_mpi_shift_r
//      mbedtls_mpi_mul_mpi
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_exp_mod
//      mbedtls_mpi_inv_mod
//      ecp_normalize_jac
//      mbedtls_ecp_set_zero
//      mbedtls_ecp_point_read_binary
//      mbedtls_ecp_mul
Eq_2 mbedtls_mpi_lset(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_321254 & s1Out, ptr32 & a1Out, struct Eq_321256 & a2Out, struct Eq_321257 & a3Out, struct Eq_321258 & a4Out, struct Eq_321259 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, struct Eq_321262 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 a0_20;
	ui32 a2_21;
	Eq_321254 s1_29;
	struct Eq_321262 * s3_31;
	ptr32 s4_32;
	ptr32 s8_33;
	ptr32 a7_37;
	word32 s2_140;
	struct Eq_321259 * a5_102;
	struct Eq_321258 * a4_100;
	struct Eq_321257 * a3_25;
	ptr32 a1_24;
	Eq_2 ra_107 = mbedtls_mpi_grow(ra, 0x01, a3, a4, mstatus, dwArg00, dwArg04, dwArg28, dwArgF8, dwArg0138, dwArg0178, out s1_29, out a0_20, out a1_24, out a2_21, out a3_25, out a4_100, out a5_102, out a7_37, out s2_140, out s3_31, out s4_32, out s8_33);
	if (a0_20 == 0x00)
	{
		word32 a5_145;
		word32 a2_143;
		word32 a4_144;
		word32 t1_141;
		word32 a0_142;
		ra_107 = memset(ra_107, a0_20, 0x00, a2_21 << 2, out t1_141, out a0_142, out a1_24, out a2_143, out a3_25, out a4_144, out a5_145);
		struct Eq_320629 * s0_56 = a3_25->ptr0008;
		(s1_29 >> 0x1F ^ s1_29) - (s1_29 >> 0x1F) = (struct Eq_321257 **) a3_25;
		a4_100 = s1_29 >> 0x1F;
		a5_102 = (struct Eq_321259 *) ~0x00;
		if (s1_29 >= 0x00)
			a5_102 = (struct Eq_321259 *) 0x01;
		a5_102->dw0000 = s0_56;
	}
	0x00 = (uint16) dwArg38;
	s1Out = s1_29;
	a1Out = a1_24;
	a2Out = dwArg10;
	a3Out = a3_25;
	a4Out = a4_100;
	a5Out = a5_102;
	a7Out = a7_37;
	s2Out = a0_20;
	s3Out = s3_31;
	s4Out = s4_32;
	s8Out = s8_33;
	return ra_107;
}

// 23061282: Register ui32 mbedtls_mpi_get_bit(Register Eq_2 a1, Register Eq_2 a5, Register out Eq_321335 a4Out, Register out Eq_321336 a5Out)
// Called from:
//      mbedtls_ecp_mul
ui32 mbedtls_mpi_get_bit(Eq_2 a1, Eq_2 a5, union Eq_321335 & a4Out, union Eq_321336 & a5Out)
{
	if (a1 >= a5 << 5)
	{
		a4Out = a4;
		a5Out = a5 << 5;
		return 0x00;
	}
	else
	{
		union Eq_321336 * a0_9 = ((Eq_363462[]) 8)[a5].ptr0000;
		Eq_321336 a5_12 = *a0_9;
		a4Out = a1 >> 0x05 << 2;
		a5Out = a5_12;
		return a0_9 >> a1 & 0x01;
	}
}

// 230612A2: Register (ptr32 Eq_321359) mbedtls_mpi_lsb(Register (ptr32 Eq_321359) a0, Register Eq_2 a5, Register out Eq_321361 a2Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_mpi_gcd
struct Eq_321359 * mbedtls_mpi_lsb(struct Eq_321359 * a0, Eq_2 a5, union Eq_321361 & a2Out, union Eq_2 & a5Out)
{
	int32 a6_5 = a0->dw0004;
	Eq_321361 a3_29 = 0x00;
	int32 a4_10 = 0x00;
	while (true)
	{
		struct Eq_321359 * a1_23;
		if (a6_5 == a4_10)
			break;
		Eq_321371 t1_16 = *((word32) a5 + a4_10 * 0x04);
		a5.u0 = 0x00;
		do
		{
			uint32 a2_20 = t1_16 >> a5;
			a2 = a2_20 & 0x01;
			a1_23 = a3_29 + a5;
			if ((a2_20 & 0x01) != 0x00)
				goto l230612B4;
			a5 = (word16) a5.u0 + 1;
			a2 = a3_29 + a5;
		} while (a5 != 32);
		++a4_10;
		a3_29 = a2;
	}
	a1_23 = null;
l230612B4:
	a2Out = a2;
	a5Out = a5;
	return a1_23;
}

// 230612E2: Register Eq_2 mbedtls_mpi_bitlen(Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register out Eq_287554 a1Out, Register out Eq_2 a2Out, Register out Eq_287556 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_rsa_check_pubkey
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_mpi_size
//      mbedtls_mpi_shift_l
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_exp_mod
//      ecp_modp
//      mbedtls_ecp_group_load
Eq_2 mbedtls_mpi_bitlen(Eq_2 a2, Eq_2 a4, Eq_2 a5, union Eq_287554 & a1Out, union Eq_2 & a2Out, union Eq_287556 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a5 != 0x00)
	{
		ui32 a5_15 = (word32) a5 - 1;
		while (true)
		{
			int32 a3_10 = a5_15 << 0x02;
			if (a5_15 == 0x00)
				break;
			a2 = *((word32) a4 + a3_10);
			if (a2 != 0x00)
				break;
			a5_15 += ~0x00;
		}
		int32 a0_21;
		a4.u0 = 0x80000000;
		a3.u0 = 32;
		for (a0_21 = 0x00; a0_21 != 32; ++a0_21)
		{
			a1 = a2 & a4;
			if (a1 != 0x00)
				break;
			a4 >>= 1;
		}
		a5 = (a5_15 + 0x01 << 5) - a0_21;
	}
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	return a5;
}

