pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23061ADE: Register Eq_2 mbedtls_mpi_mul_int(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0178, Register out Eq_323052 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_323055) a2Out, Register out ptr32 a3Out, Register out Eq_323057 a4Out, Register out (ptr32 Eq_323058) a5Out, Register out (ptr32 Eq_323059) s2Out, Register out (ptr32 Eq_323060) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out (ptr32 Eq_323063) s6Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_mpi_div_mpi
//      ecp_double_jac
//      ecp_add_mixed
Eq_2 mbedtls_mpi_mul_int(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0178, union Eq_323052 & s0Out, ptr32 & s1Out, ptr32 & a0Out, struct Eq_323055 & a2Out, ptr32 & a3Out, union Eq_323057 & a4Out, struct Eq_323058 & a5Out, struct Eq_323059 & s2Out, struct Eq_323060 & s3Out, ptr32 & s4Out, ptr32 & s5Out, struct Eq_323063 & s6Out, ptr32 & s8Out)
{
	struct Eq_323055 * a2_22;
	ptr32 a3_23;
	Eq_323057 a4_24;
	struct Eq_323058 * a5_25;
	Eq_323052 s0_29;
	ptr32 s1_30;
	struct Eq_323059 * s2_31;
	struct Eq_323060 * s3_32;
	ptr32 s4_33;
	ptr32 s5_34;
	ptr32 s8_35;
	ptr32 a0_43;
	struct Eq_323063 * s6_44;
	Eq_2 ra_28 = mbedtls_mpi_mul_mpi(ra, a0, a1, fp + ~0x1B, a3, a4, s2, s4, s6, mstatus, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0178, out s0_29, out s1_30, out a0_43, out a2_22, out a3_23, out a4_24, out a5_25, out s2_31, out s3_32, out s4_33, out s5_34, out s6_44, out s8_35);
	s0Out = s0_29;
	s1Out = s1_30;
	a0Out = a0_43;
	a2Out = a2_22;
	a3Out = a3_23;
	a4Out = a4_24;
	a5Out = a5_25;
	s2Out = s2_31;
	s3Out = s3_32;
	s4Out = s4_33;
	s5Out = s5_34;
	s6Out = s6_44;
	s8Out = s8_35;
	return ra_28;
}

// 23061AF8: Register Eq_2 mbedtls_mpi_div_mpi(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0144, Register out Eq_2 s0Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_288315 s8Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out)
// Called from:
//      mbedtls_rsa_check_privkey
//      ecp_modp
Eq_2 mbedtls_mpi_div_mpi(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0124, Eq_2 dwArg0144, union Eq_2 & s0Out, union Eq_2 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_288315 & s8Out, ptr32 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out)
{
	Eq_2 s2_115 = a1;
	Eq_2 s4_1013 = a0;
	Eq_2 s3_103 = a2;
	Eq_2 s6_1493 = a3;
	Eq_2 s9_1016 = ~0x0B;
	Eq_2 a3_43;
	Eq_2 a4_44;
	word32 a6_1558;
	word32 a1_1557;
	Eq_2 a5_1007;
	Eq_2 a2_1006;
	if (mbedtls_mpi_cmp_int(0x00, a2, out a1_1557, out a2_1006, out a3_43, out a4_44, out a5_1007, out a6_1558) == 0x00)
	{
l23061B5E:
		ptr32 s9_1037 = dwLoc48->ptr0198;
		ptr32 s5_1038 = dwLoc48->ptr01B8;
		ptr32 a3_1040 = dwLoc48->ptr01F8;
		Eq_2 ra_1043 = dwLoc48->t015C;
		s0Out = s0;
		a0Out = s9_1016;
		a2Out = a2_1006;
		a3Out = a3_1040;
		a4Out = dwLoc70;
		a5Out = a5_1007;
		s2Out = s2_115;
		s3Out = s3_103;
		s4Out = s4_1013;
		s5Out = s5_1038;
		s6Out = s6_1493;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9_1037;
		s10Out = s10;
		s11Out = s11;
		return ra_1043;
	}
	s0.u0 = 0x01;
	dwLoc70 = 0x00;
	word32 a1_1559;
	Eq_2 a3_69;
	Eq_2 a4_109;
	if (mbedtls_mpi_cmp_abs(a2_1006, a3_43, a4_44, a5_1007, out a1_1559, out a3_69, out a4_109, out a5_1007) < 0x00)
	{
		if (a0 != 0x00)
		{
			word32 a7_1567;
			word32 s1_1565;
			word32 a1_1566;
			ra = mbedtls_mpi_lset(ra, a3_69, a4_109, mstatus, dwLoc90, dwLoc8C, dwLoc68, s6, dwArg68, dwArgA8, dwArgE8, out s1_1565, out a1_1566, out a2_1006, out a3_69, out a4_109, out a5_1007, out a7_1567, out s2_115, out s3_103, out s4_1013, out s8);
			s9_1016 = a0;
			if (a0 != 0x00)
				goto l23061B8A;
		}
		if (s2_115 == 0x00)
		{
l23061B5C:
			s9_1016.u0 = 0x00;
			goto l23061B5E;
		}
		Eq_2 a0_920;
		word32 a6_1571;
		word32 a7_1572;
		word32 a1_1569;
		word32 a3_1570;
		word32 s1_1568;
		mbedtls_mpi_copy(ra, s2_115, s3_103, a2_1006, a3_69, a4_109, a5_1007, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0, out s1_1568, out a0_920, out a1_1569, out a2_1006, out a3_1570, out a4_109, out a5_1007, out a6_1571, out a7_1572, out s2_115, out s3_103, out s4_1013, out s8);
		s9_1016 = a0_920;
		if (a0_920 == 0x00)
			goto l23061B5C;
		goto l23061B8A;
	}
	Eq_2 a0_75;
	Eq_2 a3_83;
	word32 a6_1562;
	word32 s1_1560;
	word32 s4_1564;
	word32 a7_1563;
	word32 a1_1561;
	Eq_2 ra_87 = mbedtls_mpi_copy(ra, fp + -0x007C, a2, a2_1006, a3_69, a4_109, a5_1007, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0, out s1_1560, out a0_75, out a1_1561, out a2_1006, out a3_83, out a4_109, out a5_1007, out a6_1562, out a7_1563, out s2_115, out s3_103, out s4_1564, out s8);
	s9_1016 = a0_75;
	if (a0_75 != 0x00)
		goto l23061B8A;
	Eq_2 a0_100;
	Eq_2 a3_108;
	word32 s1_1598;
	word32 a6_1600;
	word32 s4_1602;
	word32 a7_1601;
	word32 a1_1599;
	Eq_2 ra_112 = mbedtls_mpi_copy(ra_87, fp + -112, a3, a2_1006, a3_83, a4_109, a5_1007, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0, out s1_1598, out a0_100, out a1_1599, out a2_1006, out a3_108, out a4_109, out a5_1007, out a6_1600, out a7_1601, out s2_115, out s3_103, out s4_1602, out s8);
	s9_1016 = a0_100;
	if (a0_100 != 0x00)
		goto l23061B8A;
	Eq_2 a0_128;
	Eq_2 a3_133;
	word32 a1_1604;
	word32 s4_1606;
	word32 a7_1605;
	word32 s1_1603;
	Eq_2 ra_136 = mbedtls_mpi_grow(ra_112, (word32) *((word32) s3_103 + 4) + 2, a3_108, a4_109, mstatus, s0, 0x00, s6, dwArg78, dwArgB8, dwArgF8, out s1_1603, out a0_128, out a1_1604, out a2_1006, out a3_133, out a4_109, out a5_1007, out a7_1605, out s2_115, out s3_103, out s4_1606, out s8);
	s9_1016 = a0_128;
	if (a0_128 != 0x00)
		goto l23061B8A;
	Eq_2 a3_154;
	word32 a1_1608;
	word32 s4_1610;
	word32 a7_1609;
	word32 s1_1607;
	Eq_2 ra_159 = mbedtls_mpi_lset(ra_136, a3_133, a4_109, mstatus, dwLoc90, dwLoc8C, dwLoc68, s6, dwArg68, dwArgA8, dwArgE8, out s1_1607, out a1_1608, out a2_1006, out a3_154, out a4_109, out a5_1007, out a7_1609, out s2_115, out s3_103, out s4_1610, out s8);
	s9_1016 = fp + -100;
	if (fp == ~0x63)
	{
		Eq_2 a0_175;
		Eq_2 a3_180;
		word32 a1_1612;
		word32 a7_1613;
		word32 s4_1614;
		word32 s1_1611;
		Eq_2 ra_183 = mbedtls_mpi_grow(ra_159, 0x02, a3_154, a4_109, mstatus, s0, 0x00, s6, dwArg78, dwArgB8, dwArgF8, out s1_1611, out a0_175, out a1_1612, out a2_1006, out a3_180, out a4_109, out a5_1007, out a7_1613, out s2_115, out s3_103, out s4_1614, out s8);
		s9_1016 = a0_175;
		if (a0_175 != 0x00)
			goto l23061B8A;
		Eq_2 a0_199;
		word32 a1_1616;
		word32 a3_1617;
		word32 a7_1618;
		word32 s4_1619;
		word32 s1_1615;
		Eq_2 ra_207 = mbedtls_mpi_grow(ra_183, 0x03, a3_180, a4_109, mstatus, s0, 0x00, s6, dwArg78, dwArgB8, dwArgF8, out s1_1615, out a0_199, out a1_1616, out a2_1006, out a3_1617, out a4_109, out a5_1007, out a7_1618, out s2_115, out s3_103, out s4_1619, out s8);
		s9_1016 = a0_199;
		if (a0_199 == 0x00)
		{
			word32 a1_1620;
			word32 a3_1621;
			struct Eq_287564 * a0_222 = mbedtls_mpi_bitlen(a2_1006, a4_109, a5_1007, out a1_1620, out a2_1006, out a3_1621, out a4_109, out a5_1007);
			if ((a0_222 & 0x1F) == 0x1F)
			{
l23061C30:
				ui32 s0_289 = s7 - s10;
				Eq_2 a0_297;
				ui32 s0_306;
				word32 a3_1630;
				word32 a7_1631;
				word32 s4_1632;
				word32 s1_1629;
				Eq_2 ra_305 = mbedtls_mpi_shift_l(ra_207, s0_289 << 0x05, a2_1006, a4_109, a5_1007, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0_306, out s1_1629, out a0_297, out a2_1006, out a3_1630, out a4_109, out a5_1007, out a7_1631, out s2_115, out s3_103, out s4_1632, out s8);
				s9_1016 = a0_297;
				s0 = s0_306 << 2;
				if (a0_297 == 0x00)
				{
					do
					{
						Eq_2 a2_329;
						Eq_2 a3_330;
						struct Eq_323557 * a4_331;
						Eq_2 a5_332;
						word32 a6_1634;
						word32 a1_1633;
						if (mbedtls_mpi_cmp_mpi(a2_1006, a4_109, a5_1007, out a1_1633, out a2_329, out a3_330, out a4_331, out a5_332, out a6_1634) < 0x00)
						{
							Eq_2 s4_384;
							Eq_2 a3_375;
							uint32 ** s1_381;
							Eq_2 a1_1049;
							Eq_2 a0_1055;
							Eq_2 ra_380 = mbedtls_mpi_shift_r(ra_305, s0_289 << 0x05, a2_329, a5_332, mstatus, dwLoc90, dwLoc8C, dwLoc68, s6, dwArg68, dwArgA8, dwArgE8, out s1_381, out a0_1055, out a1_1049, out a2_1006, out a3_375, out a4_109, out a5_1007, out s2_115, out s3_103, out s4_384, out s8);
							s9_1016 = a0_1055;
							if (a0_1055 != 0x00)
								break;
							s8 = (word32) s10 - 1;
							Eq_2 a5_398 = (word32) s10 - 1 << 0x02;
							a4_109 = s10 << 0x02;
							a5_1007 = (s10 << 0x02) + -8;
							Eq_288315 s5_405 = (word32) s7 - 1;
							s0 = (word32) s7 + 0x3FFFFFFF - s10 << 2;
							while (s8 < s5_405)
							{
								s7 = s5_405 << 0x02;
								s0 = dwArg0124;
								s10 = (word32) s7 - 4;
								struct Eq_323647 * a3_421 = *a2_1006;
								word32 s11_423 = s11 + dwArg0124;
								if (a1_1049 >= a2_1006)
									*s11_423 = (union Eq_2 *) ~0x00;
								else
								{
									Eq_2 a4_426 = ~0x00;
									if (a2_1006 != 0x00)
									{
										word32 a1_429;
										word32 a4_1665;
										word32 a5_1666;
										a4_426 = __udivdi3(a0_1055, a1_1049, a2_1006, 0x00, out a1_429, out a3_421, out a4_1665, out a5_1666);
										if (a1_429 != 0x00)
											a4_426.u0 = ~0x00;
									}
									*s11_423 = (union Eq_2 *) a4_426;
								}
								Eq_2 a3_457 = a3_421 + 1;
								*a3_457 = a3_421->dw0000;
								s11 = (word32) s7 - 8;
								do
								{
									Eq_2 a4_465 = *a3_457;
									Eq_2 a3_466 = (word32) a3_457 - 1;
									*a3_466 = a4_465;
									Eq_2 a3_472;
									word32 s4_1670;
									word32 a7_1669;
									word32 a1_1668;
									word32 s1_1667;
									mbedtls_mpi_lset(ra_380, a3_466, a4_465, mstatus, dwLoc90, a5_398, dwLoc68, s6, dwArg68, dwArgA8, dwArgE8, out s1_1667, out a1_1668, out a2_1006, out a3_472, out a4_109, out a5_1007, out a7_1669, out s2_115, out s3_103, out s4_1670, out s8);
									a0_1055 = fp + -88;
									if (fp != ~0x57)
										goto l23061E38;
									union Eq_2 * a4_490 = null;
									if (s8 != 0x00)
									{
										a2_1006 = dwArg54;
										a4_490 = (union Eq_2 *) *a5_1007.u0;
									}
									*a4_490 = (union Eq_2 *) a3_472;
									*((word32) a3_472 + 4) = *a3_472;
									Eq_2 a3_518;
									word32 s5_529;
									word32 s4_1655;
									word32 s1_1654;
									Eq_2 ra_523 = mbedtls_mpi_mul_int(ra, fp + -88, fp + -88, a3_472, *a2_1006, s2_115, dwArg0144, s6_1493, mstatus, s0, 0x00, dwArg18, dwArg38, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgE8, out s0, out s1_1654, out a0_1055, out a2_1006, out a3_518, out a4_109, out a5_1007, out s2_115, out s3_103, out s4_1655, out s5_529, out s6_1493, out s8);
									if (a0_1055 != 0x00)
										goto l23061E38;
									a0_1055 = fp + -76;
									word32 a1_1657;
									word32 a3_1658;
									word32 s4_1660;
									word32 a7_1659;
									word32 s1_1656;
									ra_380 = mbedtls_mpi_lset(ra_523, a3_518, a4_109, mstatus, dwLoc90, a5_398, dwLoc68, s6, dwArg68, dwArgA8, dwArgE8, out s1_1656, out a1_1657, out a2_1006, out a3_1658, out a4_109, out a5_1007, out a7_1659, out s2_115, out s3_103, out s4_1660, out s8);
									if (fp != ~0x4B)
										goto l23061E38;
									word32 * a4_562 = null;
									if (s5_529 != 0x01)
										a4_562 = (word32 *) *((word32) s7 - 8);
									*a4_562 = 0x00;
									*((word32) ra + 4) = null;
									Eq_2 a4_580 = *ra;
									*((word32) ra + 8) = a4_580;
									union Eq_2 * a2_587;
									word32 a1_1661;
									word32 a4_1662;
									word32 a6_1664;
									word32 a5_1663;
								} while (mbedtls_mpi_cmp_mpi(a2_1006, a4_580, 0x01, out a1_1661, out a2_587, out a3_457, out a4_1662, out a5_1663, out a6_1664) > 0x00);
								word32 s5_614;
								word32 s1_1671;
								word32 s4_1673;
								word32 a3_1672;
								Eq_2 ra_608 = mbedtls_mpi_mul_int(ra_380, fp + -88, fp + -112, a3_457, *a2_587, s2_115, dwArg0144, s6_1493, mstatus, s0, 0x00, dwArg18, dwArg38, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgE8, out s0, out s1_1671, out a0_1055, out a2_1006, out a3_1672, out a4_109, out a5_1007, out s2_115, out s3_103, out s4_1673, out s5_614, out s6_1493, out s8);
								if (a0_1055 != 0x00)
									goto l23061E38;
								s7 = s0 << 0x03;
								Eq_2 a3_630;
								word32 s1_1674;
								word32 a7_1675;
								word32 s4_1676;
								Eq_2 ra_635 = mbedtls_mpi_shift_l(ra_608, s0 << 0x03, a2_1006, a4_109, a5_1007, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0, out s1_1674, out a0_1055, out a2_1006, out a3_630, out a4_109, out a5_1007, out a7_1675, out s2_115, out s3_103, out s4_1676, out s8);
								if (a0_1055 != 0x00)
									goto l23061E38;
								word32 a3_1677;
								ra_380 = mbedtls_mpi_sub_mpi(ra_635, s0, fp + -0x007C, a3_630, a4_109, a5_1007, s2_115, mstatus, 0x00, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0, out s1_381, out a0_1055, out a2_1006, out a3_1677, out a4_109, out a5_1007, out s2_115, out s3_103, out s4_384, out s8);
								if (a0_1055 != 0x00)
									goto l23061E38;
								word32 a6_1678;
								a0_1055 = mbedtls_mpi_cmp_int(0x00, a2_1006, out a1_1049, out a2_1006, out a3_375, out a4_109, out a5_1007, out a6_1678);
								if (a0_1055 < 0x00)
								{
									word32 s4_1684;
									word32 a7_1683;
									word32 a6_1682;
									word32 a3_1681;
									word32 a1_1680;
									word32 s1_1679;
									Eq_2 ra_698 = mbedtls_mpi_copy(ra_380, fp + -88, fp + -112, a2_1006, a3_375, a4_109, a5_1007, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0, out s1_1679, out a0_1055, out a1_1680, out a2_1006, out a3_1681, out a4_109, out a5_1007, out a6_1682, out a7_1683, out s2_115, out s3_103, out s4_1684, out s8);
									if (a0_1055 != 0x00)
										goto l23061E38;
									Eq_2 a3_713;
									word32 s4_1687;
									word32 a7_1686;
									word32 s1_1685;
									Eq_2 ra_718 = mbedtls_mpi_shift_l(ra_698, s0 << 0x03, a2_1006, a4_109, a5_1007, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0, out s1_1685, out a0_1055, out a2_1006, out a3_713, out a4_109, out a5_1007, out a7_1686, out s2_115, out s3_103, out s4_1687, out s8);
									if (a0_1055 != 0x00)
										goto l23061E38;
									struct Eq_324071 * a3_738;
									word32 s4_1689;
									word32 a7_1688;
									ra_380 = mbedtls_mpi_add_mpi(ra_718, s0, fp + -0x007C, a3_713, a4_109, a5_1007, s2_115, mstatus, 0x00, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0, out s1_381, out a0_1055, out a1_1049, out a2_1006, out a3_738, out a4_109, out a5_1007, out a7_1688, out s2_115, out s3_103, out s4_1689, out s8);
									if (a0_1055 != 0x00)
										goto l23061E38;
									a4_109 = a3_738->t0000;
									a3_738->tFFFFFFFF = a4_109;
									s4_384 = dwArg0144;
									a3_375 = &a3_738->tFFFFFFFF;
								}
								s5_405 = s5_614 + ~0x00;
								s0 = (word16) s0.u0 - 4;
							}
							if (s4_384 != 0x00)
							{
								union Eq_2 * s4_783;
								word32 a7_1641;
								word32 a3_1639;
								word32 a6_1640;
								word32 a1_1638;
								ra_380 = mbedtls_mpi_copy(ra_380, s4_384, fp + -100, a2_1006, a3_375, a4_109, a5_1007, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0, out s1_381, out a0_1055, out a1_1638, out a2_1006, out a3_1639, out a4_109, out a5_1007, out a6_1640, out a7_1641, out s2_115, out s3_103, out s4_783, out s8);
								if (a0_1055 != 0x00)
									goto l23061E38;
								a4_109 = Mem411[s3_103 + 0x00:int32] + Mem411[s6_1493 + 0x00:int32];
								*s4_783 = (union Eq_2 *) a4_109;
							}
							if (s2_115 == 0x00)
								break;
							Eq_2 a3_826;
							word32 a1_1643;
							word32 s4_1644;
							word32 s1_1642;
							Eq_2 ra_831 = mbedtls_mpi_shift_r(ra_380, s1_381, a2_1006, a5_1007, mstatus, dwLoc90, a5_398, dwLoc68, s6, dwArg68, dwArgA8, dwArgE8, out s1_1642, out a0_1055, out a1_1643, out a2_1006, out a3_826, out a4_109, out a5_1007, out s2_115, out s3_103, out s4_1644, out s8);
							if (a0_1055 == 0x00)
							{
								word32 a1_1646;
								word32 a3_1647;
								word32 a6_1648;
								word32 s4_1650;
								word32 a7_1649;
								word32 s1_1645;
								mbedtls_mpi_copy(ra_831, s2_115, fp + -0x007C, a2_1006, a3_826, *s3_103, a5_1007, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0, out s1_1645, out a0_1055, out a1_1646, out a2_1006, out a3_1647, out a4_109, out a5_1007, out a6_1648, out a7_1649, out s2_115, out s3_103, out s4_1650, out s8);
								if (a0_1055 == 0x00)
								{
									word32 a6_1653;
									word32 a1_1651;
									word32 a3_1652;
									if (mbedtls_mpi_cmp_int(0x00, a2_1006, out a1_1651, out a2_1006, out a3_1652, out a4_109, out a5_1007, out a6_1653) == 0x00)
									{
										*s2_115 = 0x01;
										a5_1007.u0 = 0x01;
										s9_1016.u0 = 0x00;
									}
									break;
								}
							}
l23061E38:
							s9_1016 = a0_1055;
							break;
						}
						Eq_2 a5_338 = a4_331->t0000;
						a4_331->t0001 = a5_338;
						Eq_2 a0_346;
						word32 s4_1637;
						word32 s1_1635;
						word32 a3_1636;
						ra_305 = mbedtls_mpi_sub_mpi(ra_305, s0, fp + -0x007C, a3_330, &a4_331->t0001, a5_338, s2_115, mstatus, 0x00, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0, out s1_1635, out a0_346, out a2_1006, out a3_1636, out a4_109, out a5_1007, out s2_115, out s3_103, out s4_1637, out s8);
						s9_1016 = a0_346;
					} while (a0_346 == 0x00);
				}
				goto l23061B8A;
			}
			Eq_2 a0_234;
			struct Eq_321600 * s1_244;
			word32 s4_1624;
			word32 a7_1623;
			word32 a3_1622;
			Eq_2 ra_242 = mbedtls_mpi_shift_l(ra_207, 0x1F - (a0_222 & 0x1F), a2_1006, a4_109, a5_1007, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0, out s1_244, out a0_234, out a2_1006, out a3_1622, out a4_109, out a5_1007, out a7_1623, out s2_115, out s3_103, out s4_1624, out s8);
			s9_1016 = a0_234;
			if (a0_234 != 0x00)
				goto l23061B8A;
			Eq_2 a0_259;
			word32 a7_1627;
			word32 s4_1628;
			word32 s1_1625;
			word32 a3_1626;
			ra_207 = mbedtls_mpi_shift_l(ra_242, s1_244, a2_1006, a4_109, a5_1007, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0, out s1_1625, out a0_259, out a2_1006, out a3_1626, out a4_109, out a5_1007, out a7_1627, out s2_115, out s3_103, out s4_1628, out s8);
			s9_1016 = a0_259;
			if (a0_259 == 0x00)
				goto l23061C30;
		}
	}
l23061B8A:
	Eq_2 a2_958;
	Eq_2 a5_959;
	Eq_2 a4_962;
	word32 a0_1573;
	word32 a3_1575;
	word32 a1_1574;
	word32 a6_1576;
	word32 s4_1577;
	mbedtls_mpi_free(fp + -0x007C, a2_1006, a4_109, a5_1007, mstatus, dwArgB8, dwArgF8, out a0_1573, out a1_1574, out a2_958, out a3_1575, out a4_962, out a5_959, out a6_1576, out s4_1577);
	word32 a3_1580;
	Eq_2 a2_970;
	Eq_2 a5_971;
	Eq_2 a4_974;
	word32 a6_1581;
	word32 s4_1582;
	word32 a0_1578;
	word32 a1_1579;
	mbedtls_mpi_free(fp + -112, a2_958, a4_962, a5_959, mstatus, dwArgB8, dwArgF8, out a0_1578, out a1_1579, out a2_970, out a3_1580, out a4_974, out a5_971, out a6_1581, out s4_1582);
	Eq_2 a2_982;
	Eq_2 a5_983;
	Eq_2 a4_986;
	word32 s4_1587;
	word32 a1_1584;
	word32 a0_1583;
	word32 a3_1585;
	word32 a6_1586;
	mbedtls_mpi_free(fp + -100, a2_970, a4_974, a5_971, mstatus, dwArgB8, dwArgF8, out a0_1583, out a1_1584, out a2_982, out a3_1585, out a4_986, out a5_983, out a6_1586, out s4_1587);
	Eq_2 a2_994;
	Eq_2 a5_995;
	Eq_2 a4_998;
	word32 a6_1591;
	word32 s4_1592;
	word32 a1_1589;
	word32 a3_1590;
	word32 a0_1588;
	mbedtls_mpi_free(fp + -88, a2_982, a4_986, a5_983, mstatus, dwArgB8, dwArgF8, out a0_1588, out a1_1589, out a2_994, out a3_1590, out a4_998, out a5_995, out a6_1591, out s4_1592);
	word32 a4_1596;
	word32 a6_1597;
	word32 a1_1594;
	word32 a3_1595;
	word32 a0_1593;
	mbedtls_mpi_free(fp + -76, a2_994, a4_998, a5_995, mstatus, dwArgB8, dwArgF8, out a0_1593, out a1_1594, out a2_1006, out a3_1595, out a4_1596, out a5_1007, out a6_1597, out s4_1013);
	goto l23061B5E;
}

