pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23061E3C: Register Eq_2 mbedtls_mpi_mod_mpi(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0114, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0134, Register out (ptr32 Eq_288392) s1Out, Register out (ptr32 Eq_288392) a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_2) s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out)
// Called from:
//      mbedtls_rsa_check_privkey
//      mbedtls_rsa_private
//      mbedtls_mpi_exp_mod
//      mbedtls_mpi_inv_mod
//      ecp_modp
Eq_2 mbedtls_mpi_mod_mpi(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0114, Eq_2 dwArg0128, Eq_2 dwArg0134, struct Eq_288392 & s1Out, struct Eq_288392 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out)
{
	struct Eq_288392 * s1_141;
	Eq_2 s2_110 = a2;
	word32 a1_326;
	word32 a2_327;
	word32 a6_328;
	Eq_2 a5_114;
	Eq_2 a4_115;
	Eq_2 a3_120;
	if (mbedtls_mpi_cmp_int(0x00, a2, out a1_326, out a2_327, out a3_120, out a4_115, out a5_114, out a6_328) >= 0x00)
	{
		struct Eq_288392 * a0_39;
		Eq_2 a2_41;
		Eq_2 s0_112;
		ra = mbedtls_mpi_div_mpi(ra, 0x00, a0, a1, a2, s5, s6, s7, s10, s11, mstatus, dwArg08, dwArg28, dwArg38, dwArg44, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0114, dwArg0134, out s0_112, out a0_39, out a2_41, out a3_120, out a4_115, out a5_114, out s2_110, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11);
		s1_141 = a0_39;
		if (a0_39 == null)
		{
			do
			{
				struct Eq_288392 * a0_131;
				Eq_2 a3_75;
				word32 a1_329;
				word32 a6_330;
				Eq_2 a2_116;
				if (mbedtls_mpi_cmp_int(0x00, a2_41, out a1_329, out a2_116, out a3_75, out a4_115, out a5_114, out a6_330) >= 0x00)
				{
					do
					{
						word32 a1_331;
						word32 a2_332;
						word32 a6_333;
						if (mbedtls_mpi_cmp_mpi(a2_116, a4_115, a5_114, out a1_331, out a2_332, out a3_120, out a4_115, out a5_114, out a6_333) < 0x00)
							goto l23061E68;
						ra = mbedtls_mpi_sub_mpi(ra, s0_112, s0_112, a3_120, a4_115, a5_114, s2_110, mstatus, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s0_112, out s1_141, out a0_131, out a2_116, out a3_120, out a4_115, out a5_114, out s2_110, out s3, out s4, out s8);
					} while (a0_131 == null);
					break;
				}
				word32 a1_334;
				ra = mbedtls_mpi_add_mpi(ra, s0_112, s0_112, a3_75, a4_115, a5_114, s2_110, mstatus, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s0_112, out s1_141, out a0_131, out a1_334, out a2_41, out a3_120, out a4_115, out a5_114, out a7, out s2_110, out s3, out s4, out s8);
			} while (a0_131 == null);
			s1_141 = a0_131;
		}
	}
	else
		s1_141 = (struct Eq_288392 *) ~0x09;
l23061E68:
	0x00 = (uint16) dwArg38;
	s1Out = s1_141;
	a0Out = s1_141;
	a2Out = dwArg10;
	a3Out = a3_120;
	a4Out = a4_115;
	a5Out = a5_114;
	a7Out = a7;
	s2Out = s2_110;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return ra;
}

// 23061EAE: Register Eq_2 mbedtls_mpi_exp_mod(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s11, Register ptr32 mstatus, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a7Out)
// Called from:
//      mbedtls_rsa_public
//      mbedtls_rsa_private
Eq_2 mbedtls_mpi_exp_mod(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s11, ptr32 mstatus, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a7Out)
{
	Eq_2 s7_1011 = a4;
	Eq_2 s0_1021 = ~0x03;
	word32 a6_2000;
	word32 a1_1999;
	Eq_2 a2_1159;
	ptr32 a3_1162;
	Eq_2 a5_1160;
	Eq_2 a4_1163;
	if (mbedtls_mpi_cmp_int(0x00, a2, out a1_1999, out a2_1159, out a3_1162, out a4_1163, out a5_1160, out a6_2000) < 0x00)
	{
l23062284:
		a2Out = a2_1159;
		a3Out = a3_1162;
		a4Out = a4_1163;
		a5Out = a5_1160;
		a7Out = a7;
		return s0_1021;
	}
	a5_1160 = *((word32) a3 + 8);
	int32 s5_53 = *a5_1160;
	s0_1021.u0 = ~0x03;
	Eq_2 s10_336 = s5_53 & 1;
	if ((s5_53 & 1) == 0x00)
		goto l23062284;
	word32 a1_2001;
	word32 a6_2002;
	if (mbedtls_mpi_cmp_int(0x00, a2_1159, out a1_2001, out a2_1159, out a3_1162, out a4_1163, out a5_1160, out a6_2002) < 0x00)
		goto l23062284;
	word32 a5_69;
	for (a5_69 = 0x03; a5_69 != 0x00; a5_69 += ~0x00)
		;
	Eq_2 a2_96;
	Eq_2 a4_98;
	Eq_2 a5_99;
	word32 a3_2006;
	word32 a0_2004;
	word32 t1_2003;
	word32 a1_2005;
	Eq_2 ra_100 = memset(ra, fp + -1600, 0x00, 0x0600, out t1_2003, out a0_2004, out a1_2005, out a2_96, out a3_2006, out a4_98, out a5_99);
	Eq_2 a3_108;
	Eq_2 a4_109;
	word32 a5_2009;
	word32 a1_2007;
	word32 a2_2008;
	struct Eq_287564 * a0_105 = mbedtls_mpi_bitlen(a2_96, a4_98, a5_99, out a1_2007, out a2_2008, out a3_108, out a4_109, out a5_2009);
	Eq_2 s5_1009 = 0x06;
	if (a0_105 <= (struct Eq_287564 *) 671)
	{
		s5_1009.u0 = 0x05;
		if (a0_105 <= (struct Eq_287564 *) 0x00EF)
		{
			s5_1009.u0 = 0x04;
			if (a0_105 <= (struct Eq_287564 *) 79)
			{
				s5_1009.u0 = 0x03;
				if (a0_105 <= (struct Eq_287564 *) 0x17)
					s5_1009 = s5_53 & 1;
			}
		}
	}
	int32 s6_124 = *((word32) a3 + 4);
	Eq_2 s6_128 = s6_124 + 0x01;
	Eq_2 a0_137;
	Eq_2 a3_142;
	word32 s4_2015;
	word32 s2_2013;
	word32 a1_2011;
	word32 s8_2016;
	word32 s3_2014;
	word32 a5_2012;
	word32 s1_2010;
	Eq_2 a4_1000;
	Eq_2 a2_1036;
	Eq_2 ra_145 = mbedtls_mpi_grow(ra_100, s6_124 + 0x01, a3_108, a4_109, mstatus, 0x01, 0x00, dwLoc0658, dwLoc0588, dwLoc0548, dwLoc0508, out s1_2010, out a0_137, out a1_2011, out a2_1036, out a3_142, out a4_1000, out a5_2012, out a7, out s2_2013, out s3_2014, out s4_2015, out s8_2016);
	s0_1021 = a0_137;
	if (a0_137 != 0x00)
	{
l2306224E:
		Eq_2 a5_1105 = 0x01;
		Eq_2 s1_1106 = 0x01 << (word16) s5_1009.u0 - 1;
		Eq_2 s5_1107 = 0x01 << s5_1009;
		while (s1_1106 < s5_1107)
		{
			word32 a3_2039;
			word32 a6_2040;
			word32 s4_2041;
			word32 a1_2038;
			word32 a0_2037;
			s1_1106 = mbedtls_mpi_free((word32) s1_1106 + 0x0C + (fp + -1600), a2_1036, a4_1000, fp + -1600, mstatus, dwLoc0548, dwLoc0508, out a0_2037, out a1_2038, out a2_1036, out a3_2039, out a4_1000, out a5_1105, out a6_2040, out s4_2041);
		}
		Eq_2 a2_1135;
		Eq_2 a5_1136;
		Eq_2 a4_1139;
		word32 s4_2046;
		word32 a3_2044;
		word32 a6_2045;
		word32 a0_2042;
		word32 a1_2043;
		mbedtls_mpi_free(fp + -1588, a2_1036, a4_1000, a5_1105, mstatus, dwLoc0548, dwLoc0508, out a0_2042, out a1_2043, out a2_1135, out a3_2044, out a4_1139, out a5_1136, out a6_2045, out s4_2046);
		Eq_2 a2_1147;
		Eq_2 a5_1148;
		Eq_2 a4_1151;
		word32 a1_2048;
		word32 a3_2049;
		word32 a6_2050;
		word32 s4_2051;
		word32 a0_2047;
		mbedtls_mpi_free(fp + -0x0664, a2_1135, a4_1139, a5_1136, mstatus, dwLoc0548, dwLoc0508, out a0_2047, out a1_2048, out a2_1147, out a3_2049, out a4_1151, out a5_1148, out a6_2050, out s4_2051);
		word32 a0_2052;
		word32 a1_2053;
		word32 s4_2055;
		word32 a6_2054;
		mbedtls_mpi_free(fp + -0x0658, a2_1147, a4_1151, a5_1148, mstatus, dwLoc0548, dwLoc0508, out a0_2052, out a1_2053, out a2_1159, out a3_1162, out a4_1163, out a5_1160, out a6_2054, out s4_2055);
		if (s7_1011 == 0x00)
		{
l2306227E:
			word32 s4_2059;
			word32 a6_2058;
			word32 a0_2056;
			word32 a1_2057;
			mbedtls_mpi_free(fp + -0x0670, a2_1159, a4_1163, a5_1160, mstatus, dwLoc0548, dwLoc0508, out a0_2056, out a1_2057, out a2_1159, out a3_1162, out a4_1163, out a5_1160, out a6_2058, out s4_2059);
			goto l23062284;
		}
		a5_1160 = *((word32) s7_1011 + 8);
		if (a5_1160 == 0x00)
			goto l2306227E;
		goto l23062284;
	}
	Eq_2 a0_161;
	Eq_2 a3_166;
	word32 s3_2021;
	word32 a5_2019;
	word32 s1_2017;
	word32 s4_2022;
	word32 s8_2023;
	word32 s2_2020;
	word32 a1_2018;
	Eq_2 ra_169 = mbedtls_mpi_grow(ra_145, s6_124 + 0x01, a3_142, a4_1000, mstatus, 0x01, 0x00, dwLoc0658, dwLoc0588, dwLoc0548, dwLoc0508, out s1_2017, out a0_161, out a1_2018, out a2_1036, out a3_166, out a4_1000, out a5_2019, out a7, out s2_2020, out s3_2021, out s4_2022, out s8_2023);
	s0_1021 = a0_161;
	if (a0_161 != 0x00)
		goto l2306224E;
	Eq_2 a0_185;
	word32 s1_2024;
	word32 a1_2025;
	word32 s3_2027;
	word32 s8_2028;
	word32 a5_2026;
	Eq_2 a3_190;
	Eq_2 s2_195;
	Eq_2 s4_197;
	Eq_2 ra_193 = mbedtls_mpi_grow(ra_169, s6_124 + 0x01 << 0x01, a3_166, a4_1000, mstatus, 0x01, 0x00, dwLoc0658, dwLoc0588, dwLoc0548, dwLoc0508, out s1_2024, out a0_185, out a1_2025, out a2_1036, out a3_190, out a4_1000, out a5_2026, out a7, out s2_195, out s3_2027, out s4_197, out s8_2028);
	s0_1021 = a0_185;
	if (a0_185 != 0x00)
		goto l2306224E;
	Eq_2 a5_207 = *s4_197;
	if (a4_1000 == ~0x00)
	{
		Eq_2 a0_213;
		word32 s0_2029;
		word32 a1_2031;
		word32 a5_2032;
		word32 s3_2034;
		word32 s4_2035;
		word32 s8_2036;
		word32 a6_2033;
		word32 s1_2030;
		ra_193 = mbedtls_mpi_copy(ra_193, fp + -0x0658, s4_197, a2_1036, a3_190, a4_1000, ~0x00, mstatus, 0x00, dwLoc05A8, dwLoc0568, dwLoc0528, out s0_2029, out s1_2030, out a0_213, out a1_2031, out a2_1036, out a3_190, out a4_1000, out a5_2032, out a6_2033, out a7, out s2_195, out s3_2034, out s4_2035, out s8_2036);
		s0_1021 = a0_213;
		if (a0_213 != 0x00)
			goto l2306224E;
		s4_197 = fp + -0x0658;
	}
	Eq_2 a5_328;
	Eq_2 a0_247;
	Eq_2 a1_245;
	if (a4 != 0x00 && *((word32) a4 + 8) != 0x00)
	{
		a1_245 = a4;
		a0_247 = fp + -0x0670;
	}
	else
	{
		Eq_2 a5_264;
		struct Eq_324588 * s2_269;
		word32 s8_2065;
		word32 s3_2063;
		word32 s4_2064;
		word32 s1_2060;
		word32 a1_2061;
		word32 a3_2062;
		Eq_2 ra_267 = mbedtls_mpi_lset(ra_193, a3_190, a4_1000, mstatus, dwLoc0690, a5_207, dwLoc0668, dwLoc0658, dwLoc0598, dwLoc0558, dwLoc0518, out s1_2060, out a1_2061, out a2_1036, out a3_2062, out a4_1000, out a5_264, out a7, out s2_269, out s3_2063, out s4_2064, out s8_2065);
		s0_1021 = fp + -0x0670;
		if (fp != ~0x066F)
			goto l2306224E;
		Eq_2 a0_284;
		Eq_2 s2_295;
		word32 s1_2067;
		word32 a5_2069;
		word32 s3_2070;
		word32 s4_2071;
		word32 s8_2072;
		word32 a3_2068;
		word32 s0_2066;
		Eq_2 ra_292 = mbedtls_mpi_shift_l(ra_267, s2_269->dw0004 << 6, a2_1036, a4_1000, a5_264, mstatus, 0x00, dwLoc05A8, dwLoc0568, dwLoc0528, out s0_2066, out s1_2067, out a0_284, out a2_1036, out a3_2068, out a4_1000, out a5_2069, out a7, out s2_295, out s3_2070, out s4_2071, out s8_2072);
		s0_1021 = a0_284;
		if (a0_284 != 0x00)
			goto l2306224E;
		Eq_2 a0_323;
		word32 s1_2073;
		word32 a3_2074;
		word32 s8_2076;
		word32 s9_2077;
		word32 s3_2075;
		ra_193 = mbedtls_mpi_mod_mpi(ra_292, fp + -0x0670, fp + -0x0670, s2_295, s5_1009, s6_124 + 0x01, a4, s5_53 & 1, s11, mstatus, dwLoc0688, dwLoc0668, dwLoc0658, dwLoc064C, dwLoc0648, dwLoc0638, dwLoc0628, dwLoc0618, dwLoc0608, 0x00, dwLoc05E8, dwLoc05C8, dwLoc05B8, dwLoc05A8, dwLoc0598, dwLoc0588, dwLoc057C, dwLoc0568, dwLoc055C, out s1_2073, out a0_323, out a2_1036, out a3_2074, out a4_1000, out a5_328, out a7, out s2_195, out s3_2075, out s4_197, out s5_1009, out s6_128, out s7_1011, out s8_2076, out s9_2077, out s10_336, out s11);
		s0_1021 = a0_323;
		if (a0_323 != 0x00)
			goto l2306224E;
		if (s7_1011 == 0x00)
		{
l23062026:
			Eq_2 ra_410;
			struct Eq_321968 * a5_408;
			word32 s1_412;
			Eq_2 a0_398;
			Eq_2 a2_383;
			Eq_2 a3_384;
			Eq_2 a4_385;
			Eq_2 a5_386;
			word32 a6_2079;
			word32 a1_2078;
			if (mbedtls_mpi_cmp_mpi(a2_1036, a4_1000, a5_328, out a1_2078, out a2_383, out a3_384, out a4_385, out a5_386, out a6_2079) >= 0x00)
			{
				word32 a3_2088;
				word32 s3_2090;
				word32 s4_2091;
				word32 s6_2092;
				word32 s9_2094;
				word32 s10_2095;
				word32 s11_2096;
				word32 s8_2093;
				word32 s2_2089;
				ra_410 = mbedtls_mpi_mod_mpi(ra_193, fp + -1588, s4_197, s2_195, s5_1009, s6_128, s7_1011, s10_336, s11, mstatus, dwLoc0688, dwLoc0668, dwLoc0658, dwLoc064C, dwLoc0648, dwLoc0638, dwLoc0628, dwLoc0618, dwLoc0608, 0x00, dwLoc05E8, dwLoc05C8, dwLoc05B8, dwLoc05A8, dwLoc0598, dwLoc0588, dwLoc057C, dwLoc0568, dwLoc055C, out s1_412, out a0_398, out a2_1036, out a3_2088, out a4_1000, out a5_408, out a7, out s2_2089, out s3_2090, out s4_2091, out s5_1009, out s6_2092, out s7_1011, out s8_2093, out s9_2094, out s10_2095, out s11_2096);
			}
			else
			{
				word32 s4_2086;
				word32 s8_2087;
				word32 s2_2084;
				word32 s3_2085;
				word32 a1_2081;
				word32 a3_2082;
				word32 a6_2083;
				word32 s0_2080;
				ra_410 = mbedtls_mpi_copy(ra_193, fp + -1588, s4_197, a2_383, a3_384, a4_385, a5_386, mstatus, 0x00, dwLoc05A8, dwLoc0568, dwLoc0528, out s0_2080, out s1_412, out a0_398, out a1_2081, out a2_1036, out a3_2082, out a4_1000, out a5_408, out a6_2083, out a7, out s2_2084, out s3_2085, out s4_2086, out s8_2087);
			}
			s0_1021 = a0_398;
			if (a0_398 != 0x00)
				goto l2306224E;
			Eq_2 a0_474;
			Eq_2 a5_476;
			Eq_2 a3_480;
			Eq_2 s3_488;
			word32 s11_2105;
			word32 s8_2102;
			word32 s9_2103;
			word32 s10_2104;
			word32 s6_2101;
			word32 s4_2100;
			word32 t1_2097;
			word32 s1_2098;
			word32 s2_2099;
			Eq_2 ra_482 = mpi_montmul(ra_410, fp + -1588, fp + -0x0670, 0x00 - s1_412, fp + -0x0664, a5_408, dwLoc0584, out t1_2097, out s1_2098, out a0_474, out a2_1036, out a3_480, out a4_1000, out a5_476, out a7, out s2_2099, out s3_488, out s4_2100, out s5_1009, out s6_2101, out s7_1011, out s8_2102, out s9_2103, out s10_2104, out s11_2105);
			s0_1021 = a0_474;
			if (a0_474 != 0x00)
				goto l2306224E;
			Eq_2 a0_506;
			Eq_2 s3_509;
			struct Eq_319990 * s1_520;
			word32 a5_2109;
			word32 s2_2111;
			word32 s4_2112;
			word32 s8_2113;
			word32 a6_2110;
			word32 a1_2107;
			word32 a3_2108;
			word32 s0_2106;
			Eq_2 ra_518 = mbedtls_mpi_copy(ra_482, s3_488, fp + -0x0670, a2_1036, a3_480, a4_1000, a5_476, mstatus, 0x00, dwLoc05A8, dwLoc0568, dwLoc0528, out s0_2106, out s1_520, out a0_506, out a1_2107, out a2_1036, out a3_2108, out a4_1000, out a5_2109, out a6_2110, out a7, out s2_2111, out s3_509, out s4_2112, out s8_2113);
			s0_1021 = a0_506;
			if (a0_506 == 0x00)
			{
				Eq_2 a0_540;
				Eq_2 a3_546;
				struct Eq_324866 * s2_553;
				Eq_2 s6_557;
				word32 s4_2115;
				word32 s9_2116;
				word32 s11_2118;
				word32 s10_2117;
				word32 t1_2114;
				struct Eq_324873 * s8_1219;
				struct Eq_319990 * s1_1003;
				Eq_2 s3_1007;
				struct Eq_321968 * a5_1230;
				Eq_2 ra_1001 = mpi_montmul(ra_518, s3_509, fp + -1612, s1_520, fp + -0x0664, fp + -0x0674, dwLoc0584, out t1_2114, out s1_1003, out a0_540, out a2_1036, out a3_546, out a4_1000, out a5_1230, out a7, out s2_553, out s3_1007, out s4_2115, out s5_1009, out s6_557, out s7_1011, out s8_1219, out s9_2116, out s10_2117, out s11_2118);
				s0_1021 = a0_540;
				if (a0_540 != 0x00)
					goto l2306224E;
				if (s5_1009 == s6_557)
				{
l2306208C:
					Eq_2 s4_1023 = s8_1219->t0004;
					word32 t1_1222 = 0x00;
					int32 s6_1215 = 0x00;
					while (true)
					{
						Eq_2 s11_1005 = 0x00;
						do
						{
							if (s6_1215 == 0x00)
							{
								if (s4_1023 == 0x00)
								{
									while (s4_1023 != s11_1005)
									{
										Eq_2 a0_957;
										ui32 s6_974;
										ui32 s9_977;
										word32 a3_2130;
										word32 s8_2132;
										word32 s10_2133;
										word32 s2_2131;
										word32 t1_2129;
										word32 s4_1008;
										ra_1001 = mpi_montmul(ra_1001, s3_1007, s3_1007, s1_1003, fp + -0x0664, a5_1230, dwLoc0584, out t1_2129, out s1_1003, out a0_957, out a2_1036, out a3_2130, out a4_1000, out a5_1230, out a7, out s2_2131, out s3_1007, out s4_1008, out s5_1009, out s6_974, out s7_1011, out s8_2132, out s9_977, out s10_2133, out s11_1005);
										s0_1021 = a0_957;
										if (a0_957 != 0x00)
											goto l2306224E;
										if ((s6_974 & s9_977 << 1) != 0x00)
										{
											Eq_2 a0_993;
											word32 a3_2178;
											word32 s2_2179;
											word32 s8_2181;
											word32 s9_2182;
											word32 s10_2183;
											word32 s6_2180;
											word32 t1_2177;
											ra_1001 = mpi_montmul(ra_1001, s3_1007, fp + -1588, s1_1003, fp + -0x0664, a5_1230, dwLoc0584, out t1_2177, out s1_1003, out a0_993, out a2_1036, out a3_2178, out a4_1000, out a5_1230, out a7, out s2_2179, out s3_1007, out s4_1008, out s5_1009, out s6_2180, out s7_1011, out s8_2181, out s9_2182, out s10_2183, out s11_1005);
											s0_1021 = a0_993;
											if (a0_993 != 0x00)
												goto l2306224E;
										}
										s4_1023 = s4_1008 + 0x01;
									}
									Eq_2 a0_1035;
									Eq_2 a3_1041;
									Eq_2 s2_1048;
									Eq_2 s3_1049;
									word32 t1_2134;
									word32 a5_2136;
									word32 s11_2142;
									word32 s4_2137;
									word32 s8_2139;
									word32 s9_2140;
									word32 s10_2141;
									word32 s6_2138;
									word32 s1_2135;
									Eq_2 ra_1043 = mpi_montmul(ra_1001, s3_1007, fp + -1612, s1_1003, fp + -0x0664, fp + -0x0674, dwLoc0584, out t1_2134, out s1_2135, out a0_1035, out a2_1036, out a3_1041, out a4_1000, out a5_2136, out a7, out s2_1048, out s3_1049, out s4_2137, out s5_1009, out s6_2138, out s7_1011, out s8_2139, out s9_2140, out s10_2141, out s11_2142);
									s0_1021 = a0_1035;
									if (a0_1035 == 0x00)
									{
										s0_1021 = dwLoc05CC;
										if (a4_1000 == ~0x00)
										{
											*s3_1049 = a4_1000;
											Eq_2 a0_1078;
											word32 s8_2151;
											word32 s3_2149;
											word32 s4_2150;
											word32 a5_2147;
											word32 s2_2148;
											word32 s1_2144;
											word32 a1_2145;
											word32 a3_2146;
											word32 s0_2143;
											mbedtls_mpi_add_mpi(ra_1043, dwLoc05CC, s3_1049, a3_1041, a4_1000, ~0x00, s2_1048, mstatus, 0x00, dwLoc05D8, dwLoc05B8, dwLoc0598, dwLoc0588, dwLoc0578, dwLoc0558, out s0_2143, out s1_2144, out a0_1078, out a1_2145, out a2_1036, out a3_2146, out a4_1000, out a5_2147, out a7, out s2_2148, out s3_2149, out s4_2150, out s8_2151);
											s0_1021 = a0_1078;
										}
									}
									goto l2306224E;
								}
								s4_1023 = (word32) s4_1023 - 1;
								s6_1215 = 32;
							}
							s6_1215 += ~0x00;
							if ((s8_1219->ptr0008[s4_1023] >> s6_1215 & 0x01) == 0x00)
							{
								if (t1_1222 == 0x00)
									continue;
								a5_1230 = (struct Eq_321968 *) 0x01;
								if (t1_1222 == 0x01)
								{
									Eq_2 a0_911;
									word32 s9_2186;
									word32 s10_2187;
									word32 s2_2185;
									word32 a3_2184;
									ra_1001 = mpi_montmul(ra_1001, s3_1007, s3_1007, s1_1003, fp + -0x0664, (struct Eq_321968 *) 0x01, dwLoc0584, out t1_1222, out s1_1003, out a0_911, out a2_1036, out a3_2184, out a4_1000, out a5_1230, out a7, out s2_2185, out s3_1007, out s4_1023, out s5_1009, out s6_1215, out s7_1011, out s8_1219, out s9_2186, out s10_2187, out s11_1005);
									s0_1021 = a0_911;
									if (a0_911 == 0x00)
										continue;
									goto l2306224E;
								}
							}
							s11_1005 = (word32) s11_1005 + 1;
							t1_1222 = 0x02;
						} while (s5_1009 != s11_1005);
						do
						{
							Eq_2 a0_825;
							up32 s11_837;
							word32 s9_845;
							up32 t1_847;
							word32 s10_2193;
							word32 s6_2191;
							word32 s8_2192;
							word32 s2_2189;
							word32 s4_2190;
							word32 a3_2188;
							ra_1001 = mpi_montmul(ra_1001, s3_1007, s3_1007, s1_1003, fp + -0x0664, a5_1230, dwLoc0584, out t1_847, out s1_1003, out a0_825, out a2_1036, out a3_2188, out a4_1000, out a5_1230, out a7, out s2_2189, out s3_1007, out s4_2190, out s5_1009, out s6_2191, out s7_1011, out s8_2192, out s9_845, out s10_2193, out s11_837);
							s0_1021 = a0_825;
							if (a0_825 != 0x00)
								goto l2306224E;
						} while (t1_847 + 0x01 < s11_837);
						Eq_2 a0_864;
						word32 s10_875;
						word32 a3_2195;
						word32 s2_2196;
						word32 s9_2197;
						word32 s11_2198;
						word32 t1_2194;
						ra_1001 = mpi_montmul(ra_1001, s3_1007, s9_845 + 0x0C + (fp + -1600), s1_1003, fp + -0x0664, fp + -1600, dwLoc0584, out t1_2194, out s1_1003, out a0_864, out a2_1036, out a3_2195, out a4_1000, out a5_1230, out a7, out s2_2196, out s3_1007, out s4_1023, out s5_1009, out s6_1215, out s7_1011, out s8_1219, out s9_2197, out s10_875, out s11_2198);
						s0_1021 = a0_864;
						if (a0_864 != 0x00)
							break;
						t1_1222 = s10_875;
					}
					goto l2306224E;
				}
				Eq_2 s9_574 = fp + -1600 + (0x0C << (word16) s5_1009.u0 - 1);
				Eq_2 a0_577;
				Eq_2 a5_579;
				Eq_2 a3_582;
				word32 s4_2123;
				word32 s8_2124;
				word32 s3_2122;
				word32 s2_2121;
				word32 s1_2119;
				word32 a1_2120;
				Eq_2 ra_585 = mbedtls_mpi_grow(ra_1001, s2_553->dw0004 + 0x01, a3_546, a4_1000, mstatus, 0x01, 0x00, dwLoc0658, dwLoc0588, dwLoc0548, dwLoc0508, out s1_2119, out a0_577, out a1_2120, out a2_1036, out a3_582, out a4_1000, out a5_579, out a7, out s2_2121, out s3_2122, out s4_2123, out s8_2124);
				s0_1021 = a0_577;
				if (a0_577 != 0x00)
					goto l2306224E;
				Eq_2 a0_602;
				word32 a1_2153;
				word32 a3_2154;
				word32 a6_2155;
				word32 s3_2157;
				word32 s4_2158;
				word32 s8_2159;
				word32 s2_2156;
				word32 s0_2152;
				ra_1001 = mbedtls_mpi_copy(ra_585, s9_574, fp + -1588, a2_1036, a3_582, a4_1000, a5_579, mstatus, 0x00, dwLoc05A8, dwLoc0568, dwLoc0528, out s0_2152, out s1_1003, out a0_602, out a1_2153, out a2_1036, out a3_2154, out a4_1000, out a5_1230, out a6_2155, out a7, out s2_2156, out s3_2157, out s4_2158, out s8_2159);
				s0_1021 = a0_602;
				if (a0_602 == 0x00)
				{
					do
					{
						Eq_2 a0_638;
						up32 s11_650;
						up32 s4_653;
						word32 s6_655;
						word32 t1_2160;
						word32 s10_2161;
						struct Eq_325140 * s2_651;
						Eq_2 a3_644;
						ra_1001 = mpi_montmul(ra_1001, s9_574, s9_574, s1_1003, fp + -0x0664, a5_1230, dwLoc0584, out t1_2160, out s1_1003, out a0_638, out a2_1036, out a3_644, out a4_1000, out a5_1230, out a7, out s2_651, out s3_1007, out s4_653, out s5_1009, out s6_655, out s7_1011, out s8_1219, out s9_574, out s10_2161, out s11_650);
						s0_1021 = a0_638;
						if (a0_638 != 0x00)
							goto l2306224E;
					} while (s4_653 + 0x01 < s11_650);
					uint32 s6_669 = s6_655 + 0x01;
					uint32 s11_670 = 0x01 << s5_1009;
					while (s6_669 < s11_670)
					{
						Eq_2 a0_685;
						Eq_2 a5_687;
						Eq_2 a3_690;
						Eq_2 s4_697;
						word32 s3_2165;
						word32 s8_2166;
						word32 s2_2164;
						word32 a1_2163;
						word32 s1_2162;
