pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
struct Eq_327812 * g_ptr230626CC = &g_t973200F5;
// 230626DC: void get_pkcs_padding(Register ptr32 a0, Register Eq_326945 a1, Register (ptr32 Eq_326945) a2)
void get_pkcs_padding(ptr32 a0, Eq_326945 a1, union Eq_326945 * a2)
{
	if (a0 == 0x00 || a2 == null)
		return;
	Eq_326945 a6_10 = (word32) ((word32) a1 + a0 + -1);
	Eq_326945 a7_12 = a1 - a6_10;
	*a2 = (union Eq_326945 *) a7_12;
	ui32 a5_14 = (word32) (a1 < a6_10) | (word32) (a6_10 < 1);
	Eq_326945 a4_16 = 0x00;
	while (a4_16 != a1)
	{
		a4_16 = (word32) a4_16 + 1;
		a5_14 = (a5_14 | ((word32) (a4_16 < a7_12) ^ 1) + (a6_10 ^ (word32) (*((word32) a4_16 + a0)))) & 0x00FF;
	}
	if (a5_14 != 0x00)
		;
}

// 23062738: void add_zeros_padding(Register ptr32 a0, Register Eq_326989 a1, Register Eq_326989 a2)
void add_zeros_padding(ptr32 a0, Eq_326989 a1, Eq_326989 a2)
{
	while (a2 < a1)
	{
		*((word32) a2 + a0) = 0x00;
		a2 = (word32) a2 + 1;
	}
}

struct Eq_327812 * g_ptr23062744 = &g_t6050007;
// 2306274A: void get_no_padding(Register word32 a0, Register (ptr32 word32) a1, Register word32 a2)
void get_no_padding(word32 a0, word32 * a1, word32 a2)
{
	if (a0 == 0x00 || a2 == 0x00)
		return;
	*a1 = a2;
}

// 2306275C: void get_zeros_padding(Register ptr32 a0, Register (ptr32 Eq_327008) a1, Register (ptr32 word32) a2)
void get_zeros_padding(ptr32 a0, struct Eq_327008 * a1, word32 * a2)
{
	if (a0 == 0x00 || a2 == null)
		return;
	*a2 = 0x00;
	ui32 a5_16 = 0x00;
	while (a1 != null)
	{
		struct Eq_327008 * a3_10 = (char *) a1 - 1;
		ui32 a4_17 = (word32) ((word32) a3_10[a0] != 0x00) | a5_16;
		*(a1 + (a5_16 ^ a4_17) | a1) = a1->dw0000;
		a1 = a3_10;
		a5_16 = a4_17;
	}
}

// 23062798: Register (ptr32 Eq_295303) mbedtls_cipher_info_from_type(Register (ptr32 Eq_295303) a0, Register (ptr32 Eq_295303) a4, Register out (ptr32 byte) a5Out)
// Called from:
//      mbedtls_ssl_derive_keys
struct Eq_295303 * mbedtls_cipher_info_from_type(struct Eq_295303 * a0, struct Eq_295303 * a4, byte & a5Out)
{
	do
	{
		byte * a5_7 = a4->ptr0004;
	} while (a4 != null && (word32) (*a5_7) != a0);
	a5Out = a5_7;
	return a4;
}

// 230627B4: Register (ptr32 Eq_295827) mbedtls_cipher_info_from_values(Register (ptr32 Eq_295827) a0, Register (ptr32 Eq_295827) a1, Register (ptr32 Eq_295827) a2, Register (ptr32 Eq_295827) a3, Register (ptr32 Eq_295827) a5, Register out (ptr32 Eq_295827) a4Out)
// Called from:
//      mbedtls_gcm_setkey
struct Eq_295827 * mbedtls_cipher_info_from_values(struct Eq_295827 * a0, struct Eq_295827 * a1, struct Eq_295827 * a2, struct Eq_295827 * a3, struct Eq_295827 * a5, struct Eq_295827 & a4Out)
{
	while (true)
	{
		struct Eq_295827 * a4_7 = a5->ptr0004;
		if (a5 == null)
			break;
		a5 = a3->ptr0018;
		a3 = (word32) a3->b0000;
		if (a3 == a0)
		{
			a5 = a3->ptr0004;
			if (a3 == a1)
			{
				a3 = (word32) a5->b0001;
				if (a3 == a2)
					break;
			}
		}
	}
	a4Out = a4_7;
	return a5;
}

// 230627E0: Register Eq_2 mbedtls_cipher_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      mbedtls_ssl_setup
Eq_2 mbedtls_cipher_init(Eq_2 ra, Eq_2 a0)
{
	word32 t1_16;
	word32 a0_17;
	word32 a1_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	return memset(ra, a0, 0x00, 64, out t1_16, out a0_17, out a1_18, out a2_19, out a3_20, out a4_21, out a5_22);
}

// 230627EA: Register word32 mbedtls_cipher_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_ssl_transform_free
//      mbedtls_gcm_setkey
//      mbedtls_gcm_free
word32 mbedtls_cipher_free(Eq_2 ra, Eq_2 a0, Eq_2 a5, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a5Out = a5;
		return a2;
	}
	else
	{
		Eq_2 s0_17 = a0;
		word32 a0_10 = *((word32) a0 + 60);
		if (a0_10 != 0x00)
		{
			<anonymous> * a5_14 = *((word32) *((word32) a5 + 24) + 32);
			word32 a2_20;
			a5_14();
		}
		Eq_2 a5_22 = (word32) s0_17 + 64;
		while (s0_17 != a5_22)
		{
			s0_17->u1 = 0x00;
			s0_17 = (word32) s0_17 + 1;
		}
		a5Out = a5_22;
		return dwArg10;
	}
}

// 2306281A: Register Eq_2 mbedtls_cipher_setkey(Register Eq_2 a0, Register (ptr32 Eq_295827) a2, Register word32 a3, Register (ptr32 Eq_296137) a4, Register (ptr32 Eq_296138) a5, Register out (ptr32 Eq_296137) a4Out, Register out (ptr32 Eq_296138) a5Out)
// Called from:
//      mbedtls_ssl_derive_keys
//      mbedtls_gcm_setkey
Eq_2 mbedtls_cipher_setkey(Eq_2 a0, struct Eq_295827 * a2, word32 a3, struct Eq_296137 * a4, struct Eq_296138 * a5, struct Eq_296137 & a4Out, struct Eq_296138 & a5Out)
{
	if (a0 != 0x00)
	{
		struct Eq_295827 * a0_6 = a5->ptr0000;
		if (a5 == null)
			goto l23062858;
		a5 = a4->ptr0010;
		a4 &= 0x02;
		if ((a4 & 0x02) == 0x00)
		{
			a5 = (a4 & 0x02)->ptr0004;
			if ((a4 & 0x02) != a2)
				goto l23062858;
		}
		struct Eq_327146 * a5_25;
		<anonymous> * t1_26;
		a2->ptr0004 = a0_6;
		a0_6->b0008 = (byte) a3;
		a4 = (struct Eq_296137 *) 0x01;
		if (a3 == 0x01)
		{
l23062844:
			a5_25 = a5->ptr0018;
			t1_26 = a5_25->ptr0014;
			goto l2306284A;
		}
		a4 = (word32) a5->b0001 + ~0x02 & 0x00FD;
		if (a4 == null)
			goto l23062844;
		if (a3 == 0x00)
		{
			a5_25 = a5->ptr0018;
			t1_26 = a5_25->ptr0018;
l2306284A:
			Eq_2 a0_47;
			struct Eq_296138 * a5_48;
			struct Eq_296137 * a4_49;
			word32 t1_52;
			t1_26();
			a4Out = a4_49;
			a5Out = a5_48;
			return a0_47;
		}
	}
l23062858:
	a4Out = a4;
	a5Out = a5;
	return ~0x060000FF;
}

// 23062860: Register Eq_2 mbedtls_cipher_set_iv(Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_cipher_crypt
Eq_2 mbedtls_cipher_set_iv(word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a0Out = ~0x060000FF;
		a1Out = a1;
		a3Out = a3;
		a5Out = a5;
		return s1;
	}
	ptr32 a0_21;
	Eq_2 a0_14 = *a5;
	if (a5 != 0x00 && a1 != 0x00)
	{
		Eq_2 s0_19 = a2;
		if (a2 > 0x10)
		{
			a0_21 = ~0x0600007F;
			goto l23062896;
		}
		Eq_2 a5_22 = *(union Eq_2 *) 0x20;
		if (false)
		{
l23062888:
			word32 a6_133;
			word32 a7_134;
			word32 a4_132;
			word32 a2_131;
			memcpy((word32) a0_14 + 40, a1, s0_19, out a1, out a2_131, out a3, out a4_132, out a5, out a6_133, out a7_134);
			*((word32) s0_19 + 56) = a0_14;
			a0_21 = 0x00;
l23062896:
			a0Out = a0_21;
			a1Out = a1;
			a3Out = a3;
			a5Out = a5;
			return a0_14;
		}
		a5 = *((word32) a5_22 + 0x0C);
		if (a2 >= a5)
		{
			s0_19 = a5;
			goto l23062888;
		}
	}
	a0_21 = ~0x060000FF;
	goto l23062896;
}

