pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 230628B8: Register Eq_2 mbedtls_cipher_reset(Register Eq_2 a0, Register Eq_2 a5)
// Called from:
//      mbedtls_cipher_crypt
Eq_2 mbedtls_cipher_reset(Eq_2 a0, Eq_2 a5)
{
	if (a0 == 0x00)
		return ~0x060000FF;
	struct Eq_327251 * a0_6 = *a5;
	if (a5 == 0x00)
		return ~0x060000FF;
	a0_6->dw0024 = 0x00;
	return 0x00;
}

// 230628CE: Register Eq_2 mbedtls_cipher_update(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out)
// Called from:
//      mbedtls_cipher_crypt
//      mbedtls_gcm_setkey
//      mbedtls_gcm_starts
//      mbedtls_gcm_update
Eq_2 mbedtls_cipher_update(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x060000FF;
		a1Out = a1;
		a3Out = a3;
		a5Out = a5;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		return ra;
	}
	Eq_2 s5_114;
	ptr32 a0_107;
	Eq_2 a0_24 = *a5;
	s5_114 = s5;
	if (a5 != 0x00)
	{
		s5_114 = a4;
		if (a4 != 0x00)
		{
			a4->u0 = 0x00;
			word32 a5_708;
			Eq_2 a0_35 = mbedtls_cipher_get_block_size(a0_24, a5, out a5_708);
			s6 = a3;
			Eq_2 s4_203 = a1;
			s1 = a2;
			Eq_2 s0_173 = *a4;
			a3.u0 = 0x01;
			s2 = a0_35;
			a5 = (word32) *((word32) a4 + 1);
			if (a5 == 0x01)
			{
				if (a0_35 == a2)
				{
					*a4 = a0_35;
					int32 a1_381 = (int32) *((word32) *a5 + 8);
					struct Eq_327353 * a5_383 = *((word32) a5 + 24);
					0x00 = (uint16) dwArg0128;
					ptr32 a0_397;
					Eq_2 s0_398;
					Eq_2 ra_399;
					Eq_2 s1_400;
					Eq_2 s2_401;
					Eq_2 s3_402;
					Eq_2 s4_403;
					Eq_2 s5_404;
					Eq_2 s6_405;
					Eq_2 s7_406;
					Eq_2 a5_407;
					Eq_2 a3_409;
					Eq_2 a1_410;
					word32 t1_414;
					Eq_2 s8_416;
					ptr32 a7_417;
					word32 t0_418;
					word32 t4_419;
					word32 t5_420;
					word32 t6_421;
					a5_383->ptr0004();
					s0Out = s0_398;
					s1Out = s1_400;
					a0Out = a0_397;
					a1Out = a1_410;
					a3Out = a3_409;
					a5Out = a5_407;
					a7Out = a7_417;
					s2Out = s2_401;
					s3Out = s3_402;
					s4Out = s4_403;
					s5Out = s5_404;
					s6Out = s6_405;
					s7Out = s7_406;
					s8Out = s8_416;
					return ra_399;
				}
				a0_107 = ~0x0600027F;
				goto l230628DE;
			}
			a3.u0 = 0x06;
			if (a5 == 0x06)
			{
				*a4 = a2;
				0x00 = (uint16) dwArg0128;
				ptr32 a0_333;
				Eq_2 s0_334;
				Eq_2 s1_336;
				Eq_2 s2_337;
				Eq_2 s3_338;
				Eq_2 s4_339;
				Eq_2 s5_340;
				Eq_2 s6_341;
				Eq_2 s7_342;
				Eq_2 a5_343;
				Eq_2 a3_345;
				Eq_2 a1_346;
				Eq_2 s8_352;
				ptr32 a7_353;
				Eq_2 ra_335 = mbedtls_gcm_update(a0_35, a2, dwArg78, a3, out s0_334, out s1_336, out a0_333, out a1_346, out a3_345, out a5_343, out a7_353, out s2_337, out s3_338, out s4_339, out s5_340, out s6_341, out s7_342, out s8_352);
				s0Out = s0_334;
				s1Out = s1_336;
				a0Out = a0_333;
				a1Out = a1_346;
				a3Out = a3_345;
				a5Out = a5_343;
				a7Out = a7_353;
				s2Out = s2_337;
				s3Out = s3_338;
				s4Out = s4_339;
				s5Out = s5_340;
				s6Out = s6_341;
				s7Out = s7_342;
				s8Out = s8_352;
				return ra_335;
			}
			if (a0_35 == 0x00)
			{
				a0_107 = ~0x0600037F;
				goto l230628DE;
			}
			if (a1 != a3)
			{
l2306299A:
				a3.u0 = 0x02;
				if (a5 != 0x02)
				{
					if (a5 == 0x03)
					{
						word32 s0_99 = *((word32) a0_35 + 60);
						word32 tp_122;
						word32 t3_123;
						word32 t1_124;
						word32 s8_126;
						word32 t6_440;
						word32 t5_439;
						word32 t4_438;
						word32 t0_437;
						(*((word32) a5 + 0x0C))();
					}
					else
					{
						a3.u0 = 0x05;
						if (a5 != 0x05)
						{
							a0_107 = ~0x0600007F;
							goto l230628DE;
						}
						word32 s0_57 = *((word32) a0_35 + 60);
						word32 tp_90;
						word32 t3_91;
						word32 t1_92;
						word32 s8_94;
						word32 t6_436;
						word32 t5_435;
						word32 t0_433;
						word32 t4_434;
						(*((word32) a5 + 16))();
					}
					if (a0_107 != 0x00)
					{
l230628DE:
						0x00 = (uint16) dwArg0128;
						s0Out = dwArgE4;
						s1Out = s1;
						a0Out = a0_107;
						a1Out = a1;
						a3Out = a3;
						a5Out = a5;
						a7Out = a7;
						s2Out = s2;
						s3Out = s3;
						s4Out = dwArg78;
						s5Out = s5_114;
						s6Out = s6;
						s7Out = s7;
						s8Out = s5;
						return ra;
					}
					goto l23062A78;
				}
				else
				{
					a5 = (int32) *((word32) s0_173 + 8);
					s3 = *((word32) s0_173 + 36);
					if (a5 == 0x00)
					{
						a5 = a0_35 - s3;
						if (a5 >= a2)
							goto l230629B2;
					}
					else if (a5 == 0x01)
					{
						a5 = a0_35 - s3;
						if (a2 < a5)
						{
l230629B2:
							word32 a6_711;
							word32 a2_709;
							word32 a4_710;
							memcpy((word32) s0_173 + ((word32) s3 + 20), a1, a2, out a1, out a2_709, out a3, out a4_710, out a5, out a6_711, out a7);
							s1 = a2 + a5;
							*((word32) s1 + 36) = *((word32) a5 + 36);
							goto l230629C6;
						}
					}
					if (s3 != 0x00)
					{
						Eq_2 s7_136 = a0_35 - s3;
						Eq_2 a0_142 = (word32) s0_173 + ((word32) s3 + 20);
						struct Eq_327537 * a5_144;
						word32 a1_712;
						word32 a4_715;
						word32 a6_716;
						word32 a7_717;
						word32 a2_713;
						word32 a3_714;
						memcpy(a0_142, a1, s7_136, out a1_712, out a2_713, out a3_714, out a4_715, out a5_144, out a6_716, out a7_717);
						word32 s0_159 = *((word32) a0_142 + 60);
						word32 s4_178;
						word32 tp_187;
						word32 t3_188;
						word32 t1_189;
						word32 a6_190;
						word32 s8_191;
						word32 t0_193;
						word32 t4_194;
						word32 t5_195;
						word32 t6_196;
						a5_144->ptr0018->ptr0008();
						if (a0_107 != 0x00)
							goto l230628DE;
						a5 = Mem28[s5_114 + 0x00:int32] + s2;
						*s5_114 = a5;
						((word32) s0_173 + 36)->u0 = 0x00;
						s6 += s2;
						s4_203 = (word32) s7 + s4_178;
						s1 = s1 + s3 - s2;
					}
					if (s1 != 0x00)
					{
						Eq_2 s3_207 = s1 & s2;
						if (s3_207 == 0x00 && (int32) (*((word32) s0_173 + 8)) == 0x00)
							s3_207 = s2;
						s1 -= s3_207;
						Eq_2 a0_220 = (word32) s0_173 + 20;
						word32 a4_719;
						word32 a6_720;
						word32 a2_718;
						memcpy(a0_220, s4_203 + s1, s3_207, out a1, out a2_718, out a3, out a4_719, out a5, out a6_720, out a7);
						s3 = s3_207 + a5;
						*((word32) *((word32) a5 + 36) + 36) = s3;
						if (s1 != 0x00)
						{
							word32 s0_240 = *((word32) a0_220 + 60);
							word32 tp_275;
							word32 t3_276;
							word32 t1_277;
							word32 a6_278;
							word32 s8_279;
							word32 t0_281;
							word32 t4_282;
							word32 t5_283;
							word32 t6_284;
							(*((word32) *((word32) a5 + 24) + 8))();
							if (a0_107 != 0x00)
								goto l230628DE;
							a5 = *s5_114;
							s1 += a5;
l23062A78:
							*s5_114 = s1;
							goto l230628DE;
						}
					}
l230629C6:
					a0_107 = 0x00;
					goto l230628DE;
				}
			}
			s0_173 = *(union Eq_2 *) 0x2A;
			if (false)
			{
				a3 = a2 & a0_35;
				if (a3 == 0x00)
					goto l2306299A;
			}
		}
	}
	a0_107 = ~0x060000FF;
	goto l230628DE;
}

// 23062AE2: Register Eq_2 mbedtls_cipher_finish(Register Eq_2 ra, Register word32 s0, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register (ptr32 Eq_301396) a3, Register Eq_2 a5, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out (ptr32 Eq_301396) a3Out, Register out Eq_327663 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_2) s3Out, Register out ptr32 s4Out)
// Called from:
//      mbedtls_cipher_crypt
Eq_2 mbedtls_cipher_finish(Eq_2 ra, word32 s0, Eq_2 a0, Eq_2 a1, union Eq_2 * a2, struct Eq_301396 * a3, Eq_2 a5, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, struct Eq_301396 & a3Out, union Eq_327663 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	ptr32 s0_115;
	if (a0 != 0x00)
	{
		s1 = *a5;
		if (a5 != 0x00 && a2 != null)
		{
			*a2 = (union Eq_2 *) 0x00;
			Eq_2 a0_25 = a3->t0000;
			a5.u0 = 0x03;
			a4 = (word32) a3->b0001;
			if (a4 != 0x03)
			{
				a5 = (word32) a4 - 5 & 0x00FF;
				if (a5 > 0x02)
				{
					a5.u0 = 0x01;
					if (a4 == 0x01)
					{
						s0_115 = 0x00;
						if (false)
							goto l23062B4A;
						goto l23062B24;
					}
					if (a4 != 0x02)
					{
						s0_115 = ~0x0600007F;
						goto l23062B4A;
					}
					a4.u0 = (int32) *((word32) a0_25 + 8);
					s3 = a2;
					Eq_2 s4_37 = a1;
					s2 = *((word32) a0_25 + 36);
					if (a4 == 0x01)
					{
						Eq_2 a0_43 = *(union Eq_2 *) 0x0D;
						if (false)
						{
							s0_115 = 0x00;
							if (s2 == 0x00)
								goto l23062B4A;
							goto l23062B24;
						}
						Eq_2 s1_44 = *((word32) a1 + 56);
						if (a1 == 0x00)
							a3 = (struct Eq_301396 *) *((word32) a1 + 0x0C);
						word32 a4_70;
						word32 t1_75;
						(*(<anonymous> *) 0x01)();
l23062B68:
						struct Eq_327749 * a5_80;
						Eq_2 a0_79 = mbedtls_cipher_get_block_size(s1, a5, out a5_80);
						word32 s1_87 = *((word32) a0_79 + 60);
						struct Eq_327758 * sp_98;
						ptr32 a0_105;
						word32 t1_114;
						a5_80->ptr0018->ptr0008();
						s0_115 = a0_105;
						if (a0_105 == 0x00)
						{
							word32 a5_281;
							Eq_2 a0_117 = mbedtls_cipher_get_block_size(s1, a5, out a5_281);
							a5 = (int32) *((word32) s1 + 8);
							a1 = a0_117;
							if (a5 == 0x00)
							{
								word32 s4_125 = sp_98->dw0024;
								Eq_2 ra_132;
								Eq_2 s1_134;
								Eq_2 s2_135;
								union Eq_2 * s3_136;
								ptr32 s4_137;
								ptr32 a0_138;
								Eq_2 a5_139;
								struct Eq_301396 * a3_141;
								Eq_327663 a4_142;
								Eq_2 a1_144;
								word32 t1_147;
								(*((word32) s1 + 16))();
								s1Out = s1_134;
								a0Out = a0_138;
								a1Out = a1_144;
								a3Out = a3_141;
								a4Out = a4_142;
								a5Out = a5_139;
								s2Out = s2_135;
								s3Out = s3_136;
								s4Out = s4_137;
								return ra_132;
							}
							*s3 = (union Eq_2 *) a0_117;
						}
l23062B4A:
						s1Out = s1;
						a0Out = s0_115;
						a1Out = a1;
						a3Out = a3;
						a4Out = a4;
						a5Out = a5;
						s2Out = s2;
						s3Out = s3;
						s4Out = dwArg04;
						return ra;
					}
					if (mbedtls_cipher_get_block_size(a0_25, 0x01, out a5) == s2)
						goto l23062B68;
					s1 = *((word16) a5.u0 + 0x0C);
					if (a5 != 0x00 || s2 != 0x00)
					{
l23062B24:
						s0_115 = ~0x0600027F;
						goto l23062B4A;
					}
				}
			}
			s0_115 = 0x00;
			goto l23062B4A;
		}
	}
	s0_115 = ~0x060000FF;
	goto l23062B4A;
}

// 23062BDE: Register Eq_2 mbedtls_cipher_set_padding_mode(Register Eq_2 a0, Register word32 a1, Register (ptr32 Eq_296094) a5, Register out ptr32 a4Out, Register out (ptr32 Eq_296094) a5Out)
// Called from:
//      mbedtls_ssl_derive_keys
//      mbedtls_cipher_setup
Eq_2 mbedtls_cipher_set_padding_mode(Eq_2 a0, word32 a1, struct Eq_296094 * a5, ptr32 & a4Out, struct Eq_296094 & a5Out)
{
	if (a0 != 0x00)
	{
		struct Eq_327812 * a0_6 = a5->ptr0000;
		a4 = (word32) a5->b0001;
		a5 = (struct Eq_296094 *) 0x02;
		if (a4 == 0x02)
		{
			struct Eq_296094 * a5_17;
			if (a1 != 0x03)
			{
				if (a1 != 0x04)
				{
					if (a1 != 0x00)
					{
						a4Out = a4;
						a5Out = (struct Eq_296094 *) 0x04;
						return ~0x0600007F;
					}
					g_ptr230626CC = a0_6;
					a5_17 = &g_t230626DC;
				}
				else
				{
					a0_6->dw000C = 0x00;
					a5_17 = &g_t2306274A;
				}
			}
			else
			{
				g_ptr23062744 = a0_6;
				a5_17 = &g_t2306275C;
			}
			a5_17->ptr0010 = a0_6;
			a4Out = a4;
			a5Out = a5_17;
			return 0x00;
		}
	}
	a4Out = a4;
	a5Out = a5;
	return ~0x060000FF;
}

// 23062C44: Register Eq_2 mbedtls_cipher_setup(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_295827) a1, Register out (ptr32 Eq_2) s1Out, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out (ptr32 Eq_296094) a5Out)
// Called from:
//      mbedtls_ssl_derive_keys
//      mbedtls_gcm_setkey
Eq_2 mbedtls_cipher_setup(Eq_2 ra, Eq_2 a0, struct Eq_295827 * a1, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a4Out, struct Eq_296094 & a5Out)
{
	if (a1 == null)
	{
		s1Out = s1;
		a0Out = ~0x060000FF;
		a4Out = a4;
		a5Out = a5;
		return ra;
	}
	else
	{
		ptr32 a0_16;
		if (a0 != 0x00)
		{
			word32 a0_20;
			word32 a1_21;
			struct Eq_327859 * a5_25;
			Eq_2 s0_33;
			struct Eq_327861 * a0_36;
			word32 a2_37;
			word32 tp_39;
			word32 a3_40;
			word32 t0_42;
			word32 t1_43;
			a5_25->ptr001C();
			a0_36->t003C = s0_33;
			if (a0_36 != null)
			{
				*s1 = (union Eq_2 *) s0_33;
				mbedtls_cipher_set_padding_mode(s0_33, 0x00, a5, out a4, out a5);
				a0_16 = 0x00;
			}
			else
				a0_16 = ~0x0600017F;
		}
		else
			a0_16 = ~0x060000FF;
		s1Out = s1;
		a0Out = a0_16;
		a4Out = a4;
		a5Out = a5;
		return ra;
	}
}

// 23062C96: Register Eq_2 mbedtls_cipher_crypt(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 s5, Register Eq_2 s7, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_301391) s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 word32) a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_301396) a3Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out)
// Called from:
//      mbedtls_ssl_write_record
//      mbedtls_ssl_read_record_layer
Eq_2 mbedtls_cipher_crypt(Eq_2 ra, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 s5, Eq_2 s7, Eq_2 dwArg08, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArgB4, Eq_2 dwArgD0, Eq_2 dwArgD4, Eq_2 dwArgF8, Eq_2 dwArg0128, struct Eq_301391 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, word32 & a1Out, ptr32 & a2Out, struct Eq_301396 & a3Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out)
{
	Eq_2 s3_147 = a3;
	Eq_2 s4_148 = a4;
	Eq_2 s2_146 = a5;
	Eq_2 a5_100;
	struct Eq_301396 * a3_139;
	word32 * a1_138;
	ptr32 a0_137;
	Eq_2 s1_145 = mbedtls_cipher_set_iv(a0, a1, a2, a5, out a0_137, out a1_138, out a3_139, out a5_100);
	if (a0_137 == 0x00)
	{
		a0_137 = mbedtls_cipher_reset(s1_145, a5_100);
		if (a0_137 == 0x00)
		{
			word32 s0_169;
			word32 a7_170;
			word32 s6_171;
			word32 s7_172;
			word32 s8_173;
			ra = mbedtls_cipher_update(ra, s1_145, a3, a4, a5, a6, a5_100, a3, s5, s7, dwArg08, dwArg48, dwArg68, dwArg88, dwArgB4, dwArgD0, dwArgD4, dwArgF8, out s0_169, out s1_145, out a0_137, out a1_138, out a3_139, out a5_100, out a7_170, out s2_146, out s3_147, out s4_148, out s5, out s6_171, out s7_172, out s8_173);
			if (a0_137 == 0x00)
			{
				word32 a4_90;
				ra = mbedtls_cipher_finish(ra, *a1_138, s1_145, a1_138 + s2_146, fp + -36, a3_139, a5_100, out s1_145, out a0_137, out a1_138, out a3_139, out a4_90, out a5_100, out s2_146, out s3_147, out s4_148);
				if (a0_137 == 0x00)
				{
					a5_100 = (word32) a5_100 + a4_90;
					*a5_100 = *a5_100;
				}
			}
		}
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_145;
	a0Out = a0_137;
	a1Out = a1_138;
	a2Out = dwArg0100;
	a3Out = a3_139;
	a5Out = a5_100;
	s2Out = s2_146;
	s3Out = s3_147;
	s4Out = s4_148;
	s5Out = s5;
	return ra;
}

// 23062CF2: Register Eq_2 mbedtls_cipher_auth_encrypt(Register Eq_2 ra, Register (ptr32 Eq_301038) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a6, Register Eq_2 s5, Register (ptr32 Eq_2) t4, Stack Eq_2 dwArg38, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack word32 dwArgAC, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_301051) s0Out, Register out ptr32 a0Out, Register out (ptr32 Eq_301053) a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_301055) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out)
// Called from:
//      mbedtls_ssl_write_record
Eq_2 mbedtls_cipher_auth_encrypt(Eq_2 ra, struct Eq_301038 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a6, Eq_2 s5, union Eq_2 * t4, Eq_2 dwArg38, Eq_2 dwArg84, Eq_2 dwArgA8, word32 dwArgAC, Eq_2 dwArg0128, Eq_2 dwArg0198, struct Eq_301051 & s0Out, ptr32 & a0Out, struct Eq_301053 & a5Out, ptr32 & s2Out, struct Eq_285624 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out)
{
	struct Eq_327963 * t5_5 = a0->ptr0000;
	0x00 = dwArgAC;
	if ((word32) t5_5->b0001 != 0x06)
	{
		s0Out = dwArg08;
		a0Out = ~0x0600007F;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		return ra;
	}
	else
	{
		*t4 = (union Eq_2 *) a6;
		Eq_2 a0_23 = a0->t003C;
		ptr32 a0_36;
		struct Eq_301053 * a5_41;
		struct Eq_301051 * s0_45;
		ptr32 s2_47;
		struct Eq_285624 * s3_48;
		ptr32 s4_49;
		Eq_2 s5_50;
		ptr32 s6_51;
		word32 s1_117;
		Eq_2 ra_44 = mbedtls_gcm_crypt_and_tag(ra, a0_23, 0x01, a1, a2, a4, s5, dwArg38, a6, dwArg84, dwArgA8, dwArg0128, dwArg0198, out s0_45, out s1_117, out a0_36, out a5_41, out s2_47, out s3_48, out s4_49, out s5_50, out s6_51);
		s0Out = s0_45;
		a0Out = a0_36;
		a5Out = a5_41;
		s2Out = s2_47;
		s3Out = s3_48;
		s4Out = s4_49;
		s5Out = s5_50;
		s6Out = s6_51;
		return ra_44;
	}
}

// 23062D2E: Register word32 mbedtls_cipher_auth_decrypt(Register (ptr32 Eq_306992) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s5, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0154, Register out (ptr32 Eq_307004) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_307007) a5Out, Register out Eq_307008 s2Out, Register out ptr32 s3Out)
// Called from:
//      mbedtls_ssl_read_record_layer
word32 mbedtls_cipher_auth_decrypt(struct Eq_306992 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a6, Eq_2 a7, Eq_2 s5, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArgC8, Eq_2 dwArg0138, Eq_2 dwArg0154, struct Eq_307004 & s0Out, ptr32 & s1Out, ptr32 & a0Out, struct Eq_307007 & a5Out, union Eq_307008 & s2Out, ptr32 & s3Out)
{
	if ((word32) a0->ptr0000->b0001 != 0x06)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x0600007F;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		return ra;
	}
	else
	{
		0x00 = (uint16) dwArg0154;
		*a1 = a6;
		struct Eq_307004 * s0_43;
		ptr32 s1_44;
		Eq_307008 s2_45;
		ptr32 s3_46;
		ptr32 a0_34;
		word32 ra_42 = mbedtls_gcm_auth_decrypt(a0->t003C, a1, a2, a4, a7, s5, dwArg24, dwArg48, dwArgC8, dwArg0138, out s0_43, out s1_44, out a0_34, out s2_45, out s3_46);
		if (a0_34 == ~0x11)
			a0_34 = ~0x060002FF;
		s0Out = s0_43;
		s1Out = s1_44;
		a0Out = a0_34;
		a5Out = (struct Eq_307007 *) ~0x11;
		s2Out = s2_45;
		s3Out = s3_46;
		return ra_42;
	}
}

// 23062D7C: void gcm_ctx_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void gcm_ctx_free(Eq_2 ra, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_13 = mbedtls_gcm_free(ra, a0, a5);
	word32 s0_36;
	word32 s1_37;
	word32 a0_38;
	word32 a1_39;
	word32 a2_40;
	word32 a3_41;
	word32 a4_42;
	word32 a5_43;
	word32 a6_44;
	word32 s4_45;
	word32 t3_46;
	vPortFree(a0, dwArg10, a5_13, mstatus, dwArg0158, dwArg0198, out s0_36, out s1_37, out a0_38, out a1_39, out a2_40, out a3_41, out a4_42, out a5_43, out a6_44, out s4_45, out t3_46);
}

// 23062D94: void gcm_ctx_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void gcm_ctx_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 s2_79;
	word32 a5_78;
	word32 a4_77;
	word32 a3_76;
	word32 a2_75;
	word32 a1_74;
	word32 s1_73;
	word32 s0_72;
	word32 s3_80;
	word32 s4_81;
	word32 s8_82;
	Eq_2 ra_21 = mycalloc(ra, s1, 0x01, 0x0188, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_72, out s1_73, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out s2_79, out s3_80, out s4_81, out s8_82);
	if (true)
		mbedtls_gcm_init(ra_21, 0x01);
}

// 23062DB6: void gcm_aes_setkey_wrap(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_295827) a2, Register (ptr32 Eq_295827) a5, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE8)
void gcm_aes_setkey_wrap(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_295827 * a2, struct Eq_295827 * a5, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgE8)
{
	mbedtls_gcm_setkey(ra, s1, a0, (struct Eq_295827 *) 0x02, a2, a5, s3, s5, s7, dwArg38, dwArg78, dwArgA4, dwArgC0, dwArgC4, dwArgE8);
}

// 23062DC0: void aes_ctx_free(Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void aes_ctx_free(Eq_2 a0, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_11 = mbedtls_aes_free(a0);
	word32 s0_34;
	word32 s1_35;
	word32 a0_36;
	word32 a1_37;
	word32 a2_38;
	word32 a3_39;
	word32 a4_40;
	word32 a5_41;
	word32 a6_42;
	word32 s4_43;
	word32 t3_44;
	vPortFree(a0, dwArg10, a5_11, mstatus, dwArg0158, dwArg0198, out s0_34, out s1_35, out a0_36, out a1_37, out a2_38, out a3_39, out a4_40, out a5_41, out a6_42, out s4_43, out t3_44);
}

