pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23062DD8: void aes_ctx_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void aes_ctx_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 s2_79;
	word32 a5_78;
	word32 a4_77;
	word32 a3_76;
	word32 a2_75;
	word32 a1_74;
	word32 s1_73;
	word32 s0_72;
	word32 s3_80;
	word32 s4_81;
	word32 s8_82;
	Eq_2 ra_21 = mycalloc(ra, s1, 0x01, 0x0118, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_72, out s1_73, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out s2_79, out s3_80, out s4_81, out s8_82);
	if (true)
	{
		word32 a1_83;
		word32 a4_84;
		word32 a5_85;
		mbedtls_aes_init(ra_21, 0x01, out a1_83, out a4_84, out a5_85);
	}
}

// 23062DFA: void aes_setkey_dec_wrap(Register Eq_2 ra, Register (ptr32 Eq_317261) a1)
void aes_setkey_dec_wrap(Eq_2 ra, struct Eq_317261 * a1)
{
	mbedtls_aes_setkey_dec(ra, a1);
}

// 23062DFE: void aes_setkey_enc_wrap(Register (ptr32 Eq_282274) a0, Register (ptr32 Eq_282275) a1, Register Eq_282276 a2, Register (ptr32 Eq_282277) a4, Register Eq_282256 a5, Stack (ptr32 Eq_282274) dwArg44, Stack Eq_2 dwArg0128)
void aes_setkey_enc_wrap(struct Eq_282274 * a0, struct Eq_282275 * a1, Eq_282276 a2, struct Eq_282277 * a4, Eq_282256 a5, struct Eq_282274 * dwArg44, Eq_2 dwArg0128)
{
	word32 a0_23;
	word32 a1_24;
	word32 a3_25;
	word32 a4_26;
	mbedtls_aes_setkey_enc(a0, a1, a2, a4, a5, dwArg44, dwArg0128, out a0_23, out a1_24, out a3_25, out a4_26);
}

// 23062E02: void aes_crypt_ctr_wrap(Register (ptr32 word32) s0, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_319130) a5, Register (ptr32 Eq_319131) a6, Stack word32 dwArg0C, Stack word32 dwArg74, Stack (ptr32 word32) dwArgB4, Stack Eq_59116 dwArg0118, Stack word32 dwArg0128)
void aes_crypt_ctr_wrap(word32 * s0, word32 a1, Eq_2 a3, Eq_2 a4, struct Eq_319130 * a5, struct Eq_319131 * a6, word32 dwArg0C, word32 dwArg74, word32 * dwArgB4, Eq_59116 dwArg0118, word32 dwArg0128)
{
	mbedtls_aes_crypt_ctr(s0, a1, a3, a4, a5, a6, dwArg0C, dwArg74, dwArgB4, dwArg0118, dwArg0128);
}

// 23062E06: void aes_crypt_cfb128_wrap(Register Eq_317738 s0, Register word32 a1, Register word32 a2, Register (ptr32 Eq_317738) a3, Register Eq_2 a4, Register (ptr32 Eq_318995) a5, Register (ptr32 Eq_318996) a6, Stack word32 dwArg1C, Stack word32 dwArgA8, Stack Eq_59116 dwArg0128)
void aes_crypt_cfb128_wrap(Eq_317738 s0, word32 a1, word32 a2, union Eq_317738 * a3, Eq_2 a4, struct Eq_318995 * a5, struct Eq_318996 * a6, word32 dwArg1C, word32 dwArgA8, Eq_59116 dwArg0128)
{
	mbedtls_aes_crypt_cfb128(s0, a1, a2, a3, a4, a5, a6, dwArg1C, dwArgA8, dwArg0128);
}

// 23062E0A: void aes_crypt_cbc_wrap(Register Eq_2 a1, Register ui32 a2, Register Eq_2 a3, Register ptr32 a4, Register ptr32 a5, Stack Eq_59116 dwArgF8, Stack Eq_59116 dwArg0108, Stack word32 dwArg0198)
void aes_crypt_cbc_wrap(Eq_2 a1, ui32 a2, Eq_2 a3, ptr32 a4, ptr32 a5, Eq_59116 dwArgF8, Eq_59116 dwArg0108, word32 dwArg0198)
{
	word32 s1_39;
	word32 a1_40;
	word32 a4_41;
	word32 s7_42;
	word32 s9_43;
	word32 s10_44;
	word32 s11_45;
	mbedtls_aes_crypt_cbc(a1, a2, a3, a4, a5, dwArgF8, dwArg0108, dwArg0198, out s1_39, out a1_40, out a4_41, out s7_42, out s9_43, out s10_44, out s11_45);
}

// 23062E0E: void aes_crypt_ecb_wrap(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Stack word32 dwArg2C, Stack Eq_59116 dwArg0138)
void aes_crypt_ecb_wrap(Eq_2 a1, Eq_2 a2, Eq_2 a3, word32 dwArg2C, Eq_59116 dwArg0138)
{
	word32 s1_37;
	word32 s2_38;
	word32 s3_39;
	word32 s4_40;
	word32 s5_41;
	word32 s6_42;
	word32 s7_43;
	word32 s8_44;
	word32 s9_45;
	word32 s10_46;
	word32 s11_47;
	mbedtls_aes_crypt_ecb(a1, a2, a3, dwArg2C, dwArg0138, out s1_37, out s2_38, out s3_39, out s4_40, out s5_41, out s6_42, out s7_43, out s8_44, out s9_45, out s10_46, out s11_47);
}

// 23062E12: Register Eq_2 debug_send_line.isra.0(Register Eq_2 a0)
// Called from:
//      mbedtls_debug_print_msg
//      mbedtls_debug_print_ret
//      mbedtls_debug_print_buf
//      mbedtls_debug_print_mpi
//      mbedtls_debug_print_crt
Eq_2 debug_send_line.isra.0(Eq_2 a0)
{
	Eq_2 a0_9;
	(*((word32) a0 + 16))();
	return a0_9;
}

// 23062E1A: Register Eq_2 mbedtls_debug_print_mpi.part.1(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register out ptr32 a1Out, Register out ptr32 a2Out)
// Called from:
//      mbedtls_debug_print_mpi
Eq_2 mbedtls_debug_print_mpi.part.1(Eq_2 ra, Eq_2 s1, Eq_2 a1, ptr32 & a1Out, ptr32 & a2Out)
{
	word32 a5_32[] = *((word32) *((word32) s1 + 4) + 8);
	Eq_328404 s1_43 = (word32) s1 - 1;
	while (true)
	{
		int32 a4_45 = s1_43 << 0x02;
		if (s1_43 == 0x00 || a5_32[a4_45 / 4] != 0x00)
			break;
		s1_43 = (word32) s1_43 - 1;
	}
	word32 a5_56 = 0x1F;
	while ((a1 >> a5_56 & 0x01) == 0x00)
	{
		a5_56 += ~0x00;
		if (a5_56 == ~0x00)
			break;
	}
	union Eq_2 * s4_98;
	word32 s10_634;
	word32 s6_630;
	word32 a5_626;
	word32 a1_622;
	word32 s11_635;
	word32 s8_632;
	word32 s7_631;
	word32 s3_628;
	word32 a7_627;
	word32 a3_624;
	word32 a2_623;
	word32 s0_620;
	word32 s9_633;
	word32 s5_629;
	word32 a4_625;
	word32 a0_621;
	ui32 s1_119;
	struct Eq_328441 * s2_122;
	Eq_2 ra_153 = snprintf(ra, fp + -576, 0x0200, &g_t2308B060, dwLoc0228, dwLoc0208, dwLoc01DC, dwLoc01C0, dwLoc01BC, dwLoc0198, dwLoc0174, out s0_620, out s1_119, out a0_621, out a1_622, out a2_623, out a3_624, out a4_625, out a5_626, out a7_627, out s2_122, out s3_628, out s4_98, out s5_629, out s6_630, out s7_631, out s8_632, out s9_633, out s10_634, out s11_635);
	debug_send_line.isra.0(*s4_98);
	int32 s0_114 = 0x00;
	word32 a4_115 = 0x01;
	ui32 s9_116 = 0x00;
	int32 s8_117 = 0x0200;
	for (; s1_119 != ~0x00; s1_119 += ~0x00)
	{
		int32 s10_120 = s1_119 << 0x02;
		if (a4_115 == 0x00 || *((word32) s2_122->t0008 + s10_120) != 0x00)
		{
			word32 s3_127 = 0x18;
			word32 s11_128 = ~0x07;
			do
			{
				if (a4_115 == 0x00 || (*((word32) s2_122->t0008 + s10_120) >> s3_127 & 0x00FF) != 0x00)
				{
					if ((s9_116 & 0x0F) == 0x00 && s9_116 != 0x00)
					{
						union Eq_2 * s4_169;
						word32 s7_682;
						word32 s9_683;
						word32 s10_684;
						word32 s11_685;
						word32 s1_670;
						word32 a0_671;
						word32 s2_678;
						word32 s3_679;
						word32 s5_680;
						word32 s6_681;
						word32 a1_672;
						word32 a2_673;
						word32 a3_674;
						word32 a7_677;
						word32 a4_675;
						word32 a5_676;
						word32 s0_669;
						ra_153 = snprintf(ra_153, fp + -576 + s0_114, s8_117 - s0_114, &g_t2308BA14, dwLoc0228, dwLoc0208, dwLoc01DC, dwLoc01C0, dwLoc01BC, dwLoc0198, dwLoc0174, out s0_669, out s1_670, out a0_671, out a1_672, out a2_673, out a3_674, out a4_675, out a5_676, out a7_677, out s2_678, out s3_679, out s4_169, out s5_680, out s6_681, out s7_682, out s8_117, out s9_683, out s10_684, out s11_685);
						debug_send_line.isra.0(*s4_169);
						s0_114 = 0x00;
					}
					word32 a0_206;
					word32 s0_214;
					word32 s9_225;
					word32 s6_694;
					word32 s7_695;
					word32 a5_690;
					word32 a7_691;
					word32 s4_692;
					word32 s5_693;
					word32 a1_686;
					word32 a4_689;
					word32 a2_687;
					word32 a3_688;
					ra_153 = snprintf(ra_153, fp + -576 + s0_114, s8_117 - s0_114, &g_t2308163C, dwLoc0228, dwLoc0208, dwLoc01DC, dwLoc01C0, dwLoc01BC, dwLoc0198, dwLoc0174, out s0_214, out s1_119, out a0_206, out a1_686, out a2_687, out a3_688, out a4_689, out a5_690, out a7_691, out s2_122, out s3_127, out s4_692, out s5_693, out s6_694, out s7_695, out s8_117, out s9_225, out s10_120, out s11_128);
					s0_114 = s0_214 + a0_206;
					s9_116 = s9_225 + 0x01;
					a4_115 = 0x00;
				}
				s3_127 += ~0x07;
			} while (s3_127 != s11_128);
		}
	}
	if (a4_115 != 0x00)
	{
		word32 a2_638;
		word32 a7_642;
		word32 a0_255;
		word32 s0_263;
		word32 s3_644;
		word32 s2_643;
		word32 a4_640;
		word32 a3_639;
		word32 s1_636;
		word32 s5_646;
		word32 s6_647;
		word32 s7_648;
		word32 s8_649;
		word32 s9_650;
		word32 s10_651;
		word32 s11_652;
		word32 s4_645;
		word32 a5_641;
		word32 a1_637;
		ra_153 = snprintf(ra_153, fp + -576 + s0_114, 0x0200 - s0_114, &g_t2308B080, dwLoc0228, dwLoc0208, dwLoc01DC, dwLoc01C0, dwLoc01BC, dwLoc0198, dwLoc0174, out s0_263, out s1_636, out a0_255, out a1_637, out a2_638, out a3_639, out a4_640, out a5_641, out a7_642, out s2_643, out s3_644, out s4_645, out s5_646, out s6_647, out s7_648, out s8_649, out s9_650, out s10_651, out s11_652);
		s0_114 = s0_263 + a0_255;
	}
	union Eq_2 * s4_302;
	ptr32 s5_303;
	ptr32 s6_304;
	word32 a3_658;
	word32 a4_659;
	word32 s9_666;
	word32 s10_667;
	word32 s11_668;
	word32 a5_660;
	word32 a7_661;
	word32 s2_662;
	word32 s8_665;
	word32 s3_663;
	word32 s7_664;
	word32 s1_654;
	word32 a0_655;
	word32 a1_656;
	word32 a2_657;
	word32 s0_653;
	snprintf(ra_153, fp + -576 + s0_114, 0x0200 - s0_114, &g_t2308BA14, dwLoc0228, dwLoc0208, dwLoc01DC, dwLoc01C0, dwLoc01BC, dwLoc0198, dwLoc0174, out s0_653, out s1_654, out a0_655, out a1_656, out a2_657, out a3_658, out a4_659, out a5_660, out a7_661, out s2_662, out s3_663, out s4_302, out s5_303, out s6_304, out s7_664, out s8_665, out s9_666, out s10_667, out s11_668);
	Eq_2 a0_316 = debug_send_line.isra.0(*s4_302);
	a1Out = s5_303;
	a2Out = s6_304;
	return a0_316;
}

// 23062FCC: Register Eq_2 mbedtls_debug_print_msg(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_274) a4, Register Eq_2 a5, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_294116) a3Out, Register out (ptr32 Eq_274) a4Out, Register out Eq_2 a5Out, Register out ptr32 a7Out, Register out Eq_294120 s4Out, Register out (ptr32 int32) s5Out, Register out Eq_294122 s6Out, Register out ptr32 s7Out, Register out Eq_294124 s8Out, Register out ptr32 s9Out, Register out (ptr32 Eq_294126) s10Out, Register out (ptr32 Eq_294127) s11Out, Register out ptr32 t4Out)
// Called from:
//      ssl_swap_epochs
//      ssl_calc_finished_tls_sha256
//      ssl_calc_verify_tls_sha256
//      ssl_set_timer
//      ssl_check_timer
//      mbedtls_ssl_derive_keys
//      mbedtls_ssl_flush_output
//      mbedtls_ssl_send_flight_completed
//      mbedtls_ssl_optimize_checksum
//      mbedtls_ssl_get_record_expansion
//      mbedtls_ssl_handshake
//      ssl_handshake_wrapup_free_hs_transform
//      mbedtls_ssl_handshake_wrapup
//      mbedtls_ssl_setup
//      mbedtls_ssl_free
//      mbedtls_ssl_write_record
//      mbedtls_ssl_resend
//      mbedtls_ssl_fetch_input
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_handle_message_type
//      mbedtls_ssl_send_alert_message
//      mbedtls_ssl_close_notify
//      mbedtls_ssl_write_certificate
//      mbedtls_ssl_write_change_cipher_spec
//      mbedtls_ssl_write_finished
//      mbedtls_ssl_write
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_read_record
//      mbedtls_ssl_parse_certificate
//      mbedtls_ssl_parse_change_cipher_spec
//      mbedtls_ssl_parse_finished
//      mbedtls_ssl_read
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_debug_print_msg(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_274 * a4, Eq_2 a5, union Eq_2 & a1Out, ptr32 & a2Out, struct Eq_294116 & a3Out, struct Eq_274 & a4Out, union Eq_2 & a5Out, ptr32 & a7Out, union Eq_294120 & s4Out, int32 & s5Out, union Eq_294120 & s6Out, ptr32 & s7Out, union Eq_294120 & s8Out, ptr32 & s9Out, struct Eq_294126 & s10Out, struct Eq_294127 & s11Out, ptr32 & t4Out)
{
	if (a0 != 0x00)
	{
		a0 = *a5;
		if (a5 != 0x00)
		{
			a5 = *((word32) a5 + 16);
			if (a5 != 0x00)
			{
				a5 = g_t4200D97C;
				if (a5 >= a1)
				{
					Eq_2 s1_44;
					ptr32 s2_47;
					struct Eq_294116 * s3_48;
					word32 t0_173;
					word32 s0_174;
					word32 a1_175;
					word32 a2_176;
					word32 a3_177;
					word32 a4_178;
					word32 a5_179;
					Eq_2 a0_38;
					vsnprintf(ra, fp + -560, 0x0200, a4, fp + -0x0C, dwLoc01E8, dwLoc01C8, dwLoc019C, dwLoc0180, dwLoc017C, dwLoc0158, dwLoc0134, out t0_173, out s0_174, out s1_44, out a0_38, out a1_175, out a2_176, out a3_177, out a4_178, out a5_179, out a7, out s2_47, out s3_48, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4);
					a5.u0 = 510;
					if (a0_38 <= 510)
					{
						a0_38 = (word32) a0_38 + (fp + -48);
						((word32) a0_38 + 0x0E00)->u1 = 0x0A;
						((word32) a0_38 + 3585)->u1 = 0x00;
						a5.u0 = 0x0A;
					}
					a4 = fp + -560;
					a3 = s3_48;
					a2 = s2_47;
					a1 = s1_44;
					a0 = debug_send_line.isra.0(a0_38);
				}
			}
		}
	}
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	a7Out = a7;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	t4Out = t4;
	return a0;
}

// 2306305C: Register Eq_2 mbedtls_debug_print_ret(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a5, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_295720) a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_295724 s6Out, Register out ptr32 s7Out, Register out Eq_295726 s8Out, Register out ptr32 s9Out, Register out (ptr32 Eq_295728) s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_ssl_derive_keys
//      mbedtls_ssl_flush_output
//      mbedtls_ssl_write_record
//      mbedtls_ssl_resend
//      mbedtls_ssl_fetch_input
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_send_alert_message
//      mbedtls_ssl_close_notify
//      mbedtls_ssl_write_certificate
//      mbedtls_ssl_write_change_cipher_spec
//      mbedtls_ssl_write_finished
//      mbedtls_ssl_write
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_read_record
//      mbedtls_ssl_parse_certificate
//      mbedtls_ssl_parse_change_cipher_spec
//      mbedtls_ssl_parse_finished
//      mbedtls_ssl_read
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_debug_print_ret(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a5, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, struct Eq_295720 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_295724 & s6Out, ptr32 & s7Out, union Eq_295724 & s8Out, ptr32 & s9Out, struct Eq_295728 & s10Out, ptr32 & s11Out)
{
	Eq_2 a0_16 = *a3;
	if (a3 != 0x00)
	{
		a3 = *((word32) a3 + 16);
		if (a3 != 0x00)
		{
			a3 = g_t4200D97C;
			if (a3 >= a1)
			{
				a3.u0 = 0xF9000700;
				if (a5 != 0xF9000700)
				{
					Eq_2 a0_37;
					Eq_2 s1_46;
					ptr32 s2_49;
					Eq_2 s3_50;
					word32 s0_139;
					word32 a1_140;
					word32 a2_141;
					word32 a3_142;
					word32 a4_143;
					word32 a7_144;
					snprintf(ra, fp + -544, 0x0200, &g_t2308B084, dwLoc0208, dwLoc01E8, dwLoc01BC, dwLoc01A0, dwLoc019C, dwLoc0178, dwLoc0154, out s0_139, out s1_46, out a0_37, out a1_140, out a2_141, out a3_142, out a4_143, out a5, out a7_144, out s2_49, out s3_50, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11);
					a4 = fp + -544;
					a3 = s3_50;
					a2 = s2_49;
					a1 = s1_46;
					a0_16 = debug_send_line.isra.0(a0_37);
				}
			}
		}
	}
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return a0_16;
}

// 230630DE: Register Eq_2 mbedtls_debug_print_buf(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a5, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_294356 a3Out, Register out (ptr32 Eq_294357) a4Out, Register out Eq_2 a5Out, Register out ptr32 a7Out)
// Called from:
//      ssl_calc_finished_tls_sha256
//      ssl_calc_verify_tls_sha256
//      mbedtls_ssl_derive_keys
//      mbedtls_ssl_write_record
//      mbedtls_ssl_resend
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_debug_print_buf(Eq_2 ra, Eq_2 a1, Eq_2 a5, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_294356 & a3Out, struct Eq_294357 & a4Out, union Eq_2 & a5Out, ptr32 & a7Out)
{
	Eq_2 a0_211 = *a5;
	if (a5 != 0x00)
	{
		a5 = *((word32) a5 + 16);
		if (a5 != 0x00)
		{
			a5 = g_t4200D97C;
			if (a5 >= a1)
			{
				Eq_2 a0_52;
				word32 s1_558;
				word32 a2_560;
				word32 a1_559;
				word32 s6_568;
				word32 s9_571;
				word32 s10_572;
				word32 s11_573;
				word32 s7_569;
				word32 s8_570;
				word32 a3_561;
				word32 s2_564;
				word32 s3_565;
				word32 s4_566;
				word32 s5_567;
				word32 a4_562;
				word32 a5_563;
				ui32 s0_101;
				Eq_2 ra_59 = snprintf(ra, fp + -576, 0x0200, &g_t2308AFE8, dwLoc0258, dwLoc0238, dwLoc020C, dwLoc01F0, dwLoc01EC, dwLoc01C8, dwLoc01A4, out s0_101, out s1_558, out a0_52, out a1_559, out a2_560, out a3_561, out a4_562, out a5_563, out a7, out s2_564, out s3_565, out s4_566, out s5_567, out s6_568, out s7_569, out s8_570, out s9_571, out s10_572, out s11_573);
				debug_send_line.isra.0(a0_52);
				word32 t1_574;
				Eq_2 ra_113 = memset(ra_59, fp + -596, 0x00, 0x11, out t1_574, out a0_211, out a1, out a2, out a3, out a4, out a5);
				int32 s7_106 = 0x00;
				ui32 s8_100 = 0x00;
				int32 s6_108 = 0x0200;
				word32 s9_111 = 0x2308B000;
				word32 s10_180 = 0x23081000;
				while (s8_100 != s0_101)
				{
					word32 a5_102 = 0x01000000;
					if (s8_100 == 0x01000000)
						goto l23063198;
					if ((s8_100 & 0x0F) == 0x00)
					{
						if (s8_100 != 0x00)
						{
							Eq_2 a0_115;
							word32 s11_638;
							word32 s3_631;
							word32 s7_634;
							word32 s8_635;
							word32 s9_636;
							word32 s10_637;
							word32 s4_632;
							word32 s5_633;
							word32 a1_624;
							word32 a4_627;
							word32 a5_628;
							word32 a7_629;
							word32 s2_630;
							word32 a2_625;
							word32 a3_626;
							word32 s0_622;
							word32 s1_623;
							Eq_2 ra_122 = snprintf(ra_113, fp + -576 + s7_106, s6_108 - s7_106, s9_111 + 4, dwLoc0258, dwLoc0238, dwLoc020C, dwLoc01F0, dwLoc01EC, dwLoc01C8, dwLoc01A4, out s0_622, out s1_623, out a0_115, out a1_624, out a2_625, out a3_626, out a4_627, out a5_628, out a7_629, out s2_630, out s3_631, out s4_632, out s5_633, out s6_108, out s7_634, out s8_635, out s9_636, out s10_637, out s11_638);
							debug_send_line.isra.0(a0_115);
							word32 a5_645;
							word32 a1_641;
							word32 a2_642;
							word32 a3_643;
							word32 a4_644;
							word32 t1_639;
							word32 a0_640;
							ra_113 = memset(ra_122, fp + -596, 0x00, 0x11, out t1_639, out a0_640, out a1_641, out a2_642, out a3_643, out a4_644, out a5_645);
							s7_106 = 0x00;
						}
						word32 a0_170;
						word32 s7_187;
						word32 s3_617;
						word32 s9_620;
						word32 s11_621;
						word32 s4_618;
						word32 s5_619;
						word32 s1_610;
						word32 a3_613;
						word32 a4_614;
						word32 a7_615;
						word32 s2_616;
						word32 a1_611;
						word32 a2_612;
						word32 s0_609;
						ra_113 = snprintf(ra_113, fp + -576 + s7_106, s6_108 - s7_106, &g_t2308B00C, dwLoc0258, dwLoc0238, dwLoc020C, dwLoc01F0, dwLoc01EC, dwLoc01C8, dwLoc01A4, out s0_609, out s1_610, out a0_170, out a1_611, out a2_612, out a3_613, out a4_614, out a5_102, out a7_615, out s2_616, out s3_617, out s4_618, out s5_619, out s6_108, out s7_187, out s8_100, out s9_620, out s10_180, out s11_621);
						s7_106 = s7_187 + a0_170;
					}
					Eq_2 a4_205 = a5_102 + s8_100;
					byte * a4_215;
					Eq_294356 s11_222;
					int32 s3_224;
					word32 s7_228;
					word32 s8_229;
					word32 a2_603;
					word32 s2_606;
					word32 s4_607;
					word32 s5_608;
					word32 a3_604;
					word32 a5_605;
					word32 s1_602;
					ra_113 = snprintf(ra_113, fp + -576 + s7_106, s6_108 - s7_106, s10_180 + 0x063C, dwLoc0258, dwLoc0238, dwLoc020C, dwLoc01F0, a4_205, dwLoc01C8, dwLoc01A4, out s0_101, out s1_602, out a0_211, out a1, out a2_603, out a3_604, out a4_215, out a5_605, out a7, out s2_606, out s3_224, out s4_607, out s5_608, out s6_108, out s7_228, out s8_229, out s9_111, out s10_180, out s11_222);
					a4 = (word32) *a4_215;
					dwLoc01EC = a4_205;
					a2 = dwLoc01AC;
					s7_106 = (word32) a0_211 + s7_228;
					a3 = a4 + -32 & 0x00FF;
					if (s11_222 < a3)
						a4 = (struct Eq_294357 *) 46;
					(s3_224 + (fp + -64))->b0DEC = (byte) a4;
					a5 = fp + -64;
					s8_100 = s8_229 + 0x01;
				}
				if (s0_101 != 0x00)
				{
					int32 s3_248 = 0x0200;
					word32 s6_249 = 0x23088000;
					while (true)
					{
						Eq_2 a0_255 = fp + -576 + s7_106;
						Eq_7997 a1_257 = s3_248 - s7_106;
						if ((s0_101 & 0x0F) == 0x00)
							break;
						word32 a0_262;
						word32 s0_270;
						word32 s7_279;
						word32 s2_582;
						word32 s8_585;
						word32 s9_586;
						word32 s10_587;
						word32 s11_588;
						word32 s4_583;
						word32 s5_584;
						word32 s1_575;
						word32 a3_578;
						word32 a4_579;
						word32 a5_580;
						word32 a7_581;
						word32 a1_576;
						word32 a2_577;
						ra_113 = snprintf(ra_113, a0_255, a1_257, s6_249 + -0x072C, dwLoc0258, dwLoc0238, dwLoc020C, dwLoc01F0, dwLoc01EC, dwLoc01C8, dwLoc01A4, out s0_270, out s1_575, out a0_262, out a1_576, out a2_577, out a3_578, out a4_579, out a5_580, out a7_581, out s2_582, out s3_248, out s4_583, out s5_584, out s6_249, out s7_279, out s8_585, out s9_586, out s10_587, out s11_588);
						s7_106 = s7_279 + a0_262;
						s0_101 = s0_270 + 0x01;
					}
l23063198:
					Eq_2 a0_298;
					Eq_2 s2_310;
					ptr32 s4_312;
					Eq_294356 s5_313;
					word32 s6_596;
					word32 s9_599;
					word32 s10_600;
					word32 s11_601;
					word32 s7_597;
					word32 s8_598;
					word32 s0_589;
					word32 a2_592;
					word32 a3_593;
					word32 a4_594;
					word32 s3_595;
					word32 s1_590;
					word32 a1_591;
					snprintf(ra_113, fp + -576 + s7_106, 0x0200 - s7_106, &g_t2308B004, dwLoc0258, dwLoc0238, dwLoc020C, dwLoc01F0, dwLoc01EC, dwLoc01C8, dwLoc01A4, out s0_589, out s1_590, out a0_298, out a1_591, out a2_592, out a3_593, out a4_594, out a5, out a7, out s2_310, out s3_595, out s4_312, out s5_313, out s6_596, out s7_597, out s8_598, out s9_599, out s10_600, out s11_601);
					a4 = fp + -576;
					a3 = s5_313;
					a2 = s4_312;
					a1 = s2_310;
					a0_211 = debug_send_line.isra.0(a0_298);
				}
			}
		}
	}
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	a7Out = a7;
	return a0_211;
}

// 230632A6: Register (ptr32 (ptr32 (ptr32 Eq_329291))) mbedtls_debug_print_mpi(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 (ptr32 (ptr32 Eq_329291))) a0, Register Eq_2 a1, Register int32 a5, Register out Eq_2 a1Out, Register out ptr32 a2Out)
// Called from:
//      mbedtls_debug_print_ecp
//      mbedtls_debug_print_crt
struct Eq_329291 *** mbedtls_debug_print_mpi(Eq_2 ra, Eq_2 s1, struct Eq_329291 *** a0, Eq_2 a1, int32 a5, union Eq_2 & a1Out, ptr32 & a2Out)
{
	struct Eq_329291 * a6_5 = *a0;
	if (a6_5 == null || (a6_5->dw0010 == 0x00 || (a5 == 0x00 || g_t4200D97C < a1)))
	{
		a1Out = a1;
		a2Out = a2;
		return a0;
	}
	else
	{
		Eq_2 a1_14;
		ptr32 a2_15;
		struct Eq_329291 *** a0_13 = mbedtls_debug_print_mpi.part.1(ra, s1, a1, out a1_14, out a2_15);
		a1Out = a1_14;
		a2Out = a2_15;
		return a0_13;
	}
}

