pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 230632CA: Register Eq_2 mbedtls_debug_print_ecp.part.2(Register Eq_2 ra, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_debug_print_ecp
Eq_2 mbedtls_debug_print_ecp.part.2(Eq_2 ra, ptr32 & a1Out, ptr32 & a2Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_329291 *** s0_43;
	Eq_2 s1_44;
	int32 s4_49;
	word32 a0_150;
	word32 a1_151;
	word32 a2_152;
	word32 a3_153;
	word32 a4_154;
	word32 a5_155;
	word32 a7_156;
	word32 s2_157;
	word32 s3_158;
	word32 s5_159;
	word32 s6_160;
	word32 s7_161;
	word32 s8_162;
	word32 s9_163;
	word32 s10_164;
	word32 s11_165;
	Eq_2 ra_42 = snprintf(ra, fp + -544, 0x0200, &g_t2308B050, dwLoc0208, dwLoc01E8, dwLoc01BC, dwLoc01A0, dwLoc019C, dwLoc0178, dwLoc0154, out s0_43, out s1_44, out a0_150, out a1_151, out a2_152, out a3_153, out a4_154, out a5_155, out a7_156, out s2_157, out s3_158, out s4_49, out s5_159, out s6_160, out s7_161, out s8_162, out s9_163, out s10_164, out s11_165);
	word32 a1_166;
	word32 a2_167;
	mbedtls_debug_print_mpi(ra_42, s1_44, s0_43, s1_44, s4_49, out a1_166, out a2_167);
	struct Eq_329291 *** s0_89;
	Eq_2 s1_90;
	ptr32 s10_91;
	ptr32 s11_92;
	word32 s4_95;
	ptr32 s7_98;
	ptr32 s8_99;
	ptr32 a1_112;
	ptr32 a2_113;
	word32 a0_168;
	word32 a1_169;
	word32 a2_170;
	word32 a3_171;
	word32 a4_172;
	word32 a5_173;
	word32 a7_174;
	word32 s2_175;
	word32 s3_176;
	word32 s5_177;
	word32 s6_178;
	word32 s9_179;
	Eq_2 a0_111 = mbedtls_debug_print_mpi(snprintf(ra_42, fp + -544, 0x0200, &g_t2308B058, dwLoc0208, dwLoc01E8, dwLoc01BC, dwLoc01A0, dwLoc019C, dwLoc0178, dwLoc0154, out s0_89, out s1_90, out a0_168, out a1_169, out a2_170, out a3_171, out a4_172, out a5_173, out a7_174, out s2_175, out s3_176, out s4_95, out s5_177, out s6_178, out s7_98, out s8_99, out s9_179, out s10_91, out s11_92), s1_90, s0_89, s1_90, s4_95 + 0x0C, out a1_112, out a2_113);
	a1Out = a1_112;
	a2Out = a2_113;
	s7Out = s7_98;
	s8Out = s8_99;
	s10Out = s10_91;
	s11Out = s11_92;
	return a0_111;
}

// 23063362: Register (ptr32 (ptr32 (ptr32 Eq_329291))) mbedtls_debug_print_ecp(Register Eq_2 ra, Register (ptr32 (ptr32 (ptr32 Eq_329291))) a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out ptr32 s7Out, Register out (ptr32 Eq_329442) s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_debug_print_crt
struct Eq_329291 *** mbedtls_debug_print_ecp(Eq_2 ra, struct Eq_329291 *** a0, Eq_2 a1, union Eq_2 & a1Out, ptr32 & a2Out, ptr32 & s7Out, struct Eq_329442 & s8Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_329291 * a6_5 = *a0;
	if (a6_5 == null || (a6_5->dw0010 == 0x00 || g_t4200D97C < a1))
	{
		a1Out = a1;
		a2Out = a2;
		s7Out = s7;
		s8Out = s8;
		s10Out = s10;
		s11Out = s11;
		return a0;
	}
	else
	{
		Eq_2 a1_12;
		ptr32 a2_13;
		ptr32 s10_19;
		ptr32 s11_20;
		ptr32 s7_22;
		struct Eq_329442 * s8_23;
		struct Eq_329291 *** a0_11 = mbedtls_debug_print_ecp.part.2(ra, out a1_12, out a2_13, out s7_22, out s8_23, out s10_19, out s11_20);
		a1Out = a1_12;
		a2Out = a2_13;
		s7Out = s7_22;
		s8Out = s8_23;
		s10Out = s10_19;
		s11Out = s11_20;
		return a0_11;
	}
}

// 23063384: Register Eq_2 mbedtls_debug_print_crt(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5, Register out (ptr32 (ptr32 (ptr32 Eq_329291))) s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_304597 a2Out, Register out ptr32 a3Out, Register out Eq_2 a5Out, Register out Eq_304597 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_ssl_write_certificate
//      mbedtls_ssl_parse_certificate
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_debug_print_crt(Eq_2 ra, Eq_2 a1, Eq_2 a4, Eq_2 a5, struct Eq_329291 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_304597 & a2Out, ptr32 & a3Out, union Eq_2 & a5Out, union Eq_304597 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & s9Out, union Eq_2 & s10Out, ptr32 & s11Out)
{
	Eq_2 a0_203 = *a5;
	if (a5 != 0x00)
	{
		a5 = *((word32) a5 + 16);
		if (a5 != 0x00 && a5 != 0x00)
		{
			a5 = g_t4200D97C;
			if (a5 >= a1)
			{
				do
				{
					Eq_2 a0_65;
					Eq_2 s1_74;
					Eq_2 s2_77;
					word32 a4_760;
					word32 s11_771;
					word32 s8_768;
					word32 s9_769;
					word32 s10_770;
					word32 s7_767;
					word32 a5_761;
					word32 s4_764;
					word32 s5_765;
					word32 s6_766;
					word32 a7_762;
					word32 s3_763;
					word32 a1_757;
					word32 a2_758;
					word32 a3_759;
					word32 s0_756;
					Eq_2 ra_72 = snprintf(ra, fp + -2112, 0x0200, &g_t2308B014, dwLoc0848, dwLoc0828, dwLoc07FC, dwLoc07E0, a4, dwLoc07B8, dwLoc0794, out s0_756, out s1_74, out a0_65, out a1_757, out a2_758, out a3_759, out a4_760, out a5_761, out a7_762, out s2_77, out s3_763, out s4_764, out s5_765, out s6_766, out s7_767, out s8_768, out s9_769, out s10_770, out s11_771);
					debug_send_line.isra.0(a0_65);
					Eq_2 s1_109;
					word32 a3_772;
					Eq_2 s5_115;
					struct Eq_329539 * s2_112;
					Eq_2 ra_107 = mbedtls_x509_crt_info(ra_72, s1_74, fp + -0x0440, 0x03FF, s2_77, s2_77, dwLoc0860, dwLoc085C, dwLoc0850, dwLoc0848, dwLoc0840, dwLoc083C, dwLoc0838, dwLoc0828, dwLoc0824, dwLoc0804, dwLoc07F4, dwLoc0798, dwLoc06EC, out s0, out s1_109, out a3_772, out s2_112, out s3, out s4, out s5_115, out s7, out s10);
					Eq_2 a2_126 = fp + -0x0440;
					Eq_2 a1_127 = fp + -0x0440;
					s11 = 0x0A;
					while (true)
					{
						word32 a5_132 = (word32) *a2_126;
						if (a5_132 == 0x00)
							break;
						s10 = (word32) a2_126 + 1;
						if (a5_132 == 0x0A)
						{
							Eq_329728 a2_136 = a2_126 - a1_127;
							Eq_2 s9_137 = (word32) a2_136 + 1;
							if (a2_136 > -510)
								s9_137.u0 = 511;
							word32 a5_784;
							word32 a6_785;
							word32 a7_786;
							word32 a4_783;
							word32 a1_780;
							word32 a2_781;
							word32 a3_782;
							memcpy(fp + -1600, a1_127, s9_137, out a1_780, out a2_781, out a3_782, out a4_783, out a5_784, out a6_785, out a7_786);
							(word32) s9_137 + (fp + 0x00FFEFC0) + 0x0A00 = (int32) 0x00;
							debug_send_line.isra.0(fp + -1600);
							s0 = dwLoc0640;
							a1_127 = s10;
						}
						a2_126 = s10;
					}
					a1 = fp + -1600;
					struct Eq_283897 * a5_194;
					word32 a2_753;
					word32 a3_754;
					word32 a4_755;
					word32 a0_751;
					word32 a1_752;
					word32 t1_750;
					ra = mbedtls_pk_debug(memset(ra_107, fp + -1600, 0x00, 36, out t1_750, out a0_751, out a1_752, out a2_753, out a3_754, out a4_755, out a5_194), (char *) s2_112 + 188, a5_194, dwLoc0850, out a0_203, out a2, out a5);
					if (a0_203 != 0x00)
					{
						s0 = (struct Eq_329291 ***) *a0_203;
						a2 = s3;
						a1 = s1_109;
						a0_203 = debug_send_line.isra.0(a0_203);
					}
					else
					{
						byte * s8_211 = fp + -1600;
						s10.u0 = 0x01;
						s11 = 0x2308B000;
						do
						{
							a5 = (word32) *s8_211;
							if (a5 == 0x00)
								break;
							Eq_2 a0_231;
							Eq_2 s1_240;
							struct Eq_329651 * s9_250;
							word32 s6_779;
							word32 a4_776;
							word32 a5_777;
							word32 a7_778;
							word32 a3_775;
							word32 a1_773;
							word32 a2_774;
							struct Eq_329659 * s8_249;
							ra = snprintf(ra, s5_115, 0x10, &g_t230812A8, dwLoc0848, dwLoc0828, dwLoc07FC, dwLoc07E0, a4, dwLoc07B8, dwLoc0794, out s0, out s1_240, out a0_231, out a1_773, out a2_774, out a3_775, out a4_776, out a5_777, out a7_778, out s2_112, out s3, out s4, out s5_115, out s6_779, out s7, out s8_249, out s9_250, out s10, out s11);
							Eq_2 a5_254 = (word32) s8_249->b0000;
							s9_250->b07FF = 0x00;
							if (a5_254 == s10)
								a0_203 = mbedtls_debug_print_mpi(ra, s1_240, s0, s1_240, s8_249->dw0008, out a1, out a2);
							else if (a5_254 == 0x02)
								a0_203 = mbedtls_debug_print_ecp(ra, s0, s1_240, out a1, out a2, out s7, out s8_249, out s10, out s11);
							else
							{
								s0 = (struct Eq_329291 ***) *a0_231;
								a2 = s3;
								a1 = s1_240;
								a0_203 = debug_send_line.isra.0(a0_231);
							}
							s8_211 = (byte *) (&s8_249->dw0008 + 1);
							a5 = fp + -0x061C;
						} while (s8_211 != fp + -0x061C);
					}
				} while (s2_112->dw0130 != 0x00);
			}
		}
	}
	s0Out = s0;
	s1Out = dwLoc64;
	a0Out = a0_203;
	a1Out = a1;
	a2Out = a2;
	a3Out = dwArg78;
	a5Out = a5;
	s3Out = s3;
	s4Out = s4;
	s7Out = s7;
	s9Out = dwArg18;
	s10Out = s10;
	s11Out = s11;
	return dwLoc24;
}

