pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23063550: Register word32 ecp_get_type(Register Eq_2 a5)
// Called from:
//      mbedtls_ecp_check_pubkey
//      mbedtls_ecp_check_privkey
//      mbedtls_ecp_mul
word32 ecp_get_type(Eq_2 a5)
{
	struct Eq_329773 * a0_5 = *((word32) a5 + 48);
	if (a5 == 0x00)
		return 0x00;
	return (word32) (a0_5->t003C < 1) + 0x01;
}

// 23063562: Register Eq_2 ecp_safe_invert_jac(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_329811 a4Out, Register out Eq_329812 a5Out, Register out Eq_329813 s2Out, Register out ptr32 s3Out, Register out ptr32 s8Out)
// Called from:
//      ecp_select_comb
//      mbedtls_ecp_mul
Eq_2 ecp_safe_invert_jac(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_329811 & a4Out, union Eq_329812 & a5Out, union Eq_329813 & s2Out, ptr32 & s3Out, ptr32 & s8Out)
{
	word32 a0_27;
	word32 s1_158;
	word32 a3_159;
	word32 s4_160;
	word32 s8_161;
	Eq_2 a5_32;
	Eq_2 a4_31;
	Eq_2 a2_29;
	ptr32 s3_142;
	Eq_329813 s2_141;
	ptr32 s0_140;
	Eq_2 ra_139 = mbedtls_mpi_sub_mpi(ra, (word32) a1 + 0x0C, fp + ~0x1B, a3, a4, mbedtls_mpi_init(fp + ~0x1B), a2, mstatus, dwArg78, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out s0_140, out s1_158, out a0_27, out a2_29, out a3_159, out a4_31, out a5_32, out s2_141, out s3_142, out s4_160, out s8_161);
	if (a0_27 == 0x00)
	{
		Eq_2 a3_54;
		Eq_2 a4_55;
		word32 a1_162;
		word32 a2_163;
		word32 a5_164;
		word32 a6_165;
		word32 s1_166;
		word32 a0_167;
		word32 a3_168;
		word32 s4_169;
		ra_139 = mbedtls_mpi_safe_cond_assign(ra_139, fp + ~0x1B, s2_141 & (word32) (mbedtls_mpi_cmp_int(0x00, a2_29, out a1_162, out a2_163, out a3_54, out a4_55, out a5_164, out a6_165) != 0x00), a3_54, a4_55, mstatus, dwLoc08, dwArgC8, dwArg0108, dwArg0148, out s0_140, out s1_166, out a0_167, out a2_29, out a3_168, out a4_31, out a5_32, out s2_141, out s3_142, out s4_169);
	}
	ptr32 a2_95;
	Eq_329812 a5_96;
	ptr32 a3_98;
	Eq_329811 a4_99;
	word32 a0_170;
	word32 a1_171;
	word32 a6_172;
	word32 s4_173;
	Eq_2 s1_101 = mbedtls_mpi_free(fp + ~0x1B, a2_29, a4_31, a5_32, mstatus, dwArg0128, dwArg0168, out a0_170, out a1_171, out a2_95, out a3_98, out a4_99, out a5_96, out a6_172, out s4_173);
	s0Out = s0_140;
	s1Out = s1_101;
	a0Out = s1_101;
	a2Out = a2_95;
	a3Out = a3_98;
	a4Out = a4_99;
	a5Out = a5_96;
	s2Out = s2_141;
	s3Out = s3_142;
	s8Out = dwLoc1C;
	return ra_139;
}

// 230635B6: Register Eq_2 ecp_select_comb(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_321133 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_ecp_mul
Eq_2 ecp_select_comb(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_321133 & s2Out, union Eq_2 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out)
{
	uint32 s4_33 = a4 >> 0x01 & 63;
	Eq_2 s1_114 = a2;
	Eq_2 s0_113 = 0x00;
	a4_220 = a4;
	a3_218 = a3;
	do
	{
		Eq_2 a3_218;
		Eq_2 a4_220;
		word32 s1_63;
		word32 s0_269;
		word32 a2_270;
		word32 s4_271;
		ptr32 a5_222;
		Eq_2 s3_234;
		ptr32 a0_213;
		Eq_321133 s2_232;
		ra = mbedtls_mpi_safe_cond_assign(ra, s1_114, (word32) (s4_33 - s0_113 < 1), a3_218, a4_220, mstatus, dwLoc18, dwArgB8, dwArgF8, dwArg0138, out s0_269, out s1_63, out a0_213, out a2_270, out a3_218, out a4_220, out a5_222, out s2_232, out s3_234, out s4_271);
		if (a0_213 != 0x00)
		{
l23063636:
			0x00 = (uint16) dwArg0128;
			s0Out = s4;
			a0Out = a0_213;
			a2Out = dwArgB8;
			a3Out = a3_218;
			a4Out = a4_220;
			a5Out = a5_222;
			s2Out = s2_232;
			s3Out = s3_234;
			s5Out.u0 = <invalid>;
			s6Out.u0 = <invalid>;
			s7Out.u0 = <invalid>;
			s8Out = s5;
			return ra;
		}
		word32 s0_87;
		word32 s1_88;
		word32 a2_268;
		ra = mbedtls_mpi_safe_cond_assign(ra, s1_63 + 0x0C, s2_232, a3_218, a4_220, mstatus, dwLoc18, dwArgB8, dwArgF8, dwArg0138, out s0_87, out s1_88, out a0_213, out a2_268, out a3_218, out a4_220, out a5_222, out s2_232, out s3_234, out s4_33);
		if (a0_213 != 0x00)
			goto l23063636;
		s0_113 = s0_87 + 0x01 & 0x00FF;
		s1_114 = s1_88 + 36;
	} while (a3 != s0_113);
	0x00 = (uint16) dwArg0128;
	ptr32 a0_131;
	Eq_2 a2_133;
	Eq_2 a3_134;
	Eq_2 a4_135;
	ptr32 a5_136;
	ptr32 s0_140;
	Eq_321133 s2_142;
	Eq_2 s3_143;
	ptr32 s8_145;
	word32 s1_272;
	Eq_2 ra_139 = ecp_safe_invert_jac(ra, s3_234, a4 >> 0x07, a3_218, a4_220, mstatus, dwArg78, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, out s0_140, out s1_272, out a0_131, out a2_133, out a3_134, out a4_135, out a5_136, out s2_142, out s3_143, out s8_145);
	s0Out = s0_140;
	a0Out = a0_131;
	a2Out = a2_133;
	a3Out = a3_134;
	a4Out = a4_135;
	a5Out = a5_136;
	s2Out = s2_142;
	s3Out = s3_143;
	s5Out.u0 = <invalid>;
	s6Out.u0 = <invalid>;
	s7Out.u0 = <invalid>;
	s8Out = s8_145;
	return ra_139;
}

// 2306364E: Register Eq_2 ecp_modp(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0114, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0134, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_330076) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_330082 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      ecp_double_jac
//      ecp_normalize_jac
//      ecp_normalize_jac_many
//      ecp_add_mixed
//      mbedtls_ecp_check_pubkey
//      mbedtls_ecp_mul
Eq_2 ecp_modp(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0114, Eq_2 dwArg0128, Eq_2 dwArg0134, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, struct Eq_330076 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_330082 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a1_13 = *((word32) a5 + 100);
	if (a5 == 0x00)
	{
		0x00 = (uint16) dwArg38;
		Eq_2 a0_180;
		Eq_2 a2_182;
		Eq_2 a3_183;
		Eq_2 a4_184;
		Eq_2 a5_185;
		Eq_2 s1_187;
		Eq_2 s2_188;
		Eq_2 s10_193;
		Eq_2 s11_194;
		struct Eq_330076 * s3_195;
		ptr32 s4_196;
		Eq_2 s5_197;
		Eq_2 s6_198;
		Eq_2 s7_199;
		ptr32 s8_200;
		Eq_330082 s9_201;
		word32 a7_485;
		Eq_2 ra_192 = mbedtls_mpi_mod_mpi(ra, a0, a0, (word32) a1_13 + 4, s5, s6, s7, s10, s11, mstatus, dwArg08, dwArg28, dwArg38, dwArg44, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0114, dwArg0128, dwArg0134, out s1_187, out a0_180, out a2_182, out a3_183, out a4_184, out a5_185, out a7_485, out s2_188, out s3_195, out s4_196, out s5_197, out s6_198, out s7_199, out s8_200, out s9_201, out s10_193, out s11_194);
		s1Out = s1_187;
		a0Out = a0_180;
		a2Out = a2_182;
		a3Out = a3_183;
		a4Out = a4_184;
		a5Out = a5_185;
		s2Out = s2_188;
		s3Out = s3_195;
		s4Out = s4_196;
		s5Out = s5_197;
		s6Out = s6_198;
		s7Out = s7_199;
		s8Out = s8_200;
		s9Out = s9_201;
		s10Out = s10_193;
		s11Out = s11_194;
		mstatusOut = mstatus;
		return ra_192;
	}
	Eq_2 a3_118;
	Eq_2 s2_137;
	Eq_2 s1_108 = a1_13;
	if (a5 < 0x00)
	{
		word32 a1_472;
		word32 a6_473;
		if (mbedtls_mpi_cmp_int(0x00, a2, out a1_472, out a2, out a3_118, out a4, out a5, out a6_473) != 0x00)
			goto l23063688;
	}
	word32 a2_36;
	struct Eq_330112 * a5_39;
	word32 a1_474;
	struct Eq_287564 * a0_34 = mbedtls_mpi_bitlen(a2, a4, a5, out a1_474, out a2_36, out a3_118, out a4, out a5_39);
	s1_108 = a5_39->t0058;
	a5 = a5_39 << 1;
	if (a5_39 << 1 >= a0_34)
	{
		word32 t4_225;
		word32 t1_224;
		word32 t0_223;
		struct Eq_330132 * sp_49;
		Eq_2 a0_56;
		word32 a6_61;
		word32 t3_62;
		word32 a7_219;
		word32 t5_226;
		word32 t6_227;
		Eq_2 a2_114;
		(a5_39 << 1)();
		s2_137 = a0_56;
		if (a0_56 == 0x00)
		{
			do
			{
				Eq_2 a0_129;
				Eq_2 s0_110 = *a5;
				if (a5 >= 0x00)
				{
l230636C2:
					do
					{
						word32 a1_475;
						word32 a2_476;
						word32 a6_477;
						if (mbedtls_mpi_cmp_mpi(a2_114, a4, a5, out a1_475, out a2_476, out a3_118, out a4, out a5, out a6_477) < 0x00)
							goto l2306368E;
						word32 a1_483;
						word32 a7_484;
						ra = mbedtls_mpi_sub_abs(ra, s0_110, s0_110, s1_108, a3_118, a4, a5, mstatus, sp_49->t00B8, sp_49->t00F8, sp_49->t0118, sp_49->t0128, sp_49->t0138, sp_49->t0158, out s0_110, out s1_108, out a0_129, out a1_483, out a2_114, out a3_118, out a4, out a5, out a7_484, out s2_137, out s3, out s4, out s8);
					} while (a0_129 == 0x00);
					break;
				}
				Eq_2 a3_73;
				word32 a1_478;
				word32 a6_479;
				if (mbedtls_mpi_cmp_int(0x00, a2_114, out a1_478, out a2_114, out a3_73, out a4, out a5, out a6_479) == 0x00)
					goto l230636C2;
				word32 a1_481;
				word32 s0_480;
				word32 a7_482;
				ra = mbedtls_mpi_add_mpi(ra, s0_110, s0_110, a3_73, a4, a5, s2_137, mstatus, sp_49->t0098, sp_49->t00B8, sp_49->t00D8, sp_49->t00F8, sp_49->t0108, sp_49->t0118, sp_49->t0138, out s0_480, out s1_108, out a0_129, out a1_481, out a2_114, out a3_118, out a4, out a5, out a7_482, out s2_137, out s3, out s4, out s8);
			} while (a0_129 == 0x00);
			s2_137 = a0_129;
		}
		goto l2306368E;
	}
l23063688:
	s2_137.u0 = 0xFB000080;
l2306368E:
	0x00 = (uint16) dwArg38;
	s1Out = s1_108;
	a0Out = s2_137;
	a2Out = dwArg10;
	a3Out = a3_118;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2_137;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

