pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
																			Eq_2 ra_1156 = mbedtls_mpi_shift_l(ra_1130, (struct Eq_321600 *) 0x01, a2_1016, a4_1018, a5_1019, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s0_2912, out s1_2913, out a0_1148, out a2_1016, out a3_2914, out a4_1018, out a5_1019, out a7_2915, out s2_1025, out s3_1026, out s4_1161, out s8_1004);
																			while (true)
																			{
																				s0_101 = a0_1148;
																				if (a0_1148 != 0x00)
																					break;
																				Eq_2 a3_1182;
																				Eq_2 a4_1183;
																				Eq_2 a5_1184;
																				word32 a6_2918;
																				word32 a1_2916;
																				word32 a2_2917;
																				if (mbedtls_mpi_cmp_mpi(a2_1016, a4_1018, a5_1019, out a1_2916, out a2_2917, out a3_1182, out a4_1183, out a5_1184, out a6_2918) < 0x00)
																				{
																					Eq_2 s5_1233;
																					Eq_2 a0_1242;
																					word32 s1_2925;
																					word32 a3_2926;
																					word32 s4_2927;
																					word32 s0_2924;
																					Eq_2 ra_1227 = mbedtls_mpi_mul_mpi(ra_1156, fp + -72, fp + -96, fp + -96, a3_1182, a4_1183, s2_1025, s4_1161, s6_1002, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_2924, out s1_2925, out a0_1242, out a2_1016, out a3_2926, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2927, out s5_1233, out s6_1002, out s8_1004);
																					s0_101 = a0_1242;
																					if (a0_1242 == 0x00)
																					{
																						Eq_2 a0_1250;
																						Eq_2 a3_1253;
																						word32 s1_2928;
																						word32 s4_2929;
																						word32 s5_2930;
																						word32 s9_2931;
																						Eq_2 ra_1263 = ecp_modp(ra_1227, fp + -72, a2_1016, a4_1018, a5_1019, s2_1025, s5_1233, s6_1002, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_2928, out a0_1250, out a2_1016, out a3_1253, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2929, out s5_2930, out s6_1002, out s7, out s8_1004, out s9_2931, out s10, out s11, out mstatus);
																						s0_101 = a0_1250;
																						if (a0_1250 == 0x00)
																						{
																							word32 s4_2934;
																							word32 s0_2932;
																							word32 s1_2933;
																							Eq_2 a0_1282;
																							Eq_2 a3_1285;
																							Eq_2 ra_1290 = mbedtls_mpi_sub_mpi(ra_1263, a0_1250, fp + -72, a3_1253, a4_1018, a5_1019, s2_1025, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_2932, out s1_2933, out a0_1282, out a2_1016, out a3_1285, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2934, out s8_1004);
																							while (true)
																							{
																								s0_101 = a0_1282;
																								if (a0_1282 != 0x00)
																									break;
																								if (a5_1019 >= 0x00)
																								{
l230638C6:
																									word32 s0_2938;
																									word32 s4_2939;
																									Eq_2 a0_1366;
																									Eq_2 s1_1376;
																									Eq_2 a3_1369;
																									Eq_2 ra_1374 = mbedtls_mpi_sub_mpi(ra_1290, a0_1282, fp + -72, a3_1285, a4_1018, a5_1019, s2_1025, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_2938, out s1_1376, out a0_1366, out a2_1016, out a3_1369, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2939, out s8_1004);
																									while (true)
																									{
																										s0_101 = a0_1366;
																										if (a0_1366 != 0x00)
																											break;
																										if (a5_1019 >= 0x00)
																										{
l230638DC:
																											word32 s0_2943;
																											Eq_2 a0_1450;
																											Eq_2 s1_1460;
																											Eq_2 s4_1463;
																											Eq_2 a3_1453;
																											Eq_2 ra_1458 = mbedtls_mpi_sub_mpi(ra_1374, a0_1366, s1_1376, a3_1369, a4_1018, a5_1019, s2_1025, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_2943, out s1_1460, out a0_1450, out a2_1016, out a3_1453, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_1463, out s8_1004);
																											while (true)
																											{
																												s0_101 = a0_1450;
																												if (a0_1450 != 0x00)
																													break;
																												if (a5_1019 >= 0x00)
																												{
l230638F2:
																													Eq_2 s1_1548;
																													Eq_2 s5_1552;
																													Eq_2 a0_1561;
																													word32 s4_2949;
																													word32 s0_2947;
																													word32 a3_2948;
																													Eq_2 ra_1546 = mbedtls_mpi_mul_mpi(ra_1458, s1_1460, s1_1460, fp + -96, a3_1453, a4_1018, s2_1025, s4_1463, s6_1002, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_2947, out s1_1548, out a0_1561, out a2_1016, out a3_2948, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2949, out s5_1552, out s6_1002, out s8_1004);
																													s0_101 = a0_1561;
																													if (a0_1561 == 0x00)
																													{
																														Eq_2 a0_1584;
																														Eq_2 a3_1587;
																														Eq_2 s1_1591;
																														word32 s5_2951;
																														word32 s9_2952;
																														word32 s4_2950;
																														Eq_2 ra_1597 = ecp_modp(ra_1546, s1_1548, a2_1016, a4_1018, a5_1019, s2_1025, s5_1552, s6_1002, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_1591, out a0_1584, out a2_1016, out a3_1587, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2950, out s5_2951, out s6_1002, out s7, out s8_1004, out s9_2952, out s10, out s11, out mstatus);
																														s0_101 = a0_1584;
																														if (a0_1584 == 0x00)
																														{
																															Eq_2 a0_1616;
																															Eq_2 s1_1626;
																															word32 s0_2953;
																															Eq_2 s4_1629;
																															Eq_2 a3_1619;
																															Eq_2 ra_1624 = mbedtls_mpi_sub_mpi(ra_1597, a0_1584, s1_1591, a3_1587, a4_1018, a5_1019, s2_1025, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_2953, out s1_1626, out a0_1616, out a2_1016, out a3_1619, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_1629, out s8_1004);
																															s0_101 = a0_1616;
																															s7 = s1_1626;
																															if (a0_1616 == 0x00)
																															{
																																do
																																{
																																	if (a5_1019 >= 0x00)
																																	{
l23063928:
																																		Eq_2 s5_1715;
																																		Eq_2 a0_1724;
																																		word32 a3_2959;
																																		word32 s4_2960;
																																		word32 s0_2957;
																																		word32 s1_2958;
																																		Eq_2 ra_1709 = mbedtls_mpi_mul_mpi(ra_1624, fp + -60, s6_1002, (word32) s4_1629 + 24, a3_1619, a4_1018, s2_1025, s4_1629, s6_1002, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_2957, out s1_2958, out a0_1724, out a2_1016, out a3_2959, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2960, out s5_1715, out s6_1002, out s8_1004);
																																		s0_101 = a0_1724;
																																		if (a0_1724 == 0x00)
																																		{
																																			Eq_2 a0_1734;
																																			Eq_2 s5_1752;
																																			word32 s4_2963;
																																			word32 s9_2964;
																																			word32 s1_2961;
																																			word32 a3_2962;
																																			Eq_2 ra_1747 = ecp_modp(ra_1709, fp + -60, a2_1016, a4_1018, a5_1019, s2_1025, s5_1715, s6_1002, s1_1626, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_2961, out a0_1734, out a2_1016, out a3_2962, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2963, out s5_1752, out s6_1002, out s7, out s8_1004, out s9_2964, out s10, out s11, out mstatus);
																																			s0_101 = a0_1734;
																																			if (a0_1734 == 0x00)
																																			{
																																				word32 s4_2969;
																																				word32 a3_2967;
																																				word32 a7_2968;
																																				word32 s0_2965;
																																				word32 s1_2966;
																																				Eq_2 a0_1765;
																																				Eq_2 ra_1773 = mbedtls_mpi_shift_l(ra_1747, (struct Eq_321600 *) 0x01, a2_1016, a4_1018, a5_1019, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s0_2965, out s1_2966, out a0_1765, out a2_1016, out a3_2967, out a4_1018, out a5_1019, out a7_2968, out s2_1025, out s3_1026, out s4_2969, out s8_1004);
																																				while (true)
																																				{
																																					s0_101 = a0_1765;
																																					if (a0_1765 != 0x00)
																																						break;
																																					Eq_2 a2_1798;
																																					Eq_2 a3_1799;
																																					Eq_2 a4_1800;
																																					Eq_2 a5_1801;
																																					word32 a6_2971;
																																					word32 a1_2970;
																																					if (mbedtls_mpi_cmp_mpi(a2_1016, a4_1018, a5_1019, out a1_2970, out a2_1798, out a3_1799, out a4_1800, out a5_1801, out a6_2971) < 0x00)
																																					{
																																						Eq_2 a0_1834;
																																						Eq_2 a3_1842;
																																						word32 s4_2983;
																																						word32 a6_2981;
																																						word32 a7_2982;
																																						word32 s1_2979;
																																						word32 a1_2980;
																																						word32 s0_2978;
																																						Eq_2 ra_1846 = mbedtls_mpi_copy(ra_1773, s5_1752, fp + -72, a2_1798, a3_1799, a4_1800, a5_1801, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s0_2978, out s1_2979, out a0_1834, out a1_2980, out a2_1016, out a3_1842, out a4_1018, out a5_1019, out a6_2981, out a7_2982, out s2_1025, out s3_1026, out s4_2983, out s8_1004);
																																						s0_101 = a0_1834;
																																						if (a0_1834 == 0x00)
																																						{
																																							Eq_2 a0_1859;
																																							Eq_2 a3_1867;
																																							word32 a7_2988;
																																							word32 s4_2989;
																																							word32 a6_2987;
																																							word32 s1_2985;
																																							word32 a1_2986;
																																							word32 s0_2984;
																																							Eq_2 ra_1871 = mbedtls_mpi_copy(ra_1846, (word32) s5_1752 + 0x0C, fp + -84, a2_1016, a3_1842, a4_1018, a5_1019, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s0_2984, out s1_2985, out a0_1859, out a1_2986, out a2_1016, out a3_1867, out a4_1018, out a5_1019, out a6_2987, out a7_2988, out s2_1025, out s3_1026, out s4_2989, out s8_1004);
																																							s0_101 = a0_1859;
																																							if (a0_1859 == 0x00)
																																							{
																																								Eq_2 a0_1884;
																																								word32 a6_2994;
																																								word32 a7_2995;
																																								word32 s4_2996;
																																								word32 s0_2990;
																																								word32 s1_2991;
																																								word32 a1_2992;
																																								word32 a3_2993;
																																								mbedtls_mpi_copy(ra_1871, (word32) s5_1752 + 24, fp + -60, a2_1016, a3_1867, a4_1018, a5_1019, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s0_2990, out s1_2991, out a0_1884, out a1_2992, out a2_1016, out a3_2993, out a4_1018, out a5_1019, out a6_2994, out a7_2995, out s2_1025, out s3_1026, out s4_2996, out s8_1004);
																																								s0_101 = a0_1884;
																																							}
																																						}
																																						break;
																																					}
																																					word32 a7_2976;
																																					word32 s4_2977;
																																					word32 a3_2975;
																																					word32 a1_2974;
																																					word32 s1_2973;
																																					word32 s0_2972;
																																					ra_1773 = mbedtls_mpi_sub_abs(ra_1773, fp + -60, fp + -60, s3_1026, a3_1799, a4_1800, a5_1801, mstatus, dwArg58, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out s0_2972, out s1_2973, out a0_1765, out a1_2974, out a2_1016, out a3_2975, out a4_1018, out a5_1019, out a7_2976, out s2_1025, out s3_1026, out s4_2977, out s8_1004);
																																				}
																																			}
																																		}
																																		break;
																																	}
																																	Eq_2 a5_1652;
																																	word32 a6_2956;
																																	word32 a2_2955;
																																	word32 a1_2954;
																																	if (mbedtls_mpi_cmp_int(0x00, dwArg84, out a1_2954, out a2_2955, out a3_1619, out a4_1018, out a5_1652, out a6_2956) == 0x00)
																																		goto l23063928;
																																	Eq_2 a0_1663;
																																	word32 a7_3000;
																																	word32 s0_2997;
																																	word32 s1_2998;
																																	word32 a1_2999;
																																	ra_1624 = mbedtls_mpi_add_mpi(ra_1624, s0_101, s1_1626, a3_1619, a4_1018, a5_1652, s2_1025, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_2997, out s1_2998, out a0_1663, out a1_2999, out a2_1016, out a3_1619, out a4_1018, out a5_1019, out a7_3000, out s2_1025, out s3_1026, out s4_1629, out s8_1004);
																																	s0_101 = a0_1663;
																																} while (a0_1663 == 0x00);
																															}
																														}
																													}
																													break;
																												}
																												Eq_2 a5_1486;
																												word32 a2_2945;
																												word32 a6_2946;
																												word32 a1_2944;
																												if (mbedtls_mpi_cmp_int(0x00, dwArg84, out a1_2944, out a2_2945, out a3_1453, out a4_1018, out a5_1486, out a6_2946) == 0x00)
																													goto l230638F2;
																												word32 s0_3001;
																												word32 a1_3002;
																												word32 a7_3003;
																												ra_1458 = mbedtls_mpi_add_mpi(ra_1458, a0_1450, s1_1460, a3_1453, a4_1018, a5_1486, s2_1025, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_3001, out s1_1460, out a0_1450, out a1_3002, out a2_1016, out a3_1453, out a4_1018, out a5_1019, out a7_3003, out s2_1025, out s3_1026, out s4_1463, out s8_1004);
																											}
																											break;
																										}
																										word32 a1_2940;
																										word32 a2_2941;
																										word32 a6_2942;
																										if (mbedtls_mpi_cmp_int(0x00, a2_1016, out a1_2940, out a2_2941, out a3_1369, out a4_1018, out a5_1019, out a6_2942) == 0x00)
																											goto l230638DC;
																										word32 a7_3006;
																										word32 s4_3007;
																										word32 s0_3004;
																										word32 a1_3005;
																										ra_1374 = mbedtls_mpi_add_mpi(ra_1374, a0_1366, fp + -72, a3_1369, a4_1018, a5_1019, s2_1025, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_3004, out s1_1376, out a0_1366, out a1_3005, out a2_1016, out a3_1369, out a4_1018, out a5_1019, out a7_3006, out s2_1025, out s3_1026, out s4_3007, out s8_1004);
																									}
																									break;
																								}
																								word32 a1_2935;
																								word32 a2_2936;
																								word32 a6_2937;
																								if (mbedtls_mpi_cmp_int(0x00, a2_1016, out a1_2935, out a2_2936, out a3_1285, out a4_1018, out a5_1019, out a6_2937) == 0x00)
																									goto l230638C6;
																								word32 s4_3012;
																								word32 s0_3008;
																								word32 s1_3009;
																								word32 a1_3010;
																								word32 a7_3011;
																								ra_1290 = mbedtls_mpi_add_mpi(ra_1290, a0_1282, fp + -72, a3_1285, a4_1018, a5_1019, s2_1025, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_3008, out s1_3009, out a0_1282, out a1_3010, out a2_1016, out a3_1285, out a4_1018, out a5_1019, out a7_3011, out s2_1025, out s3_1026, out s4_3012, out s8_1004);
																							}
																						}
																					}
																					break;
																				}
																				word32 a7_2923;
																				word32 a3_2922;
																				word32 s1_2920;
																				word32 a1_2921;
																				word32 s0_2919;
																				ra_1156 = mbedtls_mpi_sub_abs(ra_1156, fp + -60, fp + -60, s3_1026, a3_1182, a4_1183, a5_1184, mstatus, dwArg58, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out s0_2919, out s1_2920, out a0_1148, out a1_2921, out a2_1016, out a3_2922, out a4_1018, out a5_1019, out a7_2923, out s2_1025, out s3_1026, out s4_1161, out s8_1004);
																			}
																		}
																	}
																	break;
																}
																word32 a1_2900;
																word32 a7_2902;
																word32 a3_2901;
																word32 s0_2899;
																ra_1022 = mbedtls_mpi_sub_abs(ra_1022, s1_1024, s1_1024, s3_1026, a3_1048, a4_1049, a5_1050, mstatus, dwArg58, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out s0_2899, out s1_1024, out a0_1014, out a1_2900, out a2_1016, out a3_2901, out a4_1018, out a5_1019, out a7_2902, out s2_1025, out s3_1026, out s4_1027, out s8_1004);
															}
														}
													}
													break;
												}
												Eq_2 a0_923;
												word32 a7_2884;
												word32 a1_2882;
												word32 a3_2883;
												word32 s0_2881;
												ra_887 = mbedtls_mpi_sub_abs(ra_887, fp + -72, fp + -72, s3_1026, a3_913, a4_914, a5_915, mstatus, dwArg58, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out s0_2881, out s1_889, out a0_923, out a1_2882, out a2_1016, out a3_2883, out a4_1018, out a5_1019, out a7_2884, out s2_1025, out s3_1026, out s4_892, out s8_1004);
												s0_101 = a0_923;
											} while (a0_923 == 0x00);
										}
									}
								}
							}
							break;
						}
						Eq_2 a0_151;
						word32 a1_2800;
						word32 s0_2799;
						word32 a7_2802;
						word32 a3_2801;
						ra_113 = mbedtls_mpi_sub_abs(ra_113, fp + -96, fp + -96, s3_1026, a3_141, a4_142, a5_143, mstatus, dwArg58, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out s0_2799, out s1_115, out a0_151, out a1_2800, out a2_1016, out a3_2801, out a4_1018, out a5_1019, out a7_2802, out s2_1025, out s3_1026, out s4_118, out s8_1004);
						s0_101 = a0_151;
					} while (a0_151 == 0x00);
				}
			}
		}
	}
	Eq_2 a2_1916;
	Eq_2 a5_1917;
	Eq_2 a4_1920;
	Eq_2 a2_1928;
	Eq_2 a5_1929;
	Eq_2 a4_1932;
	word32 s4_2768;
	word32 a6_2767;
	word32 a3_2766;
	word32 a1_2765;
	word32 s4_2763;
	word32 a3_2761;
	word32 a1_2760;
	word32 a0_2759;
	word32 a0_2764;
	word32 a6_2762;
	mbedtls_mpi_free(mbedtls_mpi_free(fp + -96, a2_1016, a4_1018, a5_1019, mstatus, dwArgE8, dwArg0128, out a0_2759, out a1_2760, out a2_1916, out a3_2761, out a4_1920, out a5_1917, out a6_2762, out s4_2763), a2_1916, a4_1920, a5_1917, mstatus, dwArgE8, dwArg0128, out a0_2764, out a1_2765, out a2_1928, out a3_2766, out a4_1932, out a5_1929, out a6_2767, out s4_2768);
	Eq_2 a2_1940;
	Eq_2 a5_1941;
	Eq_2 a4_1944;
	word32 s4_2773;
	word32 a1_2770;
	word32 a0_2769;
	word32 a3_2771;
	word32 a6_2772;
	mbedtls_mpi_free(fp + -72, a2_1928, a4_1932, a5_1929, mstatus, dwArgE8, dwArg0128, out a0_2769, out a1_2770, out a2_1940, out a3_2771, out a4_1944, out a5_1941, out a6_2772, out s4_2773);
	Eq_330336 a2_1952;
	Eq_330339 a5_1953;
	Eq_330338 a4_1956;
	ptr32 a6_1957;
	ptr32 s4_1959;
	word32 a3_2776;
	word32 a0_2774;
	word32 a1_2775;
	mbedtls_mpi_free(fp + -60, a2_1940, a4_1944, a5_1941, mstatus, dwArgE8, dwArg0128, out a0_2774, out a1_2775, out a2_1952, out a3_2776, out a4_1956, out a5_1953, out a6_1957, out s4_1959);
	s1Out = dwArg28;
	a0Out = s0_101;
	a2Out = a2_1952;
	a3Out = dwArg08;
	a4Out = a4_1956;
	a5Out = a5_1953;
	a6Out = a6_1957;
	s2Out = s2_1025;
	s3Out = s3_1026;
	s4Out = s4_1959;
	s5Out = s4;
	s6Out = s6_1002;
	s7Out = s7;
	s8Out = s8_1004;
	s9Out = dwLoc5C;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return dwArg68;
}

