pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23063E94: void mbedtls_ecp_group_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      mbedtls_ecp_keypair_init
void mbedtls_ecp_group_init(Eq_2 ra, Eq_2 a0)
{
	if (a0 == 0x00)
		return;
	word32 t1_33;
	word32 a0_34;
	word32 a1_35;
	word32 a2_36;
	word32 a3_37;
	word32 a4_38;
	word32 a5_39;
	memset(ra, a0, 0x00, 0x007C, out t1_33, out a0_34, out a1_35, out a2_36, out a3_37, out a4_38, out a5_39);
}

// 23063EA2: void mbedtls_ecp_keypair_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      eckey_alloc_wrap
void mbedtls_ecp_keypair_init(Eq_2 ra, Eq_2 a0)
{
	if (a0 == 0x00)
		return;
	mbedtls_ecp_group_init(ra, a0);
	mbedtls_mpi_init((word32) a0 + 0x007C);
	mbedtls_ecp_point_init((word32) a0 + 0x0088);
}

// 23063EC8: Register word32 mbedtls_ecp_point_free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_333476 s4Out)
// Called from:
//      mbedtls_ecp_group_free
//      mbedtls_ecp_keypair_free
//      mbedtls_ecp_mul
word32 mbedtls_ecp_point_free(Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0178, Eq_2 dwArg0188, union Eq_2 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_333476 & s4Out)
{
	if (a0 == 0x00)
	{
		a0Out = a0;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s4Out = s4;
		return s1;
	}
	else
	{
		Eq_2 a0_9;
		Eq_2 a2_11;
		ptr32 a3_12;
		Eq_2 a4_13;
		Eq_2 a5_14;
		Eq_333476 s4_17;
		word32 s1_16 = mbedtls_ecp_point_free.part.4(a0, a2, a4, a5, mstatus, dwArg10, dwArg0138, dwArg0148, dwArg0178, dwArg0188, out a0_9, out a2_11, out a3_12, out a4_13, out a5_14, out s4_17);
		a0Out = a0_9;
		a2Out = a2_11;
		a3Out = a3_12;
		a4Out = a4_13;
		a5Out = a5_14;
		s4Out = s4_17;
		return s1_16;
	}
}

// 23063ED0: Register Eq_2 mbedtls_ecp_group_free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out (ptr32 byte) a5Out, Register out Eq_333515 s2Out)
// Called from:
//      mbedtls_ecp_keypair_free
//      mbedtls_ecp_check_pub_priv
//      mbedtls_ecp_group_load
Eq_2 mbedtls_ecp_group_free(Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg38, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188, ptr32 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, byte & a5Out, union Eq_333515 & s2Out)
{
	if (a0 == 0x00)
	{
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		return s1;
	}
	else
	{
		Eq_2 a0_136 = *((word32) a4 + 96);
		Eq_2 a5_103 = 0x01;
		if (a4 != 0x01)
		{
			Eq_2 a2_21;
			Eq_2 a5_22;
			Eq_2 a4_25;
			word32 a0_234;
			word32 a1_235;
			word32 a3_236;
			word32 a6_237;
			word32 s4_238;
			mbedtls_mpi_free((word32) a0_136 + 4, a2, a4, 0x01, mstatus, dwArg0138, dwArg0178, out a0_234, out a1_235, out a2_21, out a3_236, out a4_25, out a5_22, out a6_237, out s4_238);
			Eq_2 a2_33;
			Eq_2 a5_34;
			Eq_2 a4_37;
			word32 a0_239;
			word32 a1_240;
			word32 a3_241;
			word32 a6_242;
			word32 s4_243;
			mbedtls_mpi_free((word32) a0_136 + 16, a2_21, a4_25, a5_22, mstatus, dwArg0138, dwArg0178, out a0_239, out a1_240, out a2_33, out a3_241, out a4_37, out a5_34, out a6_242, out s4_243);
			Eq_2 a2_45;
			Eq_2 a5_46;
			Eq_2 a4_49;
			word32 a0_244;
			word32 a1_245;
			word32 a3_246;
			word32 a6_247;
			word32 s4_248;
			mbedtls_mpi_free((word32) a0_136 + 28, a2_33, a4_37, a5_34, mstatus, dwArg0138, dwArg0178, out a0_244, out a1_245, out a2_45, out a3_246, out a4_49, out a5_46, out a6_247, out s4_248);
			Eq_2 a2_58;
			Eq_2 a4_60;
			Eq_2 a5_61;
			word32 a0_249;
			word32 a3_250;
			word32 s4_251;
			mbedtls_ecp_point_free((word32) a0_136 + 40, a2_45, a4_49, a5_46, mstatus, dwArg00, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a0_249, out a2_58, out a3_250, out a4_60, out a5_61, out s4_251);
			word32 a6_252;
			word32 s4_253;
			mbedtls_mpi_free((word32) a0_136 + 76, a2_58, a4_60, a5_61, mstatus, dwArg0138, dwArg0178, out a0_136, out a1, out a2, out a3, out a4, out a5_103, out a6_252, out s4_253);
		}
		byte * s0_118 = *((word32) a5_103 + 116);
		Eq_2 s1_105 = 0x00;
		if (a5_103 != 0x00)
		{
			while (s1_105 < a5_103)
			{
				Eq_2 a5_91 = (word32) s1_105 + 36;
				word32 a3_254;
				word32 s4_255;
				s1_105 = mbedtls_ecp_point_free(a0_136 + a5_91, a2, a4, a5_91, mstatus, dwArg00, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a0_136, out a2, out a3_254, out a4, out a5_103, out s4_255);
			}
			word32 a0_256;
			word32 a2_257;
			word32 a5_258;
			word32 a6_259;
			word32 s4_260;
			word32 t3_261;
			vPortFree(a0_136, a2, a5_103, mstatus, dwArg0148, dwArg0188, out s0_118, out s1_105, out a0_256, out a1, out a2_257, out a3, out a4, out a5_258, out a6_259, out s4_260, out t3_261);
		}
		byte * a5_122 = s0_118 + 0x007C;
		for (; s0_118 != a5_122; ++s0_118)
			*s0_118 = 0x00;
		0x00 = (uint16) dwArg38;
		a1Out = a1;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_122;
		s2Out.u0 = 36;
		return s1_105;
	}
}

// 23063F4E: Register Eq_2 mbedtls_ecp_keypair_free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out)
// Called from:
//      pk_parse_key_sec1_der
//      eckey_free_wrap
Eq_2 mbedtls_ecp_keypair_free(Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg28, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		return s1;
	}
	else
	{
		Eq_2 a2_15;
		Eq_2 a4_17;
		Eq_2 a5_18;
		ptr32 s2_21;
		word32 a1_92;
		word32 a3_93;
		mbedtls_ecp_group_free(a0, a2, a4, mstatus, dwLoc10, dwArg28, dwArg0118, dwArg0128, dwArg0138, dwArg0158, dwArg0168, dwArg0178, out a1_92, out a2_15, out a3_93, out a4_17, out a5_18, out s2_21);
		Eq_2 a5_28;
		Eq_2 a4_31;
		word32 a0_94;
		word32 a1_95;
		word32 a2_96;
		word32 a3_97;
		word32 a6_98;
		word32 s4_99;
		mbedtls_mpi_free((word32) a0 + 0x007C, a2_15, a4_17, a5_18, mstatus, dwArg0138, dwArg0178, out a0_94, out a1_95, out a2_96, out a3_97, out a4_31, out a5_28, out a6_98, out s4_99);
		ptr32 a3_44;
		Eq_2 a4_45;
		ptr32 a5_46;
		word32 a0_100;
		word32 a2_101;
		word32 s4_102;
		Eq_2 s1_48 = mbedtls_ecp_point_free((word32) a0 + 0x0088, dwArg10, a4_31, a5_28, mstatus, dwArg10, dwArg0138, dwArg0148, dwArg0178, dwArg0188, out a0_100, out a2_101, out a3_44, out a4_45, out a5_46, out s4_102);
		a3Out = a3_44;
		a4Out = a4_45;
		a5Out = a5_46;
		s2Out = s2_21;
		return s1_48;
	}
}

