pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23063F74: Register Eq_2 mbedtls_ecp_copy(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      ecp_add_mixed
//      mbedtls_ecp_mul
Eq_2 mbedtls_ecp_copy(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 a2_20;
	word32 s0_32;
	word32 a1_168;
	word32 a7_169;
	ptr32 a0_116;
	Eq_2 a3_121;
	Eq_2 a4_123;
	Eq_2 a5_125;
	ptr32 a6_127;
	ptr32 s1_134;
	ptr32 s2_136;
	ptr32 s3_138;
	ptr32 s4_140;
	ptr32 s8_142;
	Eq_2 ra_131 = mbedtls_mpi_copy(ra, a0, a1, a2, a3, a4, a5, mstatus, dwArg08, dwArgD8, dwArg0118, dwArg0158, out s0_32, out s1_134, out a0_116, out a1_168, out a2_20, out a3_121, out a4_123, out a5_125, out a6_127, out a7_169, out s2_136, out s3_138, out s4_140, out s8_142);
	if (a0_116 == 0x00)
	{
		word32 s0_56;
		word32 a1_170;
		word32 a2_171;
		word32 a7_172;
		ra_131 = mbedtls_mpi_copy(ra_131, s0_32 + 0x0C, s1_134 + 0x0C, a2_20, a3_121, a4_123, a5_125, mstatus, dwArg08, dwArgD8, dwArg0118, dwArg0158, out s0_56, out s1_134, out a0_116, out a1_170, out a2_171, out a3_121, out a4_123, out a5_125, out a6_127, out a7_172, out s2_136, out s3_138, out s4_140, out s8_142);
		if (a0_116 == 0x00)
		{
			ptr32 a0_77;
			Eq_2 a2_78;
			ptr32 a6_79;
			ptr32 s3_80;
			ptr32 s4_81;
			ptr32 s8_82;
			Eq_2 a3_85;
			Eq_2 a4_86;
			Eq_2 a5_87;
			ptr32 s1_91;
			ptr32 s2_92;
			word32 s0_173;
			word32 a1_174;
			word32 a7_175;
			Eq_2 ra_89 = mbedtls_mpi_copy(ra_131, s0_56 + 24, s1_134 + 24, dwArg10, a3_121, a4_123, a5_125, mstatus, dwArg18, dwArgE8, dwArg0128, dwArg0168, out s0_173, out s1_91, out a0_77, out a1_174, out a2_78, out a3_85, out a4_86, out a5_87, out a6_79, out a7_175, out s2_92, out s3_80, out s4_81, out s8_82);
			s1Out = s1_91;
			a0Out = a0_77;
			a2Out = a2_78;
			a3Out = a3_85;
			a4Out = a4_86;
			a5Out = a5_87;
			a6Out = a6_79;
			s2Out = s2_92;
			s3Out = s3_80;
			s4Out = s4_81;
			s8Out = s8_82;
			return ra_89;
		}
	}
	s1Out = s1_134;
	a0Out = a0_116;
	a2Out = dwArg10;
	a3Out = a3_121;
	a4Out = a4_123;
	a5Out = a5_125;
	a6Out = a6_127;
	s2Out = s2_136;
	s3Out = s3_138;
	s4Out = s4_140;
	s8Out = s8_142;
	return ra_131;
}

// 23063FB2: Register word32 mbedtls_ecp_group_copy(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      mbedtls_ecp_check_pub_priv
word32 mbedtls_ecp_group_copy(Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s4Out)
{
	ptr32 s1_18;
	ptr32 s2_19;
	ptr32 s4_20;
	word32 a0_35;
	word32 a1_36;
	word32 a2_37;
	word32 a3_38;
	word32 a4_39;
	word32 a5_40;
	word32 s0_17 = mbedtls_ecp_group_load(a0, a2, a4, mstatus, dwArg18, dwArg44, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0158, dwArg0168, out s1_18, out a0_35, out a1_36, out a2_37, out a3_38, out a4_39, out a5_40, out s2_19, out s4_20);
	s1Out = s1_18;
	s2Out = s2_19;
	s4Out = s4_20;
	return s0_17;
}

// 23063FBA: Register Eq_2 mbedtls_ecp_set_zero(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_333918 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      ecp_add_mixed
//      mbedtls_ecp_point_read_binary
Eq_2 mbedtls_ecp_set_zero(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_333918 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	word32 a2_157;
	word32 a7_158;
	ptr32 a1_106;
	Eq_2 a3_109;
	Eq_2 a4_111;
	Eq_333918 a5_113;
	ptr32 s1_122;
	ptr32 s2_124;
	ptr32 s3_126;
	ptr32 s4_128;
	ptr32 s8_130;
	Eq_2 ra_119 = mbedtls_mpi_lset(ra, a3, a4, mstatus, dwLoc10, s0, dwArg18, dwArg28, dwArgE8, dwArg0128, dwArg0168, out s1_122, out a1_106, out a2_157, out a3_109, out a4_111, out a5_113, out a7_158, out s2_124, out s3_126, out s4_128, out s8_130);
	if (a0 == 0x00)
	{
		a0 = (word32) a0 + 0x0C;
		word32 a2_159;
		word32 a7_160;
		ra_119 = mbedtls_mpi_lset(ra_119, a3_109, a4_111, mstatus, dwLoc10, s0, dwArg18, dwArg28, dwArgE8, dwArg0128, dwArg0168, out s1_122, out a1_106, out a2_159, out a3_109, out a4_111, out a5_113, out a7_160, out s2_124, out s3_126, out s4_128, out s8_130);
		if (a0 == 0x0C)
		{
			ptr32 a1_66;
			ptr32 a2_67;
			Eq_2 a3_68;
			Eq_2 a4_69;
			Eq_333918 a5_70;
			ptr32 s1_74;
			ptr32 s2_75;
			ptr32 s3_76;
			ptr32 s4_77;
			ptr32 s8_78;
			word32 a7_161;
			Eq_2 ra_73 = mbedtls_mpi_lset(ra_119, a3_109, a4_111, mstatus, dwArg00, dwArg04, dwArg28, dwArg38, dwArgF8, dwArg0138, dwArg0178, out s1_74, out a1_66, out a2_67, out a3_68, out a4_69, out a5_70, out a7_161, out s2_75, out s3_76, out s4_77, out s8_78);
			s1Out = s1_74;
			a0Out = (word32) a0 + 24;
			a1Out = a1_66;
			a2Out = a2_67;
			a3Out = a3_68;
			a4Out = a4_69;
			a5Out = a5_70;
			s2Out = s2_75;
			s3Out = s3_76;
			s4Out = s4_77;
			s8Out = s8_78;
			return ra_73;
		}
	}
	s1Out = s1_122;
	a0Out = a0;
	a1Out = a1_106;
	a2Out = dwArg10;
	a3Out = a3_109;
	a4Out = a4_111;
	a5Out = a5_113;
	s2Out = s2_124;
	s3Out = s3_126;
	s4Out = s4_128;
	s8Out = s8_130;
	return ra_119;
}

