pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23064D38: void ecp_mod_p224k1(Register Eq_2 ra, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128)
void ecp_mod_p224k1(Eq_2 ra, Eq_2 a5, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0128)
{
	ecp_mod_koblitz.constprop.0(ra, 0x07, a5, s4, s6, mstatus, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0128);
}

// 23064D46: void ecp_mod_p256k1(Register Eq_2 ra, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128)
void ecp_mod_p256k1(Eq_2 ra, Eq_2 a5, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0128)
{
	ecp_mod_koblitz.constprop.0(ra, 0x08, a5, s4, s6, mstatus, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0128);
}

// 23064D54: Register Eq_2 mbedtls_ecp_group_load(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      pk_use_ecparams
//      mbedtls_ecp_group_copy
Eq_2 mbedtls_ecp_group_load(Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s4Out)
{
	ptr32 s1_111;
	ptr32 a1_105;
	ptr32 a0_117;
	ptr32 a3_107;
	ptr32 a2_106;
	ptr32 a5_109;
	ptr32 a4_108;
	Eq_2 a4_134;
	struct Eq_338179 * a5_101;
	word32 a1_18;
	Eq_2 a4_21;
	word32 a2_225;
	word32 a3_226;
	word32 a5_227;
	ptr32 s2_112;
	mbedtls_ecp_group_free(a0, a2, a4, mstatus, dwLoc20, dwArg18, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0158, dwArg0168, out a1_18, out a2_225, out a3_226, out a4_21, out a5_227, out s2_112);
	a0->u1 = (byte) a1_18;
	if (a1_18 != 11)
	{
		if (a1_18 != 0x0C)
		{
			if (a1_18 != 0x03)
			{
				s1_111 = mbedtls_ecp_group_free(a0, dwArg44, a4_21, mstatus, dwLoc20, dwArg18, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0158, dwArg0168, out a1_105, out a2_106, out a3_107, out a4_108, out a5_109, out s2_112);
				a0_117 = 0xFB000180;
				goto l23064DEC;
			}
			g_t2308B274 = a0;
			g_t2308B20C = a0;
			g_t2308B29C = a0;
			*(union Eq_2 *) 0x10 = a0;
			*(union Eq_2 *) 0x28 = a0;
			*(union Eq_2 *) 88 = a0;
			*(union Eq_2 *) 0x34 = a0;
			*(union Eq_2 *) 0x40 = a0;
			*(union Eq_2 *) 0x05 = a0;
			*(union Eq_2 *) 0x1D = a0;
			*(union Eq_2 *) 77 = a0;
			*(union Eq_2 *) 0x29 = a0;
			g_t2308B238 = a0;
			*(union Eq_2 *) 0x35 = a0;
			a4_134.u0 = 0x2308B208;
			a5_101 = &g_t2308B228;
		}
		else
		{
			g_t2308B1D4 = a0;
			g_t2308DEE0 = a0;
			g_t2308DEF0 = a0;
			g_t23064DAA = a0;
			g_t2308B1FC = a0;
			*(union Eq_2 *) 0x10 = a0;
			*(union Eq_2 *) 88 = a0;
			*(union Eq_2 *) 0x34 = a0;
			*(union Eq_2 *) 0x40 = a0;
			*(union Eq_2 *) 0x05 = a0;
			*(union Eq_2 *) 0x11 = a0;
			*(union Eq_2 *) 0x15 = a0;
			*(union Eq_2 *) 0x1D = a0;
			*(union Eq_2 *) 33 = a0;
			*(union Eq_2 *) 77 = a0;
			*(union Eq_2 *) 0x29 = a0;
			g_t2308B198 = a0;
			*(union Eq_2 *) 0x35 = a0;
			a4_134.u0 = 587772264;
			a5_101 = &g_t2308B188;
		}
	}
	else
	{
		g_t2308B158 = a0;
		g_t2308DED8 = a0;
		g_t2308DEE8 = a0;
		*(union Eq_2 *) 88 = a0;
		g_t23064D9C = a0;
		g_t2308B180 = a0;
		*(union Eq_2 *) 0x0F = a0;
		*(union Eq_2 *) 0x33 = a0;
		*(union Eq_2 *) 0x3F = a0;
		*(union Eq_2 *) 0x05 = a0;
		*(union Eq_2 *) 0x11 = a0;
		*(union Eq_2 *) 0x15 = a0;
		*(union Eq_2 *) 0x1D = a0;
		*(union Eq_2 *) 33 = a0;
		*(union Eq_2 *) 77 = a0;
		*(union Eq_2 *) 0x29 = a0;
		g_t2308B124 = a0;
		*(union Eq_2 *) 0x35 = a0;
		a4_134.u0 = 587772148;
		a5_101 = &g_t2308B110;
	}
	a5_101->t003C = a0;
	g_t4200D9D8 = a0;
	*(union Eq_2 *) 0x41 = a0;
	*(union Eq_2 *) 0x45 = a0;
	Eq_2 a2_158;
	Eq_2 a4_160;
	Eq_2 a5_161;
	word32 a1_228;
	word32 a3_229;
	mbedtls_mpi_bitlen(dwArg44, a4_134, 0x4200D990, out a1_228, out a2_158, out a3_229, out a4_160, out a5_161)->t0058 = a0;
	mbedtls_mpi_bitlen(a2_158, a4_160, a5_161, out a1_105, out a2_106, out a3_107, out a4_108, out a5_109)->t005C = a0;
	*(union Eq_2 *) 0x61 = a0;
	s1_111 = 0x01;
	a0_117 = 0x00;
l23064DEC:
	s1Out = s1_111;
	a0Out = a0_117;
	a1Out = a1_105;
	a2Out = a2_106;
	a3Out = a3_107;
	a4Out = a4_108;
	a5Out = a5_109;
	s2Out = s2_112;
	s4Out = dwArg04;
	return a0;
}

Eq_2 g_t23064D9C = 
	{
		~0x48C8
	};
Eq_2 g_t23064DAA = 
	{
		1811
	};
// 23064ECA: Register word32 gcm_mult(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out Eq_338366 s1Out, Register out Eq_338367 a1Out, Register out Eq_2 a5Out, Register out Eq_338369 a7Out, Register out Eq_338370 s2Out)
// Called from:
//      mbedtls_cipher_auth_encrypt
//      mbedtls_gcm_starts
//      mbedtls_gcm_update
word32 gcm_mult(Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, union Eq_338366 & s1Out, union Eq_338367 & a1Out, union Eq_2 & a5Out, union Eq_338369 & a7Out, union Eq_338370 & s2Out)
{
	struct Eq_338371 * a3_17 = (word32) a0 + (((word32) (*((word32) a1 + 0x0F)) & 0x0F) << 3);
	int32 t3_13;
	Eq_338383 t1_18 = a3_17->t00C0;
	Eq_338387 a4_19 = a3_17->t00C4;
	uint32 a3_101 = *((word32) *((word32) a5 + 64) + 0x0044);
	for (t3_13 = 0x0F; t3_13 != ~0x00; t3_13 += ~0x00)
	{
		uint32 a6_35 = (word32) *((word32) a1 + t3_13);
		int32 t5_36 = g_a2308B288[a5 & 0x0F];
		ui32 s0_42 = a5 >> 0x04 | a3_101 << 0x1C;
		ui32 t4_46 = t1_18 << 0x1C | a3_101 >> 0x04;
		Eq_338366 s1_49 = a4_19 << 0x1C | t1_18 >> 0x04;
		Eq_338370 s2_52 = a4_19 >> 0x04;
		if (t3_13 != 0x0F)
		{
			struct Eq_338452 * a3_56 = (word32) a0 + ((a6_35 & 0x0F) << 0x03);
			struct Eq_338458 * a5_58 = t5_36 << 16 ^ s2_52;
			a4_19 = a3_56->dw00C4 ^ a5_58;
			t1_18 = a3_56->dw00C0 ^ s1_49;
			a5 = a5_58 ^ s0_42;
			a3_101 = a5_58->ptr0040->dw0044 ^ t4_46;
		}
		struct Eq_338398 * a6_75 = (word32) a0 + ((a6_35 >> 0x04) << 3);
		Eq_338369 a7_76 = a3_101 << 0x1C | a5 >> 0x04;
		a4_19 = a6_75->dw00C4 ^ a4_19 >> 0x04 ^ g_a2308B288[a5 & 0x0F] << 16;
		t1_18 = a6_75->dw00C0 ^ (a4_19 << 0x1C | t1_18 >> 0x04);
		a5 = a6_75->dw0040 ^ a7_76;
		a3_101 = a6_75->dw0044 ^ (t1_18 << 0x1C | a3_101 >> 4);
	}
	a2->u1 = (byte) (a4_19 >> 0x18);
	((word32) a2 + 1)->u1 = (byte) (a4_19 >> 0x10);
	*((word32) a2 + 3) = (byte) a4_19;
	((word32) a2 + 4)->u1 = (byte) (t1_18 >> 0x18);
	((word32) a2 + 5)->u1 = (byte) (t1_18 >> 0x10);
	*((word32) a2 + 6) = (byte) (t1_18 >> 0x08);
	((word32) a2 + 8)->u1 = (byte) (a3_101 >> 0x18);
	((word32) a2 + 9)->u1 = (byte) (a3_101 >> 0x10);
	((word32) a2 + 0x0A)->u1 = (byte) (a3_101 >> 0x08);
	((word32) a2 + 0x0C)->u1 = (byte) (a5 >> 0x18);
	*((word32) s1 + 0x0D) = (byte) (a5 >> 0x10);
	((word32) s1 + 2)->u1 = (byte) (a4_19 >> 0x08);
	*((word32) s1 + 7) = (byte) t1_18;
	((word32) s1 + 11)->u1 = (byte) a3_101;
	*((word32) s1 + 0x0E) = (byte) (a5 >> 0x08);
	((word32) s1 + 0x0F)->u1 = (byte) a5;
	s1Out = s1_49;
	a1Out = a4_19 >> 0x08;
	a5Out = a5;
	a7Out = a7_76;
	s2Out = s2_52;
	return dwArg14;
}

// 23065036: void mbedtls_gcm_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      gcm_ctx_alloc
void mbedtls_gcm_init(Eq_2 ra, Eq_2 a0)
{
	word32 t1_16;
	word32 a0_17;
	word32 a1_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	memset(ra, a0, 0x00, 0x0188, out t1_16, out a0_17, out a1_18, out a2_19, out a3_20, out a4_21, out a5_22);
}

// 23065040: void mbedtls_gcm_setkey(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_295827) a1, Register (ptr32 Eq_295827) a3, Register (ptr32 Eq_295827) a5, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE8)
// Called from:
//      gcm_aes_setkey_wrap
void mbedtls_gcm_setkey(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_295827 * a1, struct Eq_295827 * a3, struct Eq_295827 * a5, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgE8)
{
	word32 a4_25;
	if (mbedtls_cipher_info_from_values(a1, a3, (struct Eq_295827 *) 0x01, a3, a5, out a4_25) != 0x00 && a4_25 == 0x10)
	{
		word32 a5_354;
		mbedtls_cipher_free(ra, a0, 0x10, out a5_354);
		word32 a0_38;
		struct Eq_296137 * a4_43;
		struct Eq_296138 * a5_44;
		struct Eq_295827 * s1_46;
		Eq_2 ra_45 = mbedtls_cipher_setup(ra, a0, a3, out s1_46, out a0_38, out a4_43, out a5_44);
		if (a0_38 == 0x00)
		{
			word32 a4_355;
			word32 a5_356;
			if (mbedtls_cipher_setkey(a0, s1_46, 0x01, a4_43, a5_44, out a4_355, out a5_356) == 0x00)
			{
				Eq_2 a5_68;
				word32 a0_80;
				struct Eq_338658 * s0_83;
				word32 s6_372;
				word32 s7_373;
				word32 s8_374;
				word32 s3_369;
				word32 s4_370;
				word32 s5_371;
				word32 a5_366;
				word32 a7_367;
				word32 s2_368;
				word32 s1_363;
				word32 a1_364;
				word32 a3_365;
				word32 a2_360;
				word32 a3_361;
				word32 a4_362;
				word32 t1_357;
				word32 a0_358;
				word32 a1_359;
				mbedtls_cipher_update(memset(ra_45, fp + -32, 0x00, 0x10, out t1_357, out a0_358, out a1_359, out a2_360, out a3_361, out a4_362, out a5_68), a0, fp + -32, 0x10, fp + -32, fp + -36, a5_68, s3, s5, s7, dwLoc08, dwArg38, s1, dwArg78, dwArgA4, dwArgC0, dwArgC4, dwArgE8, out s0_83, out s1_363, out a0_80, out a1_364, out a3_365, out a5_366, out a7_367, out s2_368, out s3_369, out s4_370, out s5_371, out s6_372, out s7_373, out s8_374);
				if (a0_80 == 0x00)
				{
					s0_83->dw00C4 = 0x00;
					s0_83->dw0044 = 0x00;
					struct Eq_338724 * a4_138 = (word32) bLoc18 << 24 | (word32) bLoc17 << 16 | (word32) bLoc15 | (word32) bLoc16 << 8;
					s0_83->ptr0084 = a4_138;
					uint32 a2_125 = (word32) bLoc1C << 24 | (word32) bLoc1B << 16 | (word32) bLoc19 | (word32) bLoc1A << 8;
					s0_83->dw0100 = a2_125;
					uint32 a5_126 = (word32) bLoc20 << 24 | (word32) bLoc1F << 16 | (word32) bLoc1D | (word32) bLoc1E << 8;
					s0_83->dw0104 = a5_126;
					s0_83->dw00C0 = 0x00;
					s0_83->dw0040 = 0x00;
					struct Eq_338795 * a3_150 = (word32) bLoc14 << 24 | (word32) bLoc13 << 16 | (word32) bLoc11 | (word32) bLoc12 << 8;
					s0_83->ptr0080 = a3_150;
					word32 a6_155;
					int32 a7_156 = 0x04;
					for (a6_155 = 0x03; a6_155 != 0x00; a6_155 += ~0x00)
					{
						a3_150 = a4_138 << 0x1F | a3_150 >> 1;
						struct Eq_338825 * a1_178 = s0_83 + (a7_156 << 0x03) / 264;
						a3_150->ptr0040 = a1_178;
						a4_138 = a2_125 << 0x1F | a4_138 >> 1;
						a4_138->ptr0044 = a1_178;
						a2_125 = a5_126 << 0x1F | a2_125 >> 1;
						a1_178->dw00C0 = a2_125;
						a5_126 = a5_126 >> 1 ^ (a3_150 & 1) + 0xE1000000;
						a1_178->dw00C4 = a5_126;
						a7_156 >>= 0x01;
					}
					word32 a3_187;
					ui32 a2_188 = 0x02;
					for (a3_187 = 0x03; a3_187 != 0x00; a3_187 += ~0x00)
					{
						int32 a1_192 = a2_188 << 0x03;
						struct Eq_338869 * t1_196 = &s0_83->dw00C0 + a1_192;
						struct Eq_338892 * a7_194 = &s0_83->dw0040 + a1_192;
						int32 s1_198 = t1_196->dw0000;
						int32 t2_199 = t1_196->dw0004;
						int32 t0_200 = a7_194->dw0000;
						int32 t6_201 = a7_194->dw0004;
						struct Eq_338872 * a5_203 = &(&s0_83->dw0044 + 1)->ptr0080;
						int32 a4_204 = 0x08;
						do
						{
							struct Eq_338868 * t3_210 = t1_196 + a4_204 / 8;
							t3_210->dw0000 = a5_203->dw0000 ^ s1_198;
							++a5_203;
							t3_210->dw0004 = a5_203->dw007C ^ t2_199;
							struct Eq_338891 * t3_221 = a7_194 + a4_204 / 8;
							t3_221->dw0000 = a5_203->dwFFFFFFF8 ^ t0_200;
							t3_221->dw0004 = a5_203->dwFFFFFFFC ^ t6_201;
							a4_204 += 0x08;
						} while (a1_192 != a4_204);
						a2_188 <<= 1;
					}
				}
			}
		}
	}
}

// 23065216: Register Eq_2 mbedtls_gcm_starts(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s5, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out ptr32 a7Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      mbedtls_cipher_auth_encrypt
Eq_2 mbedtls_gcm_starts(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s5, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg94, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgD8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a5Out, ptr32 & a7Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 a5_163;
	word32 a2_544;
	word32 a3_545;
	word32 a4_546;
	word32 a5_547;
	word32 a0_535;
	word32 a4_539;
	word32 a5_540;
	word32 t1_541;
	word32 a0_542;
	word32 a1_543;
	word32 a1_536;
	word32 a2_537;
	word32 a3_538;
	word32 t1_534;
	Eq_2 ra_204 = memset(memset(ra, (word32) a0 + 352, 0x00, 0x10, out t1_534, out a0_535, out a1_536, out a2_537, out a3_538, out a4_539, out a5_540), (word32) a0 + 368, 0x00, 0x10, out t1_541, out a0_542, out a1_543, out a2_544, out a3_545, out a4_546, out a5_547);
	((word32) a0 + 320)->u0 = 0x00;
	*((word32) a0 + 328) = 0x00;
	*((word32) a0 + 384) = a1;
	((word32) a0 + 0x0144)->u0 = 0x00;
	*((word32) a0 + 332) = 0x00;
	Eq_2 s1_127 = (word32) a0 + 352;
	Eq_2 s0_117 = a0;
	Eq_2 s5_138 = a2;
	Eq_2 s7_18 = a1;
	Eq_2 s2_137 = a3;
	if (a3 == 0x0C)
	{
		word32 a3_557;
		word32 a4_558;
		word32 a5_559;
		word32 a6_560;
		word32 a7_561;
		word32 a1_555;
		word32 a2_556;
		memcpy((word32) a0 + 352, a2, 0x0C, out a1_555, out a2_556, out a3_557, out a4_558, out a5_559, out a6_560, out a7_561);
		((word32) a0 + 367)->u1 = 0x01;
		a5_163.u0 = 0x01;
	}
	else
	{
		word32 a4_553;
		word32 a5_554;
		word32 t1_548;
		word32 a0_549;
		word32 a1_550;
		word32 a2_551;
		word32 a3_552;
		ra_204 = memset(ra_204, fp + -64, 0x00, 0x10, out t1_548, out a0_549, out a1_550, out a2_551, out a3_552, out a4_553, out a5_554);
		while (s2_137 != 0x00)
		{
			s7_18 = s2_137;
			if (s2_137 > 0x10)
				s7_18.u0 = 0x10;
			Eq_2 a4_103 = s1_127;
			Eq_2 a5_101 = 0x00;
			do
			{
				a4_103 = (word32) a4_103 + 1;
				Mem110[a4_103 + 0x0FFF:byte] = SLICE(CONVERT(Mem104[s5_138 + a5_101:byte], byte, word32) ^ CONVERT(Mem104[a4_103 + 0x00:byte], byte, word32), byte, 0);
				a5_101 = (word32) a5_101 + 1;
			} while (s7_18 != a5_101);
			word32 s2_128;
			word32 a1_572;
			word32 a5_573;
			word32 a7_574;
			s0_117 = gcm_mult(s1_127, s0_117, s1_127, s1_127, a5_101, out s1_127, out a1_572, out a5_573, out a7_574, out s2_128);
			s2_137 = s2_128 - s7_18;
			s5_138 += s7_18;
		}
		Eq_2 a4_139 = s1_127;
		Eq_2 a5_143 = fp + -64;
		do
		{
			a4_139 = (word32) a4_139 + 1;
			((word32) a4_139 + 0x0FFF)->u1 = (byte) ((word32) *a4_139 ^ (word32) (*a5_143));
			a5_143 = (word32) a5_143 + 1;
		} while ((word32) a0 + 368 != a4_139);
		word32 a1_562;
		word32 a7_563;
		word32 s2_564;
		s0_117 = gcm_mult(s1_127, s0_117, s1_127, s1_127, a5_143, out s1_127, out a1_562, out a5_163, out a7_563, out s2_564);
	}
	ptr32 a0_222;
	Eq_2 s4_226;
	word32 a1_566;
	word32 a3_567;
	word32 s2_568;
	word32 s7_569;
	word32 s8_570;
	word32 s1_565;
	Eq_2 s0_225;
	ptr32 s5_230;
	ptr32 s6_235;
	ptr32 a5_232;
	ptr32 a7_238;
	Eq_2 s3_240;
	mbedtls_cipher_update(ra_204, s0_117, s1_127, 0x10, (word32) s0_117 + 336, fp + -0x0044, a5_163, a5, s5_138, s7_18, dwLoc18, dwArg28, s5, dwArg68, dwArg94, dwArgB0, dwArgB4, dwArgD8, out s0_225, out s1_565, out a0_222, out a1_566, out a3_567, out a5_232, out a7_238, out s2_568, out s3_240, out s4_226, out s5_230, out s6_235, out s7_569, out s8_570);
	ptr32 s2_247 = a0_222;
	if (a0_222 == 0x00)
	{
		*((word32) s0_225 + 328) = s3_240;
		*((word32) s0_225 + 332) = 0x00;
		s5_230 = 0x10;
		for (; s3_240 != 0x00; s3_240 -= s1_286)
		{
			Eq_2 s1_252 = s3_240;
			if (s3_240 > 0x10)
				s1_252.u0 = 0x10;
			Eq_2 a4_257 = s4_226;
			Eq_2 a5_258 = 0x00;
			do
			{
				a4_257 = (word32) a4_257 + 1;
				((word32) a4_257 + 0x0FFF)->u1 = (byte) ((word32) *((word32) a5_258 + s6_235) ^ (word32) (*a4_257));
				a5_258 = (word32) a5_258 + 1;
			} while (s1_252 != a5_258);
			Eq_339192 s1_286;
			word32 a1_571;
			s0_225 = gcm_mult(s1_252, s0_225, s4_226, s4_226, a5_258, out s1_286, out a1_571, out a5_232, out a7_238, out s2_247);
			s6_235 = (word32) s1_286 + s6_235;
		}
	}
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = s2_247;
	a5Out = a5_232;
	a7Out = a7_238;
	s2Out = s2_247;
	s3Out = s3_240;
	s4Out = dwArg0168;
	s5Out = s5_230;
	s6Out = s6_235;
	return dwLoc08;
}

// 23065386: Register Eq_2 mbedtls_gcm_update(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_cipher_update
//      mbedtls_cipher_auth_encrypt
Eq_2 mbedtls_gcm_update(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out)
{
	ptr32 a0_125;
	Eq_2 a5_129;
	Eq_2 s2_120;
	Eq_2 s0_193 = a0;
	Eq_2 s1_204 = a1;
	Eq_2 s6_117 = a2;
	Eq_2 s7_118 = a3;
	if (a2 < a3)
	{
		a5_129 = a3 - a2;
		a0_125 = ~0x13;
		s2_120 = s2;
		if (a5_129 < a1)
			goto l230653FA;
	}
	Eq_2 a2_37 = *((word32) a0 + 320);
	word32 a4_40 = a1 + a2_37;
	Eq_2 a3_38 = *((word32) a0 + 0x0144);
	a5_129 = (word32) a3_38 + (word32) (a4_40 < a1);
	if (a5_129 >= a3_38 && (a3_38 != a5_129 || a4_40 >= a2_37) && (a5_129 <= 0x0F && (a5_129 != 0x0F || a4_40 <= ~0x1F)))
	{
		*((word32) a0 + 320) = a4_40;
		*((word32) a0 + 0x0144) = a5_129;
		s2_120.u0 = 0x10;
		s3 = (word32) a0 + 363;
		Eq_2 s4_122 = (word32) a0 + 352;
		s5.u0 = 0x01;
		while (s1_204 != 0x00)
		{
			Eq_2 a4_64 = (word32) s0_193 + 367;
			do
			{
				ui32 a5_69 = (word32) *a4_64 + 0x01 & 0x00FF;
				a4_64->u1 = (byte) a5_69;
				if (a5_69 != 0x00)
					break;
				a4_64 = (word32) a4_64 - 1;
			} while (a4_64 != s3);
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg56 = <invalid>;
			Eq_2 stackArg120 = <invalid>;
			Eq_2 stackArg152 = <invalid>;
			Eq_2 stackArg184 = <invalid>;
			Eq_2 stackArg228 = <invalid>;
			Eq_2 stackArg256 = <invalid>;
			Eq_2 stackArg260 = <invalid>;
			Eq_2 stackArg296 = <invalid>;
			Eq_2 s0_115;
			Eq_2 s1_116;
			int32 s8_124;
			word32 a3_507;
			ra = mbedtls_cipher_update(ra, s0_193, s4_122, 0x10, fp + -64, fp + -0x0044, a5, s3, s5, s7_118, stackArg56, stackArg120, stackArg152, stackArg184, stackArg228, stackArg256, stackArg260, stackArg296, out s0_115, out s1_116, out a0_125, out a1, out a3_507, out a5_129, out a7, out s2_120, out s3, out s4_122, out s5, out s6_117, out s7_118, out s8_124);
			if (a0_125 != 0x00)
				goto l230653FA;
			Eq_2 a5_134 = (word32) s0_115 + 368;
			int32 a4_135 = 0x00;
			do
			{
				byte * a1_142 = (word32) s6_117 + a4_135;
				if (*((word32) s0_115 + 384) == 0x00)
					a5_134.u24->b0000 = (byte) ((word32) *a1_142 ^ (word32) (a5_134.u24)->b0000);
				ui32 a3_157 = (word32) (fp + -64 + a4_135) ^ (word32) (*a1_142);
				((word32) s7_118 + a4_135)->u1 = (byte) a3_157;
				if (*((word32) s0_115 + 384) == s5)
					a5_134.u24->b0000 = (byte) (a3_157 ^ (word32) (a5_134.u24)->b0000);
				++a4_135;
				++&a5_134.u24->b0000;
			} while (s8_124 != a4_135);
			word32 s1_194;
			s0_193 = gcm_mult(s1_116, s0_115, (word32) s0_115 + 368, (word32) s0_115 + 368, a5_134, out s1_194, out a1, out a5_129, out a7, out s2_120);
			s1_204 = s1_194 - s8_124;
			s6_117 = (word32) s6_117 + s8_124;
			s7_118 = (word32) s7_118 + s8_124;
		}
		a0_125 = 0x00;
	}
	else
	{
		a0_125 = ~0x13;
		s2_120 = s2;
	}
l230653FA:
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = a0_125;
	a1Out = a1;
	a3Out = s2;
	a5Out = a5_129;
	a7Out = a7;
	s2Out = s2_120;
	s3Out = s3;
	s4Out = dwArg0168;
	s5Out = s5;
	s6Out = s6_117;
	s7Out = s7_118;
	s8Out = dwArg0148;
	return dwLoc08;
}

