pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 230654AA: Register Eq_2 mbedtls_gcm_finish(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg0198, Register out ptr32 s0Out, Register out (ptr32 byte) s1Out, Register out ptr32 a0Out, Register out Eq_339438 a5Out, Register out Eq_339439 s2Out, Register out Eq_339440 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      mbedtls_gcm_crypt_and_tag
Eq_2 mbedtls_gcm_finish(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg0198, ptr32 & s0Out, byte & s1Out, ptr32 & a0Out, union Eq_339438 & a5Out, union Eq_339439 & s2Out, union Eq_339440 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	ptr32 a0_159;
	Eq_2 s5_100 = *((word32) a0 + 320);
	Eq_339449 s7_27 = *((word32) a0 + 328);
	byte * s1_136 = *((word32) a0 + 0x0144) << 3 | s5_100 >> 0x1D;
	Eq_339439 s2_137 = s7_27 >> 0x1D | *((word32) a0 + 332) << 3;
	Eq_339438 a5_156 = 0x0C;
	if (a2 <= ~0x0F)
	{
		word32 a1_321;
		word32 a2_322;
		word32 a3_323;
		word32 a4_324;
		word32 a6_326;
		word32 a5_325;
		word32 a7_327;
		memcpy(a1, (word32) a0 + 336, a2, out a1_321, out a2_322, out a3_323, out a4_324, out a5_325, out a6_326, out a7_327);
		s6 = a2;
		s3 = s5_100 << 0x03;
		a5_156 = s5_100 << 0x03 | s7_27 << 0x03 | (s1_136 | s2_137);
		if (a5_156 != 0x00)
		{
			word32 t1_328;
			word32 a0_329;
			word32 a1_330;
			word32 a2_331;
			word32 a3_332;
			word32 a4_333;
			word32 a5_334;
			ra = memset(ra, fp + -64, 0x00, 0x10, out t1_328, out a0_329, out a1_330, out a2_331, out a3_332, out a4_333, out a5_334);
			s5_100 <<= 11;
			s3 = s5_100 << 11 | (s5_100 << 0x13) >> 0x18;
			Eq_2 a5_110 = fp + -64;
			struct Eq_339540 * a4_112 = (word32) a0 + 368;
			do
			{
				++a4_112;
				a4_112[0x0FFF] = (struct Eq_339540) (byte) ((word32) a4_112->b0000 ^ (word32) (*a5_110));
				a5_110 = (word32) a5_110 + 1;
			} while (a4_112 != (word32) a0 + 384);
			word32 a1_335;
			word32 a5_336;
			word32 a7_337;
			Eq_2 s0_135 = gcm_mult((word32) a0 + 368, a0, (word32) a0 + 368, (word32) a0 + 368, a5_110, out s1_136, out a1_335, out a5_336, out a7_337, out s2_137);
			Eq_2 a1_146 = s0_135;
			s6 = a2 + s0_135;
			do
			{
				a1_146 = (word32) a1_146 + 1;
				a5_156 = (word32) *a1_146 ^ (word32) (*s1_136);
				((word32) a1_146 + 0x0FFF)->u1 = (byte) a5_156;
				++s1_136;
			} while (s6 != a1_146);
		}
		a0_159 = 0x00;
	}
	else
		a0_159 = ~0x13;
	0x00 = (uint16) dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_136;
	a0Out = a0_159;
	a5Out = a5_156;
	s2Out = s2_137;
	s3Out = s3;
	s4Out = dwArgF4;
	s5Out = s5_100;
	s6Out = s6;
	return ra;
}

// 23065600: Register Eq_2 mbedtls_gcm_crypt_and_tag(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a6, Register Eq_2 s5, Stack Eq_2 dwArg38, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0198, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      mbedtls_cipher_auth_encrypt
//      mbedtls_gcm_auth_decrypt
Eq_2 mbedtls_gcm_crypt_and_tag(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a6, Eq_2 s5, Eq_2 dwArg38, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArg0128, Eq_2 dwArg0198, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 a7_41;
	Eq_2 s0_43;
	ptr32 a0_160;
	ptr32 a5_169;
	Eq_2 s1_178;
	Eq_2 s2_180;
	Eq_2 s3_182;
	Eq_2 s4_184;
	ptr32 s5_186;
	ptr32 s6_188;
	Eq_2 ra_175 = mbedtls_gcm_starts(ra, a0, a1, a3, a4, a6, s5, dwLoc08, dwArg38, ra, dwArg80, dwArg84, dwArgA8, out s0_43, out s1_178, out a0_160, out a5_169, out a7_41, out s2_180, out s3_182, out s4_184, out s5_186, out s6_188);
	if (a0_160 == 0x00)
	{
		Eq_2 s0_74;
		word32 a1_216;
		word32 a3_217;
		word32 a7_218;
		word32 s7_219;
		word32 s8_220;
		ra_175 = mbedtls_gcm_update(s0_43, s3_182, a7_41, s4_184, out s0_74, out s1_178, out a0_160, out a1_216, out a3_217, out a5_169, out a7_218, out s2_180, out s3_182, out s4_184, out s5_186, out s6_188, out s7_219, out s8_220);
		if (a0_160 == 0x00)
		{
			0x00 = (uint16) dwArg0128;
			ptr32 a0_109;
			ptr32 a5_112;
			ptr32 s0_114;
			Eq_2 s1_115;
			Eq_2 s2_116;
			Eq_2 s4_117;
			ptr32 s5_118;
			Eq_2 s3_126;
			ptr32 s6_127;
			Eq_2 ra_125 = mbedtls_gcm_finish(ra_175, s0_74, s1_178, s2_180, dwArg0198, out s0_114, out s1_115, out a0_109, out a5_112, out s2_116, out s3_126, out s4_117, out s5_118, out s6_127);
			s0Out = s0_114;
			s1Out = s1_115;
			a0Out = a0_109;
			a5Out = a5_112;
			s2Out = s2_116;
			s3Out = s3_126;
			s4Out = s4_117;
			s5Out = s5_118;
			s6Out = s6_127;
			return ra_125;
		}
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_178;
	a0Out = a0_160;
	a5Out = a5_169;
	s2Out = s2_180;
	s3Out = s3_182;
	s4Out = s4_184;
	s5Out = s5_186;
	s6Out = s6_188;
	return ra_175;
}

// 23065660: Register Eq_2 mbedtls_gcm_auth_decrypt(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 a7, Register Eq_2 s5, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out (ptr32 byte) s1Out, Register out Eq_328073 a0Out, Register out Eq_328074 s2Out, Register out (ptr32 (arr byte)) s3Out)
// Called from:
//      mbedtls_cipher_auth_decrypt
Eq_2 mbedtls_gcm_auth_decrypt(Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 a7, Eq_2 s5, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArgE8, Eq_2 dwArg0158, union Eq_2 & s0Out, byte & s1Out, union Eq_328073 & a0Out, union Eq_328074 & s2Out, byte (& s3Out)
{
	Eq_328074 s2_50;
	byte (* s3_51)[];
	ptr32 s4_52;
	word32 s5_197;
	word32 s6_198;
	word32 a5_196;
	byte * s0_48;
	Eq_328073 a0_138;
	byte * s1_156;
	Eq_2 ra_47 = mbedtls_gcm_crypt_and_tag(dwLoc18, a0, 0x00, a2, a3, a5, s5, dwLoc08, a7, dwArg44, dwArg68, dwArgE8, dwArg0158, out s0_48, out s1_156, out a0_138, out a5_196, out s2_50, out s3_51, out s4_52, out s5_197, out s6_198);
	Eq_328074 a5_65 = 0x00;
	if (a0_138 == 0x00)
	{
		while (a5_65 != s2_50)
		{
			a5_65 = (word32) a5_65.u0 + 1;
			a0_138 |= CONVERT(Mem36[s4_52 + a5_65:byte], byte, word32) ^ CONVERT(Mem36[s3_51 + a5_65:byte], byte, word32);
		}
		s1_156 += s0_48;
		if (a0_138 != 0x00)
		{
			for (; s0_48 != s1_156; ++s0_48)
				*s0_48 = 0x00;
			a0_138.u0 = ~0x11;
		}
	}
	s0Out = dwArg0158;
	s1Out = s1_156;
	a0Out = a0_138;
	s2Out = s2_50;
	s3Out = s3_51;
	return ra_47;
}

