pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 230656D4: Register Eq_2 mbedtls_gcm_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5)
// Called from:
//      gcm_ctx_free
Eq_2 mbedtls_gcm_free(Eq_2 ra, Eq_2 a0, Eq_2 a5)
{
	word32 a5_30;
	mbedtls_cipher_free(ra, a0, a5, out a5_30);
	Eq_2 s0_15 = a0;
	while (s0_15 != (word32) a0 + 0x0188)
	{
		s0_15->u1 = 0x00;
		s0_15 = (word32) s0_15 + 1;
	}
	return (word32) a0 + 0x0188;
}

// 230656F8: Register Eq_2 mbedtls_md_info_from_type(Register Eq_2 a0, Register out Eq_283627 a5Out)
// Called from:
//      mbedtls_pk_sign
//      mbedtls_pk_verify_ext
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_rsa_pkcs1_verify
//      tls_prf_sha256
//      mbedtls_ssl_derive_keys
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
Eq_2 mbedtls_md_info_from_type(Eq_2 a0, union Eq_283627 & a5Out)
{
	uint32 a0_5 = (word32) a0 - 3 & 0x00FF;
	if (a0_5 > 0x03)
	{
		a5Out.u0 = 0x03;
		return 0x00;
	}
	else
	{
		Eq_2 a0_13 = *((char *) g_a2308B308 + a0_5 * 0x04);
		a5Out.u0 = 0x2308B308;
		return a0_13;
	}
}

// 23065718: Register Eq_2 mbedtls_md_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      tls_prf_sha256
//      mbedtls_ssl_setup
Eq_2 mbedtls_md_init(Eq_2 ra, Eq_2 a0, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_10;
	ptr32 a4_11;
	ptr32 a5_12;
	word32 t1_19;
	word32 a0_20;
	word32 a1_21;
	word32 a2_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 0x0C, out t1_19, out a0_20, out a1_21, out a2_22, out a3_10, out a4_11, out a5_12);
	a3Out = a3_10;
	a4Out = a4_11;
	a5Out = a5_12;
	return ra_13;
}

// 23065720: Register Eq_2 mbedtls_md_free(Register Eq_2 ra, Register Eq_290023 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      tls_prf_sha256
//      mbedtls_ssl_transform_free
Eq_2 mbedtls_md_free(Eq_2 ra, Eq_290023 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a5Out = a5;
		return a2;
	}
	else
	{
		struct Eq_339776 * sp_14 = fp + ~0x0F;
		struct Eq_339780 * a0_10 = *a5;
		if (a5 != 0x00)
		{
			Eq_2 a0_12 = a0_10->t0004;
			if (a0_12 != 0x00)
			{
				<anonymous> * a5_13 = *((word32) a5 + 36);
				word32 t3_82;
				word32 s4_81;
				word32 a1_79;
				word32 a6_80;
				word32 tp_78;
				word32 s1_77;
				word32 a3_76;
				a5_13();
			}
			Eq_2 s0_23 = *((word32) a5 + 8);
			if (a5 != 0x00)
			{
				Eq_2 a4_29 = (word32) a5 + (*((word32) a4 + 0x0C) << 1);
				while (a5 != a4_29)
				{
					a5->u1 = 0x00;
					a5 = (word32) a5 + 1;
				}
				word32 t3_169;
				word32 s1_160;
				word32 a0_161;
				word32 a2_163;
				word32 a1_162;
				word32 s4_168;
				word32 a6_167;
				word32 a5_166;
				word32 a4_165;
				word32 a3_164;
				vPortFree(a0_12, a2, a5, mstatus, sp_14->t0158, sp_14->t0198, out s0_23, out s1_160, out a0_161, out a1_162, out a2_163, out a3_164, out a4_165, out a5_166, out a6_167, out s4_168, out t3_169);
			}
			a5 = (word32) s0_23 + 0x0C;
			while (s0_23 != a5)
			{
				s0_23->u1 = 0x00;
				s0_23 = (word32) s0_23 + 1;
			}
		}
		a5Out = a5;
		return dwArg10;
	}
}

// 2306576E: Register Eq_2 mbedtls_md_setup(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_289894 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      tls_prf_sha256
//      mbedtls_ssl_derive_keys
Eq_2 mbedtls_md_setup(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_289894 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0148, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	if (a1 == 0x00 || a0 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x050000FF;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		mstatusOut = mstatus;
		return ra;
	}
	ptr32 a0_105;
	word32 a1_17 = *((word32) a5 + 32);
	Eq_2 a1_23;
	struct Eq_339876 * a0_24;
	word32 tp_31;
	word32 a6_97;
	word32 t0_101;
	word32 t1_102;
	word32 t3_103;
	Eq_2 s0_25;
	Eq_2 a5_125;
	Eq_2 ra_141;
	Eq_2 s1_148;
	Eq_2 s2_152;
	ptr32 s3_158;
	ptr32 s4_164;
	ptr32 s8_100;
	a5();
	a0_24->t0004 = s0_25;
	if (a0_24 == null)
	{
l230657A0:
		a0_105 = ~0x0500017F;
		goto l230657AC;
	}
	else
	{
		if (s2_152 != 0x00)
		{
			word32 a1_38;
			word32 a2_225;
			ra_141 = mycalloc(ra_141, *((word32) a1_23 + 0x0C), 0x02, a1_23, a3, a4, a5_125, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_25, out s1_148, out a1_38, out a2_225, out a3, out a4, out a5_125, out s2_152, out s3_158, out s4_164, out s8_100);
			*(union Eq_2 *) 0x0A = s0_25;
			if (false)
			{
				a5_125();
				goto l230657A0;
			}
		}
		*s1_148 = s0_25;
		a0_105 = 0x00;
l230657AC:
		0x00 = (uint16) dwArg38;
		s1Out = s1_148;
		a0Out = a0_105;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_125;
		s2Out = s2_152;
		s3Out = s3_158;
		s4Out = s4_164;
		s8Out = s8_100;
		mstatusOut = mstatus;
		return ra_141;
	}
}

// 230657C0: Register Eq_2 mbedtls_md_starts(Register Eq_2 ra, Register (ptr32 word32) a0, Register Eq_2 a5, Stack Eq_2 dwArg10, Register out Eq_2 a5Out)
// Called from:
//      mgf_mask
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
Eq_2 mbedtls_md_starts(Eq_2 ra, word32 * a0, Eq_2 a5, Eq_2 dwArg10, union Eq_2 & a5Out)
{
	if (a0 != null)
	{
		word32 a0_6 = *a5;
		if (a5 != 0x00)
		{
			<anonymous> * a5_13 = *((word32) a5 + 16);
			Eq_2 a5_16;
			Eq_2 ra_17;
			a5_13();
			a5Out = a5_16;
			return ra_17;
		}
	}
	a5Out = a5;
	return ra;
}

