pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 230657E0: Register word32 mbedtls_md_update(Register word32 ra, Register (ptr32 word32) a0, Register (ptr32 Eq_287420) a5, Stack Eq_2 dwArg10, Register out (ptr32 Eq_287420) a5Out)
// Called from:
//      mgf_mask
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
word32 mbedtls_md_update(word32 ra, word32 * a0, struct Eq_287420 * a5, Eq_2 dwArg10, struct Eq_287420 & a5Out)
{
	if (a0 != null)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * a5_13 = a5->ptr0014;
			struct Eq_287420 * a5_16;
			word32 ra_17;
			a5_13();
			a5Out = a5_16;
			return ra_17;
		}
	}
	a5Out = a5;
	return ra;
}

// 23065800: Register word32 mbedtls_md_finish(Register word32 ra, Register (ptr32 word32) a0, Register (ptr32 Eq_287422) a5, Stack Eq_2 dwArg10, Register out Eq_2 a2Out, Register out (ptr32 Eq_287422) a5Out)
// Called from:
//      mgf_mask
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
word32 mbedtls_md_finish(word32 ra, word32 * a0, struct Eq_287422 * a5, Eq_2 dwArg10, union Eq_2 & a2Out, struct Eq_287422 & a5Out)
{
	if (a0 != null)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * a5_13 = a5->ptr0018;
			struct Eq_287422 * a5_16;
			word32 ra_17;
			a5_13();
			a2Out = dwArg10;
			a5Out = a5_16;
			return ra_17;
		}
	}
	a2Out = a2;
	a5Out = a5;
	return ra;
}

// 23065820: Register Eq_2 mbedtls_md(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register ptr32 a3, Register out Eq_2 a1Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
Eq_2 mbedtls_md(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, ptr32 a3, union Eq_2 & a1Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a1Out = a1;
		a5Out = a0;
		return ra;
	}
	else
	{
		Eq_2 a5_19;
		Eq_2 ra_20;
		Eq_2 a1_21;
		(*((word32) a0 + 28))();
		a1Out = a1_21;
		a5Out = a5_19;
		return ra_20;
	}
}

// 23065842: Register Eq_2 mbedtls_md_hmac_starts(Register Eq_2 ra, Register Eq_295115 a0, Register (ptr32 Eq_294927) a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_295034 s4, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_295034 s4Out, Register out ptr32 s8Out)
// Called from:
//      tls_prf_sha256
//      mbedtls_ssl_derive_keys
Eq_2 mbedtls_md_hmac_starts(Eq_2 ra, Eq_295115 a0, struct Eq_294927 * a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_295034 s4, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_295034 & s4Out, ptr32 & s8Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a2Out = a2;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		return ra;
	}
	struct Eq_339982 * sp_145 = fp + -64;
	word32 a0_20 = *a5;
	if (a5 != 0x00)
	{
		word32 a0_23 = *((word32) a4 + 8);
		if (a4 != 0x00)
		{
			struct Eq_339998 * a5_26 = *((word32) a4 + 0x0C);
			struct Eq_294927 * s1_221 = a1;
			Eq_2 s3_220 = a2;
			if (a4 < a2)
			{
				<anonymous> * a5_31 = a5_26->ptr0010;
				word32 sp_33;
				word32 a0_34;
				word32 ra_36;
				word32 s1_37;
				word32 s2_38;
				word32 s3_39;
				word32 s4_40;
				struct Eq_340062 * a5_41;
				word32 a4_42;
				a5_31();
				<anonymous> * a5_52 = a5_41->ptr0014;
				word32 sp_55;
				word32 a0_56;
				word32 ra_58;
				word32 s1_59;
				word32 s2_60;
				word32 s3_61;
				word32 s4_62;
				struct Eq_340075 * a5_63;
				word32 a4_64;
				word32 a2_66;
				a5_52();
				<anonymous> * a5_74 = a5_63->ptr0018;
				word32 t3_87;
				word32 s8_88;
				word32 a6_89;
				word32 a3_90;
				word32 t1_233;
				word32 t0_232;
				a5_74();
				s3_220 = a5_26->t0008;
			}
			Eq_2 s2_96 = a5_26->ptr0000->t0008;
			word32 s4_101 = s2_96 + a2;
			Eq_2 a2_105;
			word32 a0_116;
			word32 t1_330;
			word32 a4_332;
			word32 a5_333;
			word32 a3_331;
			word32 a0_325;
			word32 a3_327;
			word32 a4_328;
			word32 a5_329;
			word32 a1_326;
			word32 t1_324;
			word32 a1_117;
			word32 a2_118;
			Eq_2 ra_122 = memset(memset(ra, s2_96, 54, a2, out t1_324, out a0_325, out a1_326, out a2_105, out a3_327, out a4_328, out a5_329), s4_101, 92, a2_105, out t1_330, out a0_116, out a1_117, out a2_118, out a3_331, out a4_332, out a5_333);
			Eq_2 a5_125 = 0x00;
			while (s3_220 != a5_125)
			{
				word32 a2_131 = s1_221 + a5_125;
				word32 a3_129 = s2_96 + a5_125;
				a1_117 = (word32) *a2_131;
				*a3_129 = (byte) ((word32) *a3_129 ^ a1_117);
				word32 a3_138 = s4_101 + a5_125;
				a2_118 = (word32) *a2_131;
				*a3_138 = (byte) ((word32) *a3_138 ^ a2_118);
				a5_125 = (word32) a5_125 + 1;
			}
			struct Eq_339982 * a5_146 = sp_145;
			do
			{
				a5_146->b0000 = 0x00;
				struct Eq_339982 * a4_150 = sp_145 + 32;
				++a5_146;
			} while (a5_146 != a4_150);
			<anonymous> * a5_156 = a5_146[16];
			word32 a0_168;
			word32 ra_170;
			word32 s1_171;
			word32 s2_172;
			word32 s3_173;
			word32 s4_174;
			<anonymous> * a4_176;
			word32 a2_178;
			a5_156();
			word32 t3_202;
			word32 s8_203;
			word32 a6_204;
			word32 a3_205;
			word32 t0_206;
			word32 t1_207;
			a4_176();
l230658D8:
			s0Out = dwArg0158;
			s1Out = s1;
			a2Out = dwArg0138;
			a4Out = a4;
			a5Out = a5;
			s2Out = s2;
			s3Out = s3;
			s4Out = dwArgF4;
			s8Out = dwArgD4;
			return ra;
		}
	}
	goto l230658D8;
}

// 23065924: Register Eq_2 mbedtls_md_hmac_update(Register Eq_2 ra, Register Eq_295105 a0, Register (ptr32 Eq_295064) a4, Register Eq_2 a5, Stack Eq_2 dwArg10, Register out ptr32 a0Out, Register out (ptr32 Eq_295064) a4Out, Register out Eq_2 a5Out)
// Called from:
//      tls_prf_sha256
//      mbedtls_ssl_write_record
//      mbedtls_ssl_read_record_layer
Eq_2 mbedtls_md_hmac_update(Eq_2 ra, Eq_295105 a0, struct Eq_295064 * a4, Eq_2 a5, Eq_2 dwArg10, ptr32 & a0Out, struct Eq_295064 & a4Out, union Eq_2 & a5Out)
{
	if (a0 != 0x00 && a5 != 0x00)
	{
		word32 a0_8 = a4->dw0008;
		if (a4 != null)
		{
			<anonymous> * a5_15 = *((word32) a5 + 20);
			Eq_2 a5_18;
			struct Eq_295064 * a4_19;
			Eq_2 ra_20;
			a5_15();
			a0Out = 0x00;
			a4Out = a4_19;
			a5Out = a5_18;
			return ra_20;
		}
	}
	a0Out = ~0x050000FF;
	a4Out = a4;
	a5Out = a5;
	return ra;
}

