pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23065948: Register Eq_2 mbedtls_md_hmac_finish(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_295087 a0, Register Eq_295088 a1, Register ptr32 a4, Register (ptr32 Eq_295070) a5, Register Eq_2 s2, Stack ptr32 dwArg0100, Stack word32 dwArg0104, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_295088 a1Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out (ptr32 Eq_295070) a5Out, Register out Eq_2 s2Out)
// Called from:
//      tls_prf_sha256
//      mbedtls_ssl_write_record
//      mbedtls_ssl_read_record_layer
Eq_2 mbedtls_md_hmac_finish(Eq_2 ra, word32 s0, Eq_2 s1, Eq_295087 a0, Eq_295088 a1, ptr32 a4, struct Eq_295070 * a5, Eq_2 s2, ptr32 dwArg0100, word32 dwArg0104, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_295088 & a1Out, ptr32 & a2Out, ptr32 & a4Out, struct Eq_295070 & a5Out, union Eq_2 & s2Out)
{
	if (a0 != 0x00 && a4 != 0x00)
	{
		word32 a0_8 = a5->dw0008;
		if (a5 != null)
		{
			word32 a0_29;
			word32 a4_30;
			struct Eq_340192 * a5_31;
			word32 ra_32;
			word32 s2_34;
			word32 s1_35;
			word32 a1_36;
			a5();
			<anonymous> * a5_41 = a5_31->ptr0010;
			word32 a0_43;
			<anonymous> * a4_44;
			word32 ra_46;
			word32 s2_48;
			word32 s1_49;
			word32 a2_51;
			a5_41();
			word32 sp_58;
			word32 a0_59;
			<anonymous> * a4_60;
			word32 ra_62;
			word32 s2_64;
			word32 s1_65;
			word32 a2_67;
			a4_44();
			word32 a0_75;
			word32 a4_76;
			struct Eq_340216 * a5_77;
			word32 ra_78;
			word32 s2_80;
			word32 s1_81;
			a4_60();
			<anonymous> * a5_88 = a5_77->ptr0018;
			ptr32 a4_91;
			struct Eq_295070 * a5_92;
			Eq_2 ra_93;
			Eq_2 s2_95;
			Eq_2 s1_96;
			Eq_295088 a1_97;
			a5_88();
			0x00 = (uint16) dwArg0128;
			s1Out = s1_96;
			a0Out = 0x00;
			a1Out = a1_97;
			a2Out = dwArg0100;
			a4Out = a4_91;
			a5Out = a5_92;
			s2Out = s2_95;
			return ra_93;
		}
	}
	s1Out = s1;
	a0Out = ~0x050000FF;
	a1Out = a1;
	a2Out = a2;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	return ra;
}

// 230659AC: Register Eq_2 mbedtls_md_hmac_reset(Register Eq_2 ra, Register Eq_295193 a0, Register (ptr32 Eq_295080) a1, Register Eq_2 a5, Register out ptr32 s0Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      tls_prf_sha256
//      mbedtls_ssl_write_record
//      mbedtls_ssl_read_record_layer
Eq_2 mbedtls_md_hmac_reset(Eq_2 ra, Eq_295193 a0, struct Eq_295080 * a1, Eq_2 a5, ptr32 & s0Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00 || a5 == 0x00)
	{
		s0Out = s0;
		a4Out = a4;
		a5Out = a5;
		return ra;
	}
	else
	{
		word32 a0_15 = a1->dw0008;
		if (a1 != null)
		{
			<anonymous> * a5_20 = *((word32) a5 + 16);
			struct Eq_340248 * sp_22;
			word32 a0_23;
			word32 ra_25;
			word32 a1_27;
			<anonymous> * a4_29;
			a5_20();
			word32 a2_34 = sp_22->dw0064;
			word32 a2_43;
			word32 t3_45;
			word32 s8_46;
			a4_29();
		}
		s0Out = s0;
		a4Out = a4;
		a5Out = a5;
		return ra;
	}
}

// 230659EC: Register Eq_2 mbedtls_md_process(Register Eq_2 ra, Register word32 a0, Register (ptr32 Eq_307504) a5, Stack Eq_2 dwArg10, Register out ptr32 a0Out, Register out (ptr32 Eq_307504) a5Out)
// Called from:
//      mbedtls_ssl_read_record_layer
Eq_2 mbedtls_md_process(Eq_2 ra, word32 a0, struct Eq_307504 * a5, Eq_2 dwArg10, ptr32 & a0Out, struct Eq_307504 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * a5_13 = a5->ptr002C;
			struct Eq_307504 * a5_16;
			Eq_2 ra_17;
			a5_13();
			a0Out = 0x00;
			a5Out = a5_16;
			return ra_17;
		}
	}
	a0Out = ~0x050000FF;
	a5Out = a5;
	return ra;
}

// 23065A0C: Register Eq_2 mbedtls_md_get_size(Register Eq_2 a0)
// Called from:
//      mbedtls_pk_sign
//      mbedtls_pk_verify_ext
//      mgf_mask
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_rsa_pkcs1_verify
//      tls_prf_sha256
//      mbedtls_ssl_derive_keys
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
Eq_2 mbedtls_md_get_size(Eq_2 a0)
{
	if (a0 == 0x00)
		return 0x00;
	return (word32) *((word32) a0 + 8);
}

// 23065A18: void md5_process_wrap(Register (ptr32 Eq_340283) a0, Register (ptr32 Eq_340284) a1, Stack word32 dwArg3C, Stack ptr32 dwArgE4, Stack Eq_59116 dwArg0148)
void md5_process_wrap(struct Eq_340283 * a0, struct Eq_340284 * a1, word32 dwArg3C, ptr32 dwArgE4, Eq_59116 dwArg0148)
{
	word32 s1_36;
	word32 s2_37;
	word32 s3_38;
	word32 s4_39;
	word32 s5_40;
	word32 s6_41;
	mbedtls_md5_process(a0, a1, dwArg3C, dwArgE4, dwArg0148, out s1_36, out s2_37, out s3_38, out s4_39, out s5_40, out s6_41);
}

// 23065A1C: void md5_clone_wrap(Register Eq_2 a0, Register Eq_2 a1)
void md5_clone_wrap(Eq_2 a0, Eq_2 a1)
{
	mbedtls_md5_clone(a0, a1);
}

// 23065A20: void md5_ctx_free(Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void md5_ctx_free(Eq_2 a0, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_11 = mbedtls_md5_free(a0);
	word32 s0_34;
	word32 s1_35;
	word32 a0_36;
	word32 a1_37;
	word32 a2_38;
	word32 a3_39;
	word32 a4_40;
	word32 a5_41;
	word32 a6_42;
	word32 s4_43;
	word32 t3_44;
	vPortFree(a0, dwArg10, a5_11, mstatus, dwArg0158, dwArg0198, out s0_34, out s1_35, out a0_36, out a1_37, out a2_38, out a3_39, out a4_40, out a5_41, out a6_42, out s4_43, out t3_44);
}

// 23065A38: void md5_ctx_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void md5_ctx_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 s2_79;
	word32 a5_78;
	word32 a4_77;
	word32 a3_76;
	word32 a2_75;
	word32 a1_74;
	word32 s1_73;
	word32 s0_72;
	word32 s3_80;
	word32 s4_81;
	word32 s8_82;
	Eq_2 ra_21 = mycalloc(ra, s1, 0x01, 88, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_72, out s1_73, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out s2_79, out s3_80, out s4_81, out s8_82);
	if (true)
	{
		word32 a1_83;
		mbedtls_md5_init(ra_21, 0x01, out a1_83);
	}
}

// 23065A5A: void md5_finish_wrap(Register ui32 a2, Stack Eq_2 dwArg28, Stack word32 dwArg88, Stack ptr32 dwArgA4, Stack Eq_59116 dwArg0108)
void md5_finish_wrap(ui32 a2, Eq_2 dwArg28, word32 dwArg88, ptr32 dwArgA4, Eq_59116 dwArg0108)
{
	word32 s1_37;
	word32 s2_38;
	word32 s5_39;
	word32 s6_40;
	mbedtls_md5_finish(a2, dwArg28, dwArg88, dwArgA4, dwArg0108, out s1_37, out s2_38, out s5_39, out s6_40);
}

// 23065A5E: void md5_update_wrap(Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 (ptr32 Eq_340283)) a5, Stack word32 dwArg1C, Stack Eq_2 dwArg48, Stack word32 dwArgA8, Stack ptr32 dwArgC4, Stack Eq_59116 dwArg0128)
void md5_update_wrap(Eq_2 a1, Eq_2 a2, struct Eq_340283 ** a5, word32 dwArg1C, Eq_2 dwArg48, word32 dwArgA8, ptr32 dwArgC4, Eq_59116 dwArg0128)
{
	word32 a5_40;
	word32 s2_41;
	word32 s3_42;
	word32 s4_43;
	mbedtls_md5_update(a1, a2, a5, dwArg1C, dwArg48, dwArgA8, dwArgC4, dwArg0128, out a5_40, out s2_41, out s3_42, out s4_43);
}

