pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23065A62: void md5_starts_wrap(Register (ptr32 Eq_340458) a0)
void md5_starts_wrap(struct Eq_340458 * a0)
{
	mbedtls_md5_starts(a0);
}

// 23065A66: void sha1_process_wrap(Register (ptr32 Eq_340463) a0, Register (ptr32 Eq_340464) a1, Stack word32 dwArg3C, Stack word32 dwArg0148)
void sha1_process_wrap(struct Eq_340463 * a0, struct Eq_340464 * a1, word32 dwArg3C, word32 dwArg0148)
{
	word32 s1_36;
	word32 s2_37;
	word32 s3_38;
	word32 s4_39;
	word32 s5_40;
	word32 s6_41;
	mbedtls_sha1_process(a0, a1, dwArg3C, dwArg0148, out s1_36, out s2_37, out s3_38, out s4_39, out s5_40, out s6_41);
}

// 23065A6A: void sha1_clone_wrap(Register Eq_2 a0, Register Eq_2 a1)
void sha1_clone_wrap(Eq_2 a0, Eq_2 a1)
{
	mbedtls_sha1_clone(a0, a1);
}

// 23065A6E: void sha1_ctx_free(Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void sha1_ctx_free(Eq_2 a0, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_11 = mbedtls_sha1_free(a0);
	word32 s0_34;
	word32 s1_35;
	word32 a0_36;
	word32 a1_37;
	word32 a2_38;
	word32 a3_39;
	word32 a4_40;
	word32 a5_41;
	word32 a6_42;
	word32 s4_43;
	word32 t3_44;
	vPortFree(a0, dwArg10, a5_11, mstatus, dwArg0158, dwArg0198, out s0_34, out s1_35, out a0_36, out a1_37, out a2_38, out a3_39, out a4_40, out a5_41, out a6_42, out s4_43, out t3_44);
}

// 23065A86: void sha1_ctx_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void sha1_ctx_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 s2_79;
	word32 a5_78;
	word32 a4_77;
	word32 a3_76;
	word32 a2_75;
	word32 a1_74;
	word32 s1_73;
	word32 s0_72;
	word32 s3_80;
	word32 s4_81;
	word32 s8_82;
	Eq_2 ra_21 = mycalloc(ra, s1, 0x01, 92, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_72, out s1_73, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out s2_79, out s3_80, out s4_81, out s8_82);
	if (true)
		mbedtls_sha1_init(ra_21, 0x01);
}

// 23065AA8: void sha1_finish_wrap(Register ui32 a2, Stack Eq_2 dwArg28, Stack word32 dwArg88, Stack word32 dwArg0108)
void sha1_finish_wrap(ui32 a2, Eq_2 dwArg28, word32 dwArg88, word32 dwArg0108)
{
	mbedtls_sha1_finish(a2, dwArg28, dwArg88, dwArg0108);
}

// 23065AAC: void sha1_update_wrap(Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 (ptr32 Eq_340463)) a5, Stack word32 dwArg1C, Stack Eq_2 dwArg48, Stack word32 dwArgA8, Stack word32 dwArg0128)
void sha1_update_wrap(Eq_2 a1, Eq_2 a2, struct Eq_340463 ** a5, word32 dwArg1C, Eq_2 dwArg48, word32 dwArgA8, word32 dwArg0128)
{
	word32 a5_39;
	mbedtls_sha1_update(a1, a2, a5, dwArg1C, dwArg48, dwArgA8, dwArg0128, out a5_39);
}

// 23065AB0: void sha1_starts_wrap(Register (ptr32 Eq_340458) a0)
void sha1_starts_wrap(struct Eq_340458 * a0)
{
	mbedtls_sha1_starts(a0);
}

// 23065AB4: void sha224_process_wrap(Register word32 a0, Register Eq_2 a1, Register (ptr32 word32) a3)
void sha224_process_wrap(word32 a0, Eq_2 a1, word32 * a3)
{
	mbedtls_sha256_process(a0, a1, a3);
}

// 23065AB8: void sha224_clone_wrap(Register Eq_2 a0, Register Eq_2 a1)
void sha224_clone_wrap(Eq_2 a0, Eq_2 a1)
{
	mbedtls_sha256_clone(a0, a1);
}

// 23065ABC: void sha224_ctx_free(Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void sha224_ctx_free(Eq_2 a0, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_11;
	mbedtls_sha256_free(a0, out a5_11);
	word32 s0_34;
	word32 s1_35;
	word32 a0_36;
	word32 a1_37;
	word32 a2_38;
	word32 a3_39;
	word32 a4_40;
	word32 a5_41;
	word32 a6_42;
	word32 s4_43;
	word32 t3_44;
	vPortFree(a0, dwArg10, a5_11, mstatus, dwArg0158, dwArg0198, out s0_34, out s1_35, out a0_36, out a1_37, out a2_38, out a3_39, out a4_40, out a5_41, out a6_42, out s4_43, out t3_44);
}

// 23065AD4: void sha224_ctx_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void sha224_ctx_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 s2_79;
	word32 a5_78;
	word32 a4_77;
	word32 a3_76;
	word32 a2_75;
	word32 a1_74;
	word32 s1_73;
	word32 s0_72;
	word32 s3_80;
	word32 s4_81;
	word32 s8_82;
	Eq_2 ra_21 = mycalloc(ra, s1, 0x01, 116, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_72, out s1_73, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out s2_79, out s3_80, out s4_81, out s8_82);
	if (true)
	{
		word32 a3_83;
		word32 a4_84;
		word32 a5_85;
		mbedtls_sha256_init(ra_21, 0x01, out a3_83, out a4_84, out a5_85);
	}
}

// 23065AF6: void sha224_wrap(Register Eq_2 ra)
void sha224_wrap(Eq_2 ra)
{
	word32 a5_19;
	mbedtls_sha256(ra, out a5_19);
}

// 23065AFC: void sha256_wrap(Register Eq_2 ra)
void sha256_wrap(Eq_2 ra)
{
	word32 a5_19;
	mbedtls_sha256(ra, out a5_19);
}

// 23065B02: void sha224_finish_wrap(Register Eq_2 a2, Stack Eq_2 dwArg28, Stack Eq_2 dwArg88)
void sha224_finish_wrap(Eq_2 a2, Eq_2 dwArg28, Eq_2 dwArg88)
{
	word32 s1_30;
	word32 a5_31;
	word32 s2_32;
	word32 s3_33;
	word32 s4_34;
	word32 s5_35;
	mbedtls_sha256_finish(a2, dwArg28, dwArg88, out s1_30, out a5_31, out s2_32, out s3_33, out s4_34, out s5_35);
}

// 23065B06: void sha224_update_wrap(Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 word32) a5, Stack Eq_2 dwArg48, Stack Eq_2 dwArgA8)
void sha224_update_wrap(Eq_2 a1, Eq_2 a2, word32 * a5, Eq_2 dwArg48, Eq_2 dwArgA8)
{
	word32 s1_32;
	word32 a1_33;
	word32 a4_34;
	word32 a5_35;
	word32 s2_36;
	word32 s3_37;
	word32 s4_38;
	word32 s5_39;
	mbedtls_sha256_update(a1, a2, a5, dwArg48, dwArgA8, out s1_32, out a1_33, out a4_34, out a5_35, out s2_36, out s3_37, out s4_38, out s5_39);
}

