pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23065B0A: void sha224_starts_wrap(Register Eq_2 a0)
void sha224_starts_wrap(Eq_2 a0)
{
	mbedtls_sha256_starts(a0, (struct Eq_283222 *) 0x01);
}

// 23065B10: void sha256_starts_wrap(Register Eq_2 a0)
void sha256_starts_wrap(Eq_2 a0)
{
	mbedtls_sha256_starts(a0, null);
}

// 23065B16: Register Eq_2 oid_sig_alg_from_asn1.part.0(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_oid_get_sig_alg_desc
//      mbedtls_oid_get_sig_alg
Eq_2 oid_sig_alg_from_asn1.part.0(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a5Out)
{
	Eq_2 s1_12 = a0;
	while (true)
	{
		ptr32 s0_20;
		if (a0 == 0x00)
			break;
		s1_12 = *((word32) a5 + 4);
		s0_20 = (ptr32) *((word32) a2 + 4);
		if (a2 == a5)
		{
			s1_12 = *((word32) a1 + 8);
			word32 a3_80;
			word32 a4_81;
			a0 = memcmp(a0, a1, a2, out a1, out a2, out a3_80, out a4_81, out a5);
			if (a0 == 0x00)
				goto l23065B44;
		}
	}
	s0_20 = 0x00;
l23065B44:
	a0Out = s0_20;
	a1Out = a1;
	a5Out = a5;
	return s1_12;
}

// 23065B50: Register Eq_2 mbedtls_oid_get_attr_short_name(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out)
// Called from:
//      mbedtls_x509_dn_gets
Eq_2 mbedtls_oid_get_attr_short_name(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out)
{
	if (a0 != 0x00)
	{
		Eq_2 s1_16 = a0;
		a1_25 = a1;
		while (true)
		{
			Eq_2 a1_25;
			if (a0 == 0x00)
				break;
			s1_16 = *((word32) a5 + 4);
			if (a2 == a5)
			{
				s1_16 = *((word32) a1_25 + 8);
				word32 a3_103;
				word32 a4_104;
				a0 = memcmp(a0, a1_25, a2, out a1_25, out a2, out a3_103, out a4_104, out a5);
				if (a0 == 0x00)
				{
					*a1 = a5;
					goto l23065B6A;
				}
			}
		}
		a0.u0 = -46;
l23065B6A:
		0x00 = (uint16) dwArg38;
		a0Out = a0;
		return s1_16;
	}
	else
	{
		a0Out.u0 = -46;
		return s1;
	}
}

// 23065B9E: Register Eq_2 mbedtls_oid_get_x509_ext_type(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_oid_get_x509_ext_type(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	if (a0 != 0x00)
	{
		Eq_2 s1_16 = a0;
		a1_25 = a1;
		while (true)
		{
			Eq_2 a1_25;
			if (a0 == 0x00)
				break;
			s1_16 = *((word32) a5 + 4);
			if (a2 == a5)
			{
				s1_16 = *((word32) a1_25 + 8);
				word32 a3_106;
				word32 a4_107;
				a0 = memcmp(a0, a1_25, a2, out a1_25, out a2, out a3_106, out a4_107, out a5);
				if (a0 == 0x00)
				{
					*a1 = a5;
					goto l23065BB8;
				}
			}
		}
		a0.u0 = -46;
l23065BB8:
		0x00 = (uint16) dwArg38;
		a0Out = a0;
		a1Out = a1_25;
		a5Out = a5;
		s2Out = a1;
		return s1_16;
	}
	else
	{
		a0Out.u0 = -46;
		a1Out = a1;
		a5Out = a5;
		s2Out = s2;
		return s1;
	}
}

// 23065BEC: Register Eq_2 mbedtls_oid_get_extended_key_usage(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out)
// Called from:
//      mbedtls_x509_crt_info
Eq_2 mbedtls_oid_get_extended_key_usage(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out)
{
	if (a0 != 0x00)
	{
		Eq_2 s1_16 = a0;
		a1_25 = a1;
		while (true)
		{
			Eq_2 a1_25;
			if (a0 == 0x00)
				break;
			s1_16 = *((word32) a5 + 4);
			if (a2 == a5)
			{
				s1_16 = *((word32) a1_25 + 8);
				word32 a3_103;
				word32 a4_104;
				a0 = memcmp(a0, a1_25, a2, out a1_25, out a2, out a3_103, out a4_104, out a5);
				if (a0 == 0x00)
				{
					*a1 = a5;
					goto l23065C06;
				}
			}
		}
		a0.u0 = -46;
l23065C06:
		0x00 = (uint16) dwArg38;
		a0Out = a0;
		return s1_16;
	}
	else
	{
		a0Out.u0 = -46;
		return s1;
	}
}

// 23065C3A: Register (ptr32 byte) mbedtls_oid_get_sig_alg_desc(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out Eq_340899 a0Out)
// Called from:
//      mbedtls_x509_sig_alg_gets
byte * mbedtls_oid_get_sig_alg_desc(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, union Eq_340899 & a0Out)
{
	if (a0 != 0x00)
	{
		Eq_340899 a0_21;
		word32 a0_13;
		union Eq_2 * a5_18;
		word32 a1_58;
		byte * s1_19 = oid_sig_alg_from_asn1.part.0(a0, a1, a2, a5, out a0_13, out a1_58, out a5_18);
		if (a0_13 != 0x00)
		{
			*a5_18 = (union Eq_2 *) a1;
			a0_21.u0 = 0x00;
		}
		else
			a0_21.u0 = -46;
		a0Out = a0_21;
		return s1_19;
	}
	else
	{
		a0Out.u0 = -46;
		return s1;
	}
}

// 23065C64: Register (ptr32 byte) mbedtls_oid_get_sig_alg(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out Eq_340926 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_x509_get_sig_alg
byte * mbedtls_oid_get_sig_alg(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, union Eq_340926 & a0Out, union Eq_2 & a1Out, union Eq_2 & a5Out)
{
	if (a0 != 0x00)
	{
		Eq_340926 a0_24;
		struct Eq_340932 * a0_16;
		Eq_2 a1_17;
		Eq_2 a5_21;
		byte * s1_22 = oid_sig_alg_from_asn1.part.0(a0, a1, a2, a5, out a0_16, out a1_17, out a5_21);
		if (a0_16 != null)
		{
			*s1_22 = (byte) (word32) a0_16->b0010;
			a5_21 = (word32) a0_16->b0011;
			a2->u1 = (byte) a5_21;
			a0_24.u0 = 0x00;
		}
		else
			a0_24.u0 = -46;
		a0Out = a0_24;
		a1Out = a1_17;
		a5Out = a5_21;
		return s1_22;
	}
	else
	{
		a0Out.u0 = -46;
		a1Out = a1;
		a5Out = a5;
		return s1;
	}
}

// 23065CA0: Register Eq_2 mbedtls_oid_get_pk_alg(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      pk_get_pk_alg
Eq_2 mbedtls_oid_get_pk_alg(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	if (a0 != 0x00)
	{
		Eq_2 s1_16 = a0;
		a1_25 = a1;
		while (true)
		{
			Eq_2 a1_25;
			if (a0 == 0x00)
				break;
			s1_16 = *((word32) a5 + 4);
			struct Eq_340976 * s0_24 = *((word32) a2 + 4);
			if (a2 == a5)
			{
				s1_16 = *((word32) a1_25 + 8);
				a0 = memcmp(a0, a1_25, a2, out a1_25, out a2, out a3, out a4, out a5);
				if (a0 == 0x00)
				{
					a5 = (word32) s0_24->b0010;
					a1->u1 = (byte) a5;
					goto l23065CBA;
				}
			}
		}
		a0.u0 = -46;
l23065CBA:
		0x00 = (uint16) dwArg38;
		a0Out = a0;
		a1Out = a1_25;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = a1;
		return s1_16;
	}
	else
	{
		a0Out.u0 = -46;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		return s1;
	}
}

// 23065CF0: Register Eq_2 mbedtls_oid_get_ec_grp(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      pk_use_ecparams
Eq_2 mbedtls_oid_get_ec_grp(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	if (a0 != 0x00)
	{
		Eq_2 s1_16 = a0;
		a1_25 = a1;
		while (true)
		{
			Eq_2 a1_25;
			if (a0 == 0x00)
				break;
			s1_16 = *((word32) a5 + 4);
			struct Eq_341017 * s0_24 = *((word32) a2 + 4);
			if (a2 == a5)
			{
				s1_16 = *((word32) a1_25 + 8);
				a0 = memcmp(a0, a1_25, a2, out a1_25, out a2, out a3, out a4, out a5);
				if (a0 == 0x00)
				{
					a5 = (word32) s0_24->b0010;
					a1->u1 = (byte) a5;
					goto l23065D0A;
				}
			}
		}
		a0.u0 = -46;
l23065D0A:
		0x00 = (uint16) dwArg38;
		a0Out = a0;
		a1Out = a1_25;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = a1;
		return s1_16;
	}
	else
	{
		a0Out.u0 = -46;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		return s1;
	}
}

