pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 23066F18: Register Eq_2 mbedtls_md5_update(Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 (ptr32 Eq_340283)) a5, Stack word32 dwArg1C, Stack Eq_2 dwArg48, Stack word32 dwArgA8, Stack ptr32 dwArgC4, Stack Eq_59116 dwArg0128, Register out (ptr32 (ptr32 Eq_340283)) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      md5_update_wrap
//      pem_aes_decrypt
//      mbedtls_md5_finish
//      mbedtls_md5
Eq_2 mbedtls_md5_update(Eq_2 a1, Eq_2 a2, struct Eq_340283 ** a5, word32 dwArg1C, Eq_2 dwArg48, word32 dwArgA8, ptr32 dwArgC4, Eq_59116 dwArg0128, struct Eq_340283 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a2 == 0x00)
	{
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return a2;
	}
	else
	{
		Eq_2 a2_9;
		struct Eq_340283 ** a5_12;
		ptr32 s2_19;
		ptr32 s3_20;
		ptr32 s4_21;
		word32 s5_98;
		word32 s6_99;
		mbedtls_md5_update.part.0(a1, a2, a5, dwArg1C, dwArg48, dwArgA8, dwArgC4, dwArg0128, out a2_9, out a5_12, out s2_19, out s3_20, out s4_21, out s5_98, out s6_99);
		a5Out = a5_12;
		s2Out = s2_19;
		s3Out = s3_20;
		s4Out = s4_21;
		return a2_9;
	}
}

// 23066F20: Register (ptr32 Eq_343596) mbedtls_md5_finish(Register ui32 a2, Stack Eq_2 dwArg28, Stack word32 dwArg88, Stack ptr32 dwArgA4, Stack Eq_59116 dwArg0108, Register out (ptr32 Eq_340418) s1Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      md5_finish_wrap
//      pem_aes_decrypt
//      mbedtls_md5
struct Eq_343596 * mbedtls_md5_finish(ui32 a2, Eq_2 dwArg28, word32 dwArg88, ptr32 dwArgA4, Eq_59116 dwArg0108, struct Eq_340418 & s1Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & s6Out)
{
	struct Eq_340283 ** a5_25;
	if ((a2 & 63) <= 55)
		a5_25 = (struct Eq_340283 **) 56;
	else
		a5_25 = (struct Eq_340283 **) 0x0078;
	struct Eq_340283 ** a5_41;
	word32 s4_161;
	word32 s3_160;
	word32 s2_159;
	mbedtls_md5_update(587776036, a5_25 - (a2 & 63), a5_25, dwLoc04, dwArg28, dwArg88, dwArgA4, dwArg0108, out a5_41, out s2_159, out s3_160, out s4_161);
	struct Eq_343618 * a5_72;
	ptr32 s2_79;
	ptr32 s5_82;
	ptr32 s6_83;
	word32 a2_162;
	word32 s3_163;
	word32 s4_164;
	struct Eq_340418 * s1_76 = mbedtls_md5_update.part.0(fp + ~0x17, 0x08, a5_41, dwLoc04, dwArg28, dwArg88, dwArgA4, dwArg0108, out a2_162, out a5_72, out s2_79, out s3_163, out s4_164, out s5_82, out s6_83);
	s1_76->b0000 = (byte) a5_72;
	struct Eq_343643 * s0_97 = a5_72->ptr0008;
	s1_76->b0001 = (byte) (a5_72 >> 8);
	s1_76->b0002 = (byte) (word32) s0_97->w000A;
	struct Eq_343661 * a5_102 = (word32) s0_97->b000B;
	s1_76->b0003 = (byte) a5_102;
	s1_76->b0004 = (byte) a5_102;
	struct Eq_343674 * s0_106 = a5_102->ptr000C;
	s1_76->b0005 = (byte) (a5_102 >> 8);
	s1_76->b0006 = (byte) (word32) s0_106->w000E;
	struct Eq_343692 * a5_111 = (word32) s0_106->b000F;
	s1_76->b0007 = (byte) a5_111;
	s1_76->b0008 = (byte) a5_111;
	struct Eq_343705 * s0_115 = a5_111->ptr0010;
	s1_76->b0009 = (byte) (a5_111 >> 8);
	s1_76->b000A = (byte) (word32) s0_115->w0012;
	struct Eq_343723 * a5_120 = (word32) s0_115->b0013;
	s1_76->b000B = (byte) a5_120;
	s1_76->b000C = (byte) a5_120;
	struct Eq_343596 * s0_124 = a5_120->ptr0014;
	s1_76->b000D = (byte) (a5_120 >> 8);
	s1_76->b000E = (byte) (word32) s0_124->w0016;
	s1_76->b000F = (byte) (word32) s0_124->b0017;
	s1Out = s1_76;
	s2Out = s2_79;
	s5Out = s5_82;
	s6Out = s6_83;
	return s0_124;
}

// 23066FF4: void mbedtls_md5(Register Eq_2 ra, Register Eq_2 a0, Stack word32 dwArg08, Stack ptr32 dwArg24, Stack word32 dwArg28, Stack ptr32 dwArg44, Stack Eq_59116 dwArg88, Stack Eq_59116 dwArgA8)
void mbedtls_md5(Eq_2 ra, Eq_2 a0, word32 dwArg08, ptr32 dwArg24, word32 dwArg28, ptr32 dwArg44, Eq_59116 dwArg88, Eq_59116 dwArgA8)
{
	Eq_2 a1_18;
	mbedtls_md5_init(ra, fp + -0x0068, out a1_18);
	word32 a5_114;
	word32 s2_115;
	word32 s3_116;
	word32 s4_117;
	word32 s1_118;
	word32 s2_119;
	word32 s5_120;
	word32 s6_121;
	mbedtls_md5_finish(mbedtls_md5_update(a0, a1_18, mbedtls_md5_starts(fp + -0x0068), dwLoc64, dwLoc38, dwArg28, dwArg44, dwArgA8, out a5_114, out s2_115, out s3_116, out s4_117), dwLoc58, dwArg08, dwArg24, dwArg88, out s1_118, out s2_119, out s5_120, out s6_121);
	mbedtls_md5_free(fp + -0x0068);
}

// 23067032: Register word32 mbedtls_sha1_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      sha1_ctx_alloc
//      mbedtls_sha1
word32 mbedtls_sha1_init(Eq_2 ra, Eq_2 a0)
{
	word32 a1_8;
	word32 t1_16;
	word32 a0_17;
	word32 a2_18;
	word32 a3_19;
	word32 a4_20;
	word32 a5_21;
	memset(ra, a0, 0x00, 92, out t1_16, out a0_17, out a1_8, out a2_18, out a3_19, out a4_20, out a5_21);
	return a1_8;
}

// 2306703C: Register word32 mbedtls_sha1_free(Register Eq_2 a0)
// Called from:
//      sha1_ctx_free
//      mbedtls_sha1
word32 mbedtls_sha1_free(Eq_2 a0)
{
	a0_5 = a0;
	if (a0 != 0x00)
	{
		while (true)
		{
			Eq_2 a0_5;
			if (a0_5 == (word32) a0 + 92)
				break;
			a0_5->u1 = 0x00;
			a0_5 = (word32) a0_5 + 1;
		}
	}
	return (word32) a0 + 92;
}

// 23067050: void mbedtls_sha1_clone(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      sha1_clone_wrap
void mbedtls_sha1_clone(Eq_2 a0, Eq_2 a1)
{
	word32 a1_26;
	word32 a2_27;
	word32 a3_28;
	word32 a4_29;
	word32 a5_30;
	word32 a6_31;
	word32 a7_32;
	memcpy(a0, a1, 92, out a1_26, out a2_27, out a3_28, out a4_29, out a5_30, out a6_31, out a7_32);
}

// 23067062: Register word32 mbedtls_sha1_starts(Register (ptr32 Eq_340458) a0)
// Called from:
//      sha1_starts_wrap
//      mbedtls_sha1
word32 mbedtls_sha1_starts(struct Eq_340458 * a0)
{
	*(struct Eq_340458 **) 0x67452309 = a0;
	*(struct Eq_340458 **) 4023233429 = a0;
	*(struct Eq_340458 **) 2562383118 = a0;
	*(struct Eq_340458 **) 271733898 = a0;
	a0->dw0000 = 0x00;
	a0->dw0004 = 0x00;
	*(struct Eq_340458 **) 3285377544 = a0;
	return 3285377520;
}

