pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 2306709E: Register word32 mbedtls_sha1_process(Register (ptr32 Eq_340463) a0, Register (ptr32 Eq_340464) a1, Stack word32 dwArg3C, Stack word32 dwArg0148, Register out Eq_340479 s1Out, Register out ptr32 s2Out, Register out Eq_340481 s3Out, Register out ptr32 s4Out, Register out Eq_340483 s5Out, Register out Eq_340484 s6Out)
// Called from:
//      sha1_process_wrap
//      mbedtls_sha1_update
word32 mbedtls_sha1_process(struct Eq_340463 * a0, struct Eq_340464 * a1, word32 dwArg3C, word32 dwArg0148, union Eq_340479 & s1Out, ptr32 & s2Out, union Eq_340481 & s3Out, ptr32 & s4Out, union Eq_340483 & s5Out, union Eq_340484 & s6Out)
{
	ui32 a1_190 = (word32) a1->b003E;
	struct Eq_343884 * a0_194 = ((Eq_363494[]) 20)[a1_190].ptr0000;
	int32 s4_169 = a0->dw0010;
	Eq_343893 s3_173 = a0->t0008;
	ui32 a2_43 = (word32) a1->b0000 << 24 | (word32) a1->b0001 << 16 | (word32) a1->b0003 | (word32) a1->b0002 << 8;
	ui32 s6_213 = a0_194->t000C << 30 | a0_194->t000C >> 0x02;
	ui32 a4_54 = (word32) a1->b0004 << 24 | (word32) a1->b0005 << 16 | (word32) a1->b0007 | (word32) a1->b0006 << 8;
	uint32 a1_210 = (s3_173 << 0x05 | s3_173 >> 0x1B) + (a0->dw0018 + 0x5A827999) + ((s4_169 ^ a1_190 << 8) & a0_194->t000C ^ a0_194->dw0014) + a2_43;
	ui32 s11_226 = s3_173 << 0x1E | s3_173 >> 0x02;
	ui32 a3_62 = (word32) a1->b0008 << 24 | (word32) a1->b0009 << 16 | (word32) a1->b000B | (word32) a1->b000A << 8;
	uint32 s7_224 = (a1_210 << 0x05 | a1_210 >> 0x1B) + ((((s4_169 ^ s6_213) & s3_173 ^ s4_169) + (a0_194->dw0014 + 0x5A827999)) + a4_54);
	ui32 a1_238 = a1_210 << 30 | a1_210 >> 0x02;
	ui32 t0_70 = (word32) a1->b000C << 24 | (word32) a1->b000D << 16 | (word32) a1->b000F | (word32) a1->b000E << 8;
	uint32 s9_239 = (s7_224 << 0x05 | s7_224 >> 0x1B) + (((s6_213 ^ s11_226) & a1_210 ^ s6_213) + ((s4_169 + 0x5A827999) + a3_62));
	ui32 s7_251 = s7_224 << 30 | s7_224 >> 0x02;
	ui32 t5_80 = (word32) a1->b0010 << 24 | (word32) a1->b0011 << 16 | (word32) a1->b0013 | (word32) a1->b0012 << 8;
	uint32 s10_252 = (s9_239 << 0x05 | s9_239 >> 0x1B) + (((s11_226 ^ a1_238) & s7_224 ^ s11_226) + ((s6_213 + 0x5A827999) + t0_70));
	ui32 s9_264 = s9_239 << 30 | s9_239 >> 0x02;
	ui32 t3_94 = (word32) a1->b0014 << 24 | (word32) a1->b0015 << 16 | (word32) a1->b0017 | (word32) a1->b0016 << 8;
	uint32 s6_265 = (s10_252 << 0x05 | s10_252 >> 0x1B) + (((a1_238 ^ s7_251) & s9_239 ^ a1_238) + ((s11_226 + 0x5A827999) + t5_80));
	ui32 a1_278 = s10_252 << 0x1E | s10_252 >> 0x02;
	ui32 a7_108 = (word32) a1->b0018 << 24 | (word32) a1->b0019 << 16 | (word32) a1->b001B | (word32) a1->b001A << 8;
	uint32 s11_275 = (s6_265 << 0x05 | s6_265 >> 0x1B) + (((s7_251 ^ s9_264) & s10_252 ^ s7_251) + ((t3_94 + 0x5A827999) + a1_238));
	ui32 s6_290 = s6_265 << 30 | s6_265 >> 0x02;
	ui32 s8_118 = (word32) a1->b001C << 24 | (word32) a1->b001D << 16 | (word32) a1->b001F | (word32) a1->b001E << 8;
	uint32 s5_293 = (s11_275 << 0x05 | s11_275 >> 0x1B) + (((s9_264 ^ a1_278) & s6_265 ^ s9_264) + ((a7_108 + 0x5A827999) + s7_251));
	ui32 s11_303 = s11_275 << 30 | s11_275 >> 0x02;
	ui32 t6_126 = (word32) a1->b0020 << 24 | (word32) a1->b0021 << 16 | (word32) a1->b0023 | (word32) a1->b0022 << 8;
	uint32 s9_304 = (s5_293 << 0x05 | s5_293 >> 0x1B) + (((a1_278 ^ s6_290) & s11_275 ^ a1_278) + (s9_264 + (s8_118 + 0x5A827999)));
	ui32 s5_316 = s5_293 << 30 | s5_293 >> 0x02;
	ui32 t4_134 = (word32) a1->b0024 << 24 | (word32) a1->b0025 << 16 | (word32) a1->b0027 | (word32) a1->b0026 << 8;
	uint32 s10_319 = (s9_304 << 0x05 | s9_304 >> 0x1B) + (((s6_290 ^ s11_303) & s5_293 ^ s6_290) + ((t6_126 + 0x5A827999) + a1_278));
	ui32 s9_329 = s9_304 << 30 | s9_304 >> 0x02;
	ui32 t1_142 = (word32) a1->b0028 << 24 | (word32) a1->b0029 << 16 | (word32) a1->b002B | (word32) a1->b002A << 8;
	uint32 s6_330 = (s10_319 << 0x05 | s10_319 >> 0x1B) + (((s11_303 ^ s5_316) & s9_304 ^ s11_303) + (s6_290 + (t4_134 + 0x5A827999)));
	ui32 s10_342 = s10_319 << 30 | s10_319 >> 0x02;
	ui32 a6_150 = (word32) a1->b002C << 24 | (word32) a1->b002D << 16 | (word32) a1->b002F | (word32) a1->b002E << 8;
	uint32 s7_345 = (s6_330 << 0x05 | s6_330 >> 0x1B) + (((s5_316 ^ s9_329) & s10_319 ^ s5_316) + ((t1_142 + 0x5A827999) + s11_303));
	ui32 s6_355 = s6_330 << 30 | s6_330 >> 0x02;
	ui32 a5_160 = (word32) a1->b0030 << 24 | (word32) a1->b0031 << 16 | (word32) a1->b0033 | (word32) a1->b0032 << 8;
	uint32 s5_358 = (s7_345 << 0x05 | s7_345 >> 0x1B) + (((s9_329 ^ s10_342) & s6_330 ^ s9_329) + (s5_316 + (a6_150 + 0x5A827999)));
	ui32 s7_368 = s7_345 << 30 | s7_345 >> 0x02;
	ui32 s1_175 = (word32) a1->b0034 << 24 | (word32) a1->b0035 << 16 | (word32) a1->b0037 | (word32) a1->b0036 << 8;
	uint32 a1_371 = (s5_358 << 0x05 | s5_358 >> 0x1B) + (((s10_342 ^ s6_355) & s7_345 ^ s10_342) + ((a5_160 + 0x5A827999) + s9_329));
	ui32 s5_381 = s5_358 << 30 | s5_358 >> 0x02;
	ui32 s0_185 = (word32) a1->b0038 << 24 | (word32) a1->b0039 << 16 | (word32) a1->b003B | (word32) a1->b003A << 8;
	uint32 s10_382 = (a1_371 << 0x05 | a1_371 >> 0x1B) + (((s6_355 ^ s7_368) & s5_358 ^ s6_355) + (s10_342 + (s1_175 + 0x5A827999)));
	uint32 a2_410 = a2_43 ^ a3_62 ^ t6_126 ^ s1_175;
	ui32 a1_394 = a1_371 << 30 | a1_371 >> 0x02;
	ui32 t2_193 = (word32) a1->b003C << 24 | (word32) a1->b003D << 16 | (word32) a1->b003F | a1_190 << 8;
	uint32 s11_397 = (s10_382 << 0x05 | s10_382 >> 0x1B) + (((s7_368 ^ s5_381) & a1_371 ^ s7_368) + ((s0_185 + 0x5A827999) + s6_355));
	uint32 a4_425 = a4_54 ^ t0_70 ^ t4_134 ^ s0_185;
	ui32 s10_409 = s10_382 << 30 | s10_382 >> 0x02;
	ui32 a2_415 = a2_410 >> 31 | a2_410 << 0x01;
	uint32 s7_411 = (s11_397 << 0x05 | s11_397 >> 0x1B) + (((s5_381 ^ a1_394) & s10_382 ^ s5_381) + (s7_368 + (t2_193 + 0x5A827999)));
	uint32 a3_448 = a3_62 ^ t5_80 ^ t1_142 ^ t2_193;
	ui32 s11_429 = s11_397 << 30 | s11_397 >> 0x02;
	ui32 a4_432 = a4_425 >> 31 | a4_425 << 0x01;
	uint32 s9_435 = (s7_411 << 0x05 | s7_411 >> 0x1B) + (((a1_394 ^ s10_409) & s11_397 ^ a1_394) + ((a2_415 + 0x5A827999) + s5_381));
	uint32 t0_463 = t0_70 ^ t3_94 ^ a6_150 ^ a2_415;
	ui32 s7_447 = s7_411 << 30 | s7_411 >> 0x02;
	ui32 a3_453 = a3_448 >> 31 | a3_448 << 0x01;
	uint32 a1_449 = (s9_435 << 0x05 | s9_435 >> 0x1B) + (((s10_409 ^ s11_429) & s7_411 ^ s10_409) + (a1_394 + (a4_432 + 0x5A827999)));
	uint32 t5_482 = t5_80 ^ a7_108 ^ a5_160 ^ a4_432;
	ui32 s9_467 = s9_435 << 30 | s9_435 >> 0x02;
	ui32 t0_470 = t0_463 >> 0x1F | t0_463 << 0x01;
	uint32 s6_474 = (a1_449 << 0x05 | a1_449 >> 0x1B) + (((s11_429 ^ s7_447) & s9_435 ^ s11_429) + ((a3_453 + 0x5A827999) + s10_409));
	uint32 t3_502 = t3_94 ^ s8_118 ^ s1_175 ^ a3_453;
	ui32 a1_486 = a1_449 << 30 | a1_449 >> 0x02;
	ui32 t5_489 = t5_482 >> 0x1F | t5_482 << 0x01;
	uint32 s5_492 = (s6_474 << 0x05 | s6_474 >> 0x1B) + (((s7_447 ^ s9_467) & a1_449 ^ s7_447) + ((t0_470 + 0x5A827999) + s11_429));
	uint32 a7_520 = a7_108 ^ t6_126 ^ s0_185 ^ t0_470;
	ui32 s6_506 = s6_474 << 30 | s6_474 >> 0x02;
	ui32 t3_509 = t3_502 >> 0x1F | t3_502 << 0x01;
	uint32 s7_511 = (s5_492 << 0x05 | s5_492 >> 0x1B) + (((s9_467 ^ a1_486) ^ s6_474) + (s7_447 + (t5_489 + 1859775393)));
	uint32 a1_542 = s8_118 ^ t4_134 ^ t2_193 ^ t5_489;
	ui32 s5_524 = s5_492 << 30 | s5_492 >> 0x02;
	ui32 a7_528 = a7_520 >> 0x1F | a7_520 << 0x01;
	uint32 s10_527 = (s7_511 << 0x05 | s7_511 >> 0x1B) + (((a1_486 ^ s6_506) ^ s5_492) + ((t3_509 + 1859775393) + s9_467));
	uint32 t6_556 = t6_126 ^ t1_142 ^ a2_415 ^ t3_509;
	ui32 s7_539 = s7_511 << 30 | s7_511 >> 0x02;
	ui32 a1_545 = a1_542 >> 31 | a1_542 << 0x01;
	uint32 s11_547 = (s10_527 << 0x05 | s10_527 >> 0x1B) + (((s6_506 ^ s5_524) ^ s7_511) + ((a7_528 + 1859775393) + a1_486));
	uint32 t4_574 = t4_134 ^ a6_150 ^ a4_432 ^ a7_528;
	ui32 s10_560 = s10_527 << 30 | s10_527 >> 0x02;
	ui32 t6_563 = t6_556 >> 0x1F | t6_556 << 0x01;
	uint32 s6_565 = (s11_547 << 0x05 | s11_547 >> 0x1B) + (((s5_524 ^ s7_539) ^ s10_527) + (s6_506 + (a1_545 + 1859775393)));
	uint32 t1_592 = t1_142 ^ a5_160 ^ a3_453 ^ a1_545;
	ui32 s11_578 = s11_547 << 30 | s11_547 >> 0x02;
	ui32 t4_581 = t4_574 >> 0x1F | t4_574 << 0x01;
	uint32 s5_583 = (s6_565 << 0x05 | s6_565 >> 0x1B) + (((s7_539 ^ s10_560) ^ s11_547) + (s5_524 + (t6_563 + 1859775393)));
	uint32 a6_610 = a6_150 ^ s1_175 ^ t0_470 ^ t6_563;
	ui32 s6_596 = s6_565 << 30 | s6_565 >> 0x02;
	ui32 t1_600 = t1_592 >> 0x1F | t1_592 << 0x01;
	uint32 s7_599 = (s5_583 << 0x05 | s5_583 >> 0x1B) + (((s10_560 ^ s11_578) ^ s6_565) + (s7_539 + (t4_581 + 1859775393)));
	uint32 a5_628 = a5_160 ^ s0_185 ^ t5_489 ^ t4_581;
	ui32 s5_614 = s5_583 << 30 | s5_583 >> 0x02;
	ui32 a6_617 = a6_610 >> 0x1F | a6_610 << 0x01;
	uint32 s9_619 = (s7_599 << 0x05 | s7_599 >> 0x1B) + (((s11_578 ^ s6_596) ^ s5_583) + ((t1_600 + 1859775393) + s10_560));
	uint32 s1_646 = s1_175 ^ t2_193 ^ t3_509 ^ t1_600;
	ui32 s7_632 = s7_599 << 30 | s7_599 >> 0x02;
	ui32 a5_635 = a5_628 >> 31 | a5_628 << 0x01;
	uint32 s8_637 = (s9_619 << 0x05 | s9_619 >> 0x1B) + (((s6_596 ^ s5_614) ^ s7_599) + ((a6_617 + 1859775393) + s11_578));
	uint32 s0_664 = s0_185 ^ a2_415 ^ a7_528 ^ a6_617;
	ui32 s9_650 = s9_619 << 30 | s9_619 >> 0x02;
	ui32 s1_653 = s1_646 >> 31 | s1_646 << 0x01;
	uint32 s6_655 = (s8_637 << 0x05 | s8_637 >> 0x1B) + (((s5_614 ^ s7_632) ^ s9_619) + (s6_596 + (a5_635 + 1859775393)));
	uint32 t2_682 = t2_193 ^ a4_432 ^ a1_545 ^ a5_635;
	ui32 s8_668 = s8_637 << 30 | s8_637 >> 0x02;
	ui32 s0_671 = s0_664 >> 31 | s0_664 << 0x01;
	uint32 s5_673 = (s6_655 << 0x05 | s6_655 >> 0x1B) + (((s7_632 ^ s9_650) ^ s8_637) + (s5_614 + (s1_653 + 1859775393)));
	uint32 a2_700 = a2_415 ^ a3_453 ^ t6_563 ^ s1_653;
	ui32 s6_686 = s6_655 << 30 | s6_655 >> 0x02;
	ui32 t2_689 = t2_682 >> 0x1F | t2_682 << 0x01;
	uint32 s7_691 = (s5_673 << 0x05 | s5_673 >> 0x1B) + (((s9_650 ^ s8_668) ^ s6_655) + (s7_632 + (s0_671 + 1859775393)));
	uint32 a4_718 = a4_432 ^ t0_470 ^ t4_581 ^ s0_671;
	ui32 s5_704 = s5_673 << 30 | s5_673 >> 0x02;
	ui32 a2_708 = a2_700 >> 31 | a2_700 << 0x01;
	uint32 s10_707 = (s7_691 << 0x05 | s7_691 >> 0x1B) + (((s8_668 ^ s6_686) ^ s5_673) + ((t2_689 + 1859775393) + s9_650));
	uint32 a3_736 = a3_453 ^ t5_489 ^ t1_600 ^ t2_689;
	ui32 s7_722 = s7_691 << 30 | s7_691 >> 0x02;
	ui32 a4_725 = a4_718 >> 31 | a4_718 << 0x01;
	uint32 s11_727 = (s10_707 << 0x05 | s10_707 >> 0x1B) + (((s6_686 ^ s5_704) ^ s7_691) + ((a2_708 + 1859775393) + s8_668));
	uint32 t0_754 = t0_470 ^ t3_509 ^ a6_617 ^ a2_708;
	ui32 s10_740 = s10_707 << 30 | s10_707 >> 0x02;
	ui32 a3_743 = a3_736 >> 31 | a3_736 << 0x01;
	uint32 s6_745 = (s11_727 << 0x05 | s11_727 >> 0x1B) + (((s5_704 ^ s7_722) ^ s10_707) + (s6_686 + (a4_725 + 1859775393)));
	uint32 t5_772 = t5_489 ^ a7_528 ^ a5_635 ^ a4_725;
	ui32 s11_758 = s11_727 << 30 | s11_727 >> 0x02;
	ui32 t0_762 = t0_754 >> 0x1F | t0_754 << 0x01;
	uint32 s5_761 = (s6_745 << 0x05 | s6_745 >> 0x1B) + (((s7_722 ^ s10_740) ^ s11_727) + (s5_704 + (a3_743 + 1859775393)));
	uint32 t3_790 = t3_509 ^ a1_545 ^ s1_653 ^ a3_743;
	ui32 s6_776 = s6_745 << 30 | s6_745 >> 0x02;
	ui32 t5_780 = t5_772 >> 0x1F | t5_772 << 0x01;
	uint32 s9_779 = (s5_761 << 0x05 | s5_761 >> 0x1B) + (((s10_740 ^ s11_758) ^ s6_745) + ((t0_762 + 1859775393) + s7_722));
	uint32 a7_808 = a7_528 ^ t6_563 ^ s0_671 ^ t0_762;
	ui32 s5_794 = s5_761 << 30 | s5_761 >> 0x02;
	ui32 t3_797 = t3_790 >> 0x1F | t3_790 << 0x01;
	uint32 s8_799 = (s9_779 << 0x05 | s9_779 >> 0x1B) + (((s11_758 ^ s6_776) ^ s5_761) + ((t5_780 + 1859775393) + s10_740));
	uint32 a1_826 = a1_545 ^ t4_581 ^ t2_689 ^ t5_780;
	ui32 s9_812 = s9_779 << 30 | s9_779 >> 0x02;
	ui32 a7_815 = a7_808 >> 0x1F | a7_808 << 0x01;
	uint32 s11_817 = (s8_799 << 0x05 | s8_799 >> 0x1B) + (((s6_776 ^ s5_794) ^ s9_779) + (s11_758 + (t3_797 + 1859775393)));
	uint32 t6_844 = t6_563 ^ t1_600 ^ a2_708 ^ t3_797;
	ui32 s8_830 = s8_799 << 30 | s8_799 >> 0x02;
	ui32 a1_833 = a1_826 >> 31 | a1_826 << 0x01;
	uint32 s7_834 = (s11_817 << 0x05 | s11_817 >> 0x1B) + (((s5_794 ^ s9_812) ^ s8_799) + ((a7_815 + 1859775393) + s6_776));
	uint32 t4_870 = t4_581 ^ a6_617 ^ a4_725 ^ a7_815;
	ui32 t6_851 = t6_844 >> 0x1F | t6_844 << 0x01;
	uint32 s10_854 = (s7_834 << 0x05 | s7_834 >> 0x1B) + (((s9_812 ^ s8_830) ^ s11_817) + ((a1_833 + 1859775393) + s5_794));
	ui32 s11_848 = s11_817 << 30 | s11_817 >> 0x02;
	uint32 t1_886 = t1_600 ^ a5_635 ^ a3_743 ^ a1_833;
	ui32 s7_869 = s7_834 << 30 | s7_834 >> 0x02;
	ui32 t4_875 = t4_870 >> 0x1F | t4_870 << 0x01;
	uint32 s9_871 = ((s7_834 | s11_848) & s8_830 | s7_834 & s11_848) + (((t6_851 + 2400959708) + s9_812) + (s10_854 << 0x05 | s10_854 >> 0x1B));
	uint32 a6_906 = a6_617 ^ s1_653 ^ t0_762 ^ t6_851;
	ui32 t1_893 = t1_886 >> 0x1F | t1_886 << 0x01;
	uint32 s6_894 = (s9_871 << 0x05 | s9_871 >> 0x1B) + (((s10_854 | s7_869) & s11_848 | s10_854 & s7_869) + ((t4_875 + 2400959708) + s8_830));
	ui32 s10_890 = s10_854 << 30 | s10_854 >> 0x02;
	uint32 a5_926 = a5_635 ^ s0_671 ^ t5_780 ^ t4_875;
	ui32 s9_910 = s9_871 << 30 | s9_871 >> 0x02;
	ui32 a6_913 = a6_906 >> 0x1F | a6_906 << 0x01;
	uint32 s11_915 = ((s9_871 | s10_890) & s7_869 | s9_871 & s10_890) + (((t1_893 + 2400959708) + s11_848) + (s6_894 << 0x05 | s6_894 >> 0x1B));
	uint32 s1_950 = s1_653 ^ t2_689 ^ t3_797 ^ t1_893;
	ui32 a5_933 = a5_926 >> 31 | a5_926 << 0x01;
	uint32 s5_934 = (s11_915 << 0x05 | s11_915 >> 0x1B) + (((s6_894 | s9_910) & s10_890 | s6_894 & s9_910) + ((a6_913 + 2400959708) + s7_869));
	ui32 s6_930 = s6_894 << 30 | s6_894 >> 0x02;
	uint32 s0_966 = s0_671 ^ a2_708 ^ a7_815 ^ a6_913;
	ui32 s11_949 = s11_915 << 30 | s11_915 >> 0x02;
	ui32 s1_955 = s1_950 >> 31 | s1_950 << 0x01;
	uint32 s10_951 = ((s11_915 | s6_930) & s9_910 | s11_915 & s6_930) + (((a5_933 + 2400959708) + s10_890) + (s5_934 << 0x05 | s5_934 >> 0x1B));
	uint32 t2_986 = t2_689 ^ a4_725 ^ a1_833 ^ a5_933;
	ui32 s0_973 = s0_966 >> 31 | s0_966 << 0x01;
	uint32 s8_974 = (s10_951 << 0x05 | s10_951 >> 0x1B) + (((s5_934 | s11_949) & s6_930 | s5_934 & s11_949) + ((s1_955 + 2400959708) + s9_910));
	ui32 s5_970 = s5_934 << 30 | s5_934 >> 0x02;
	uint32 a2_1006 = a2_708 ^ a3_743 ^ t6_851 ^ s1_955;
	ui32 s10_990 = s10_951 << 30 | s10_951 >> 0x02;
	ui32 t2_993 = t2_986 >> 0x1F | t2_986 << 0x01;
	uint32 s6_995 = ((s10_951 | s5_970) & s11_949 | s10_951 & s5_970) + (((s0_973 + 2400959708) + s6_930) + (s8_974 << 0x05 | s8_974 >> 0x1B));
	uint32 a4_1026 = a4_725 ^ t0_762 ^ t4_875 ^ s0_973;
	ui32 a2_1013 = a2_1006 >> 31 | a2_1006 << 0x01;
	uint32 s7_1014 = (s6_995 << 0x05 | s6_995 >> 0x1B) + (((s8_974 | s10_990) & s5_970 | s8_974 & s10_990) + ((t2_993 + 2400959708) + s11_949));
	ui32 s8_1010 = s8_974 << 30 | s8_974 >> 0x02;
	uint32 a3_1046 = a3_743 ^ t5_780 ^ t1_893 ^ t2_993;
	ui32 s6_1030 = s6_995 << 30 | s6_995 >> 0x02;
	ui32 a4_1033 = a4_1026 >> 31 | a4_1026 << 0x01;
	uint32 s5_1035 = ((s6_995 | s8_1010) & s10_990 | s6_995 & s8_1010) + (((a2_1013 + 2400959708) + s5_970) + (s7_1014 << 0x05 | s7_1014 >> 0x1B));
	uint32 t0_1066 = t0_762 ^ t3_797 ^ a6_913 ^ a2_1013;
	ui32 a3_1053 = a3_1046 >> 31 | a3_1046 << 0x01;
	uint32 s9_1054 = (s5_1035 << 0x05 | s5_1035 >> 0x1B) + (((s7_1014 | s6_1030) & s8_1010 | s7_1014 & s6_1030) + ((a4_1033 + 2400959708) + s10_990));
	ui32 s7_1050 = s7_1014 << 30 | s7_1014 >> 0x02;
	uint32 t5_1086 = t5_780 ^ a7_815 ^ a5_933 ^ a4_1033;
	ui32 s5_1070 = s5_1035 << 30 | s5_1035 >> 0x02;
	ui32 t0_1073 = t0_1066 >> 0x1F | t0_1066 << 0x01;
	uint32 s8_1075 = ((s5_1035 | s7_1050) & s6_1030 | s5_1035 & s7_1050) + (((a3_1053 + 2400959708) + s8_1010) + (s9_1054 << 0x05 | s9_1054 >> 0x1B));
	uint32 t3_1106 = t3_797 ^ a1_833 ^ s1_955 ^ a3_1053;
	ui32 t5_1093 = t5_1086 >> 0x1F | t5_1086 << 0x01;
	uint32 s6_1094 = (s8_1075 << 0x05 | s8_1075 >> 0x1B) + (((s9_1054 | s5_1070) & s7_1050 | s9_1054 & s5_1070) + (s6_1030 + (t0_1073 + 2400959708)));
	ui32 s9_1090 = s9_1054 << 30 | s9_1054 >> 0x02;
	uint32 a7_1126 = a7_815 ^ t6_851 ^ s0_973 ^ t0_1073;
	ui32 s8_1110 = s8_1075 << 30 | s8_1075 >> 0x02;
	ui32 t3_1113 = t3_1106 >> 0x1F | t3_1106 << 0x01;
	uint32 s7_1115 = ((s8_1075 | s9_1090) & s5_1070 | s8_1075 & s9_1090) + (((t5_1093 + 2400959708) + s7_1050) + (s6_1094 << 0x05 | s6_1094 >> 0x1B));
	uint32 a1_1146 = a1_833 ^ t4_875 ^ t2_993 ^ t5_1093;
	ui32 a7_1133 = a7_1126 >> 0x1F | a7_1126 << 0x01;
	uint32 s5_1134 = (s7_1115 << 0x05 | s7_1115 >> 0x1B) + (((s6_1094 | s8_1110) & s9_1090 | s6_1094 & s8_1110) + (s5_1070 + (t3_1113 + 2400959708)));
	ui32 s6_1130 = s6_1094 << 30 | s6_1094 >> 0x02;
	uint32 t6_1166 = t6_851 ^ t1_893 ^ a2_1013 ^ t3_1113;
	ui32 s7_1150 = s7_1115 << 30 | s7_1115 >> 0x02;
	ui32 a1_1153 = a1_1146 >> 31 | a1_1146 << 0x01;
	uint32 s9_1155 = ((s7_1115 | s6_1130) & s8_1110 | s7_1115 & s6_1130) + (((a7_1133 + 2400959708) + s9_1090) + (s5_1134 << 0x05 | s5_1134 >> 0x1B));
	uint32 t4_1186 = t4_875 ^ a6_913 ^ a4_1033 ^ a7_1133;
	ui32 t6_1173 = t6_1166 >> 0x1F | t6_1166 << 0x01;
	uint32 s8_1174 = (s9_1155 << 0x05 | s9_1155 >> 0x1B) + (((s5_1134 | s7_1150) & s6_1130 | s5_1134 & s7_1150) + (s8_1110 + (a1_1153 + 2400959708)));
	ui32 s5_1170 = s5_1134 << 30 | s5_1134 >> 0x02;
	uint32 t1_1206 = t1_893 ^ a5_933 ^ a3_1053 ^ a1_1153;
	ui32 s9_1190 = s9_1155 << 30 | s9_1155 >> 0x02;
	ui32 t4_1193 = t4_1186 >> 0x1F | t4_1186 << 0x01;
	uint32 s6_1195 = ((s9_1155 | s5_1170) & s7_1150 | s9_1155 & s5_1170) + (((t6_1173 + 2400959708) + s6_1130) + (s8_1174 << 0x05 | s8_1174 >> 0x1B));
	uint32 a6_1226 = a6_913 ^ s1_955 ^ t0_1073 ^ t6_1173;
	ui32 t1_1213 = t1_1206 >> 0x1F | t1_1206 << 0x01;
	uint32 s7_1214 = (s6_1195 << 0x05 | s6_1195 >> 0x1B) + (((s8_1174 | s9_1190) & s5_1170 | s8_1174 & s9_1190) + (s7_1150 + (t4_1193 + 2400959708)));
	ui32 s8_1210 = s8_1174 << 30 | s8_1174 >> 0x02;
	uint32 a5_1242 = a5_933 ^ s0_973 ^ t5_1093 ^ t4_1193;
	ui32 s6_1230 = s6_1195 << 30 | s6_1195 >> 0x02;
	ui32 a6_1233 = a6_1226 >> 0x1F | a6_1226 << 0x01;
	uint32 s5_1238 = ((s6_1195 | s8_1210) & s9_1190 | s6_1195 & s8_1210) + (((t1_1213 + 2400959708) + s5_1170) + (s7_1214 << 0x05 | s7_1214 >> 0x1B));
	uint32 s1_1266 = s1_955 ^ t2_993 ^ t3_1113 ^ t1_1213;
	ui32 s7_1245 = s7_1214 << 30 | s7_1214 >> 0x02;
	ui32 a5_1249 = a5_1242 >> 31 | a5_1242 << 0x01;
	uint32 s9_1256 = (s5_1238 << 0x05 | s5_1238 >> 0x1B) + (((s7_1214 | s6_1230) & s8_1210 | s7_1214 & s6_1230) + (s9_1190 + (a6_1233 + 2400959708)));
	uint32 s0_1284 = s0_973 ^ a2_1013 ^ a7_1133 ^ a6_1233;
	ui32 s5_1270 = s5_1238 << 30 | s5_1238 >> 0x02;
	ui32 s1_1273 = s1_1266 >> 31 | s1_1266 << 0x01;
	uint32 s8_1275 = (s9_1256 << 0x05 | s9_1256 >> 0x1B) + (((s6_1230 ^ s7_1245) ^ s5_1238) + (s8_1210 + (a5_1249 + 0xCA62C1D6)));
	uint32 t2_1302 = t2_993 ^ a4_1033 ^ a1_1153 ^ a5_1249;
	ui32 s9_1288 = s9_1256 << 30 | s9_1256 >> 0x02;
	ui32 s0_1291 = s0_1284 >> 31 | s0_1284 << 0x01;
	uint32 s6_1293 = (s8_1275 << 0x05 | s8_1275 >> 0x1B) + (((s7_1245 ^ s5_1270) ^ s9_1256) + (s6_1230 + (s1_1273 + 0xCA62C1D6)));
	uint32 a2_1320 = a2_1013 ^ a3_1053 ^ t6_1173 ^ s1_1273;
	ui32 s8_1306 = s8_1275 << 30 | s8_1275 >> 0x02;
	ui32 t2_1309 = t2_1302 >> 0x1F | t2_1302 << 0x01;
	uint32 s7_1311 = (s6_1293 << 0x05 | s6_1293 >> 0x1B) + (((s5_1270 ^ s9_1288) ^ s8_1275) + (s7_1245 + (s0_1291 + 0xCA62C1D6)));
	uint32 a4_1338 = a4_1033 ^ t0_1073 ^ t4_1193 ^ s0_1291;
	ui32 s6_1324 = s6_1293 << 30 | s6_1293 >> 0x02;
	ui32 a2_1327 = a2_1320 >> 31 | a2_1320 << 0x01;
	uint32 s5_1329 = (s7_1311 << 0x05 | s7_1311 >> 0x1B) + (((s9_1288 ^ s8_1306) ^ s6_1293) + (s5_1270 + (t2_1309 + 0xCA62C1D6)));
	uint32 a3_1356 = a3_1053 ^ t5_1093 ^ t1_1213 ^ t2_1309;
	ui32 s7_1342 = s7_1311 << 30 | s7_1311 >> 0x02;
	ui32 a4_1345 = a4_1338 >> 31 | a4_1338 << 0x01;
	uint32 s9_1347 = (s5_1329 << 0x05 | s5_1329 >> 0x1B) + (((s8_1306 ^ s6_1324) ^ s7_1311) + (s9_1288 + (a2_1327 + 0xCA62C1D6)));
	uint32 t0_1375 = t0_1073 ^ t3_1113 ^ a6_1233 ^ a2_1327;
	ui32 s5_1360 = s5_1329 << 30 | s5_1329 >> 0x02;
	ui32 a3_1363 = a3_1356 >> 31 | a3_1356 << 0x01;
	uint32 s8_1365 = (s9_1347 << 0x05 | s9_1347 >> 0x1B) + (((s6_1324 ^ s7_1342) ^ s5_1329) + (s8_1306 + (a4_1345 + 0xCA62C1D6)));
	uint32 t5_1392 = t5_1093 ^ a7_1133 ^ a5_1249 ^ a4_1345;
	ui32 s9_1378 = s9_1347 << 30 | s9_1347 >> 0x02;
	ui32 t0_1381 = t0_1375 >> 0x1F | t0_1375 << 0x01;
	uint32 s6_1383 = (s8_1365 << 0x05 | s8_1365 >> 0x1B) + (((s7_1342 ^ s5_1360) ^ s9_1347) + (s6_1324 + (a3_1363 + 0xCA62C1D6)));
	uint32 t3_1410 = t3_1113 ^ a1_1153 ^ s1_1273 ^ a3_1363;
	ui32 s8_1396 = s8_1365 << 30 | s8_1365 >> 0x02;
	ui32 t5_1399 = t5_1392 >> 0x1F | t5_1392 << 0x01;
	uint32 s7_1401 = (s6_1383 << 0x05 | s6_1383 >> 0x1B) + (((s5_1360 ^ s9_1378) ^ s8_1365) + (s7_1342 + (t0_1381 + 0xCA62C1D6)));
	uint32 a7_1428 = a7_1133 ^ t6_1173 ^ s0_1291 ^ t0_1381;
	ui32 s6_1414 = s6_1383 << 30 | s6_1383 >> 0x02;
	ui32 t3_1417 = t3_1410 >> 0x1F | t3_1410 << 0x01;
	uint32 s5_1419 = (s7_1401 << 0x05 | s7_1401 >> 0x1B) + (((s9_1378 ^ s8_1396) ^ s6_1383) + (s5_1360 + (t5_1399 + 0xCA62C1D6)));
	uint32 a1_1446 = a1_1153 ^ t4_1193 ^ t2_1309 ^ t5_1399;
	ui32 s7_1432 = s7_1401 << 30 | s7_1401 >> 0x02;
	ui32 a7_1435 = a7_1428 >> 0x1F | a7_1428 << 0x01;
	uint32 s9_1437 = (s5_1419 << 0x05 | s5_1419 >> 0x1B) + (((s8_1396 ^ s6_1414) ^ s7_1401) + (s9_1378 + (t3_1417 + 0xCA62C1D6)));
	uint32 t6_1464 = t6_1173 ^ t1_1213 ^ a2_1327 ^ t3_1417;
	ui32 s5_1450 = s5_1419 << 30 | s5_1419 >> 0x02;
	ui32 a1_1453 = a1_1446 >> 31 | a1_1446 << 0x01;
	uint32 s8_1455 = (s9_1437 << 0x05 | s9_1437 >> 0x1B) + (((s6_1414 ^ s7_1432) ^ s5_1419) + (s8_1396 + (a7_1435 + 0xCA62C1D6)));
	uint32 t4_1482 = t4_1193 ^ a6_1233 ^ a4_1345 ^ a7_1435;
	ui32 s9_1468 = s9_1437 << 30 | s9_1437 >> 0x02;
	ui32 t6_1471 = t6_1464 >> 0x1F | t6_1464 << 0x01;
	uint32 s6_1473 = (s8_1455 << 0x05 | s8_1455 >> 0x1B) + (((s7_1432 ^ s5_1450) ^ s9_1437) + (s6_1414 + (a1_1453 + 0xCA62C1D6)));
	uint32 a3_1500 = t1_1213 ^ a5_1249 ^ a3_1363 ^ a1_1453;
	ui32 s8_1486 = s8_1455 << 30 | s8_1455 >> 0x02;
	ui32 t4_1489 = t4_1482 >> 0x1F | t4_1482 << 0x01;
	uint32 s7_1491 = (s6_1473 << 0x05 | s6_1473 >> 0x1B) + (((s5_1450 ^ s9_1468) ^ s8_1455) + (s7_1432 + (t6_1471 + 0xCA62C1D6)));
	uint32 t6_1517 = a6_1233 ^ s1_1273 ^ t0_1381 ^ t6_1471;
	ui32 s6_1504 = s6_1473 << 30 | s6_1473 >> 0x02;
	ui32 a3_1507 = a3_1500 >> 31 | a3_1500 << 0x01;
	uint32 s5_1511 = (s7_1491 << 0x05 | s7_1491 >> 0x1B) + (((s9_1468 ^ s8_1486) ^ s6_1473) + (s5_1450 + (t4_1489 + 0xCA62C1D6)));
	uint32 t4_1536 = a5_1249 ^ s0_1291 ^ t5_1399 ^ t4_1489;
	ui32 s7_1524 = s7_1491 << 30 | s7_1491 >> 0x02;
	ui32 t6_1525 = t6_1517 >> 0x1F | t6_1517 << 0x01;
	uint32 s9_1528 = s9_1468 + (a3_1507 + 0xCA62C1D6) + ((s8_1486 ^ s6_1504) ^ s7_1491) + (s5_1511 << 0x05 | s5_1511 >> 0x1B);
	Eq_340479 s1_1547 = s1_1273 ^ t2_1309;
	ui32 s5_1543 = s5_1511 << 30 | s5_1511 >> 0x02;
	ui32 t4_1544 = t4_1536 >> 0x1F | t4_1536 << 0x01;
	uint32 s8_1538 = (s9_1528 << 0x05 | s9_1528 >> 0x1B) + (((s6_1504 ^ s7_1524) ^ s5_1511) + (s8_1486 + (t6_1525 + 0xCA62C1D6)));
	uint32 a3_1554 = s1_1547 ^ t3_1417 ^ a3_1507;
	ui32 s9_1562 = s9_1528 << 30 | s9_1528 >> 0x02;
	uint32 s6_1558 = s6_1504 + (t4_1544 + 0xCA62C1D6) + ((s7_1524 ^ s5_1543) ^ s9_1528) + (s8_1538 << 0x05 | s8_1538 >> 0x1B);
	uint32 t6_1573 = s0_1291 ^ a2_1327 ^ a7_1435 ^ t6_1525;
	ui32 s8_1579 = s8_1538 << 30 | s8_1538 >> 0x02;
	uint32 s7_1574 = s7_1524 + ((a3_1554 << 0x01 | a3_1554 >> 31) + 0xCA62C1D6) + ((s5_1543 ^ s9_1562) ^ s8_1538) + (s6_1558 << 0x05 | s6_1558 >> 0x1B);
	uint32 s5_1594 = s5_1543 + ((t6_1573 << 0x01 | t6_1573 >> 0x1F) + 0xCA62C1D6) + ((s9_1562 ^ s8_1579) ^ s6_1558) + (s7_1574 << 0x05 | s7_1574 >> 0x1B);
	uint32 t4_1588 = t2_1309 ^ a4_1345 ^ a1_1453 ^ t4_1544;
	ui32 s6_1599 = s6_1558 << 30 | s6_1558 >> 0x02;
	struct Eq_346522 * a5_1606 = s5_1594 << 0x05 | s5_1594 >> 0x1B;
	a5_1606->ptr000C->dw0008 = a5_1606 + ((s9_1562 + ((t4_1588 << 0x01 | t4_1588 >> 0x1F) + ((word32) s3_173 - 899497514))) + ((s8_1579 ^ s6_1599) ^ s7_1574)) / 16;
	Eq_340483 s5_1612 = a5_1606 + s5_1594 / 16;
	(s7_1574 >> 0x02)->ptr0014->t000C = s5_1612;
	struct Eq_346557 * a0_1620 = (s7_1574 >> 0x02)->ptr0018;
