pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 230688C8: Register word32 mbedtls_ssl_list_ciphersuites(Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      mbedtls_ssl_config_defaults
word32 mbedtls_ssl_list_ciphersuites(ptr32 & a0Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out)
{
	struct Eq_268327 * a4_5 = g_ptr4200E01C;
	if (a4_5 == null)
	{
		word32 * s0_22 = &g_dw42018E40;
		s2 = 0x4200E01C;
		int32 * s1_25 = g_a2308C164;
		s5 = 0x42018E54;
		while (true)
		{
			struct Eq_268327 * s3_29 = *s1_25;
			if (s3_29 == null || s0_22 >= &g_dw42018E54)
				break;
			word32 a5_123;
			if (mbedtls_ssl_ciphersuite_from_id(s3_29, a4_5, out a5_123) != null)
			{
				*s0_22 = s3_29;
				++s0_22;
			}
			++s1_25;
		}
		*s0_22 = 0x00;
		g_ptr4200E01C = (struct Eq_268327 *) 0x01;
	}
	a0Out = 0x42018E40;
	s2Out = s2;
	s4Out = dwArg04;
	s5Out = s5;
	return s1;
}

// 2306893A: Register (ptr32 Eq_268327) mbedtls_ssl_get_ciphersuite_name(Register (ptr32 Eq_268327) a0, Register (ptr32 Eq_268327) a4)
// Called from:
//      mbedtls_ssl_derive_keys
//      mbedtls_ssl_get_ciphersuite
struct Eq_268327 * mbedtls_ssl_get_ciphersuite_name(struct Eq_268327 * a0, struct Eq_268327 * a4)
{
	struct Eq_268327 * a0_11;
	word32 a5_22;
	struct Eq_346992 * a0_8 = mbedtls_ssl_ciphersuite_from_id(a0, a4, out a5_22);
	if (a0_8 != null)
		a0_11 = a0_8->ptr0004;
	else
		a0_11 = &g_t23089244;
	return a0_11;
}

// 23068956: Register (ptr32 Eq_347014) mbedtls_ssl_get_ciphersuite_sig_pk_alg(Register (ptr32 Eq_347014) a0)
// Called from:
//      mbedtls_ssl_handshake_server_step
struct Eq_347014 * mbedtls_ssl_get_ciphersuite_sig_pk_alg(struct Eq_347014 * a0)
{
	struct Eq_347014 * a0_11;
	up32 a0_5 = (word32) a0->b000A;
	if (a0_5 > 0x0A)
	{
		a0_11 = null;
		return a0_11;
	}
	else
	{
		ui32 a5_9 = 0x01 << a0_5;
		a0_11 = (struct Eq_347014 *) 0x01;
		if ((a5_9 & 0x008E) != 0x00)
			return a0_11;
		a0_11 = (struct Eq_347014 *) 0x02;
		if ((a5_9 & 0x0600) != 0x00)
			return a0_11;
		return (word32) ((a5_9 & 0x10) != 0x00) << 2;
	}
}

// 23068984: void mbedtls_ssl_own_key(Register (ptr32 Eq_347044) a5)
void mbedtls_ssl_own_key(struct Eq_347044 * a5)
{
	if (a5 != null)
	{
		a5 = a5->ptr0008;
		if (a5 != null)
			return;
	}
	if (a5->dw004C == 0x00)
		;
}

// 23068998: void mbedtls_ssl_hs_hdr_len.isra.0(Register (ptr32 Eq_347057) a0)
void mbedtls_ssl_hs_hdr_len.isra.0(struct Eq_347057 * a0)
{
	if (((word32) a0->w0074 & 0x02) == 0x00)
		;
}

// 230689A8: Register Eq_2 mbedtls_ssl_handshake_client_step(Register Eq_2 ra, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg88, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_297387) a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_handshake_step
Eq_2 mbedtls_ssl_handshake_client_step(Eq_2 ra, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg88, union Eq_2 & s1Out, ptr32 & a0Out, struct Eq_297387 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	struct Eq_347066 * sp_1690 = fp + -0x00A0;
	if (a5 == 0x10)
	{
l23068AF0:
		goto l23068A62;
	}
	Eq_2 a0_33 = *(union Eq_2 *) 0x40;
	if (false)
		goto l23068AF0;
	Eq_2 a5_43;
	Eq_2 s11_50;
	word32 t4_1844;
	word32 s10_1843;
	word32 s9_1842;
	word32 s8_1841;
	word32 s7_1840;
	word32 s5_1838;
	word32 s6_1839;
	word32 a7_1836;
	word32 s4_1837;
	word32 a4_1835;
	word32 a1_1832;
	word32 a2_1833;
	word32 a3_1834;
	mbedtls_debug_print_msg(ra, a0_33, 0x02, &g_t2308C4DC, a5, out a1_1832, out a2_1833, out a3_1834, out a4_1835, out a5_43, out a7_1836, out s4_1837, out s5_1838, out s6_1839, out s7_1840, out s8_1841, out s9_1842, out s10_1843, out s11_50, out t4_1844);
	Eq_2 a0_62;
	Eq_2 s2_74;
	word32 s10_1854;
	word32 s9_1853;
	word32 s7_1852;
	word32 s6_1851;
	word32 s5_1850;
	word32 s4_1849;
	word32 a3_1847;
	word32 a4_1848;
	word32 a2_1846;
	word32 a1_1845;
	Eq_2 s11_108;
	mbedtls_ssl_flush_output(ra, s11_50, a5_43, dwArg88, out s1, out a0_62, out a1_1845, out a2_1846, out a3_1847, out a4_1848, out a5, out s2_74, out s3, out s4_1849, out s5_1850, out s6_1851, out s7_1852, out s9_1853, out s10_1854, out s11_108);
	Eq_2 s0_105 = a0_62;
	if (a0_62 == 0x00)
	{
		if (((word32) *((word32) *s11_108 + 116) & 0x02) != 0x00 && (word32) (*((word32) (*((word32) s11_108 + 48)) + 52)) == 0x01)
		{
			word32 a0_125;
			word32 s10_1891;
			word32 s9_1890;
			word32 s7_1889;
			word32 s6_1888;
			word32 s5_1887;
			word32 s4_1886;
			word32 s2_1885;
			word32 a4_1884;
			word32 a3_1883;
			word32 a2_1882;
			word32 a1_1881;
			ra = mbedtls_ssl_resend(ra, a0_62, s11_108, 0x01, s2_74, mstatus, dwArg88, out s0_105, out s1, out a0_125, out a1_1881, out a2_1882, out a3_1883, out a4_1884, out a5, out s2_1885, out s3, out s4_1886, out s5_1887, out s6_1888, out s7_1889, out s9_1890, out s10_1891, out s11_108, out mstatus);
			if (a0_125 != 0x00)
				goto l23068A62;
		}
		if (*((word32) s11_108 + 4) == 0x0C && *((word32) (*((word32) s11_108 + 48)) + 344) != 0x00)
			((word32) s11_108 + 4)->u0 = 0x11;
		a5 = *((word32) s11_108 + 4);
		if (a5 > 0x11)
		{
			word32 t4_1868;
			word32 s11_1867;
			word32 s10_1866;
			word32 s9_1865;
			word32 s8_1864;
			word32 s6_1862;
			word32 s7_1863;
			word32 s4_1860;
			word32 s5_1861;
			word32 a7_1859;
			word32 a4_1858;
			word32 a3_1857;
			word32 a2_1856;
			word32 a1_1855;
			mbedtls_debug_print_msg(ra, s11_108, 0x01, &g_t2308CFA0, a5, out a1_1855, out a2_1856, out a3_1857, out a4_1858, out a5, out a7_1859, out s4_1860, out s5_1861, out s6_1862, out s7_1863, out s8_1864, out s9_1865, out s10_1866, out s11_1867, out t4_1868);
			goto l23068AF0;
		}
		switch (*((word32) s11_108 + 4))
		{
		case 0x00:
			((word32) s11_108 + 4)->u0 = 0x01;
			break;
		case 0x01:
			struct Eq_347246 * a2_157;
			struct Eq_347247 * a4_159;
			Eq_2 s11_162;
			word32 t4_1880;
			word32 s10_1879;
			word32 s9_1878;
			word32 s8_1877;
			word32 s7_1876;
			word32 s6_1875;
			word32 s4_1873;
			word32 s5_1874;
			word32 a5_1871;
			word32 a7_1872;
			word32 a1_1869;
			word32 a3_1870;
			mbedtls_debug_print_msg(ra, s11_108, 0x02, &g_t2308C4F0, a5, out a1_1869, out a2_157, out a3_1870, out a4_159, out a5_1871, out a7_1872, out s4_1873, out s5_1874, out s6_1875, out s7_1876, out s8_1877, out s9_1878, out s10_1879, out s11_162, out t4_1880);
			Eq_2 a5_174 = a4_159->t0018;
			if (a4_159 == null)
			{
				word32 s11_1904;
				word32 t4_1905;
				word32 s9_1902;
				word32 s10_1903;
				word32 s7_1900;
				word32 s8_1901;
				word32 s5_1898;
				word32 s6_1899;
				word32 s4_1897;
				word32 a7_1896;
				word32 a4_1895;
				word32 a3_1894;
				word32 a2_1893;
				word32 a1_1892;
				mbedtls_debug_print_msg(ra, s11_162, 0x01, &g_t2308C508, a5_174, out a1_1892, out a2_1893, out a3_1894, out a4_1895, out a5, out a7_1896, out s4_1897, out s5_1898, out s6_1899, out s7_1900, out s8_1901, out s9_1902, out s10_1903, out s11_1904, out t4_1905);
			}
			else
			{
				*((word32) s11_162 + 8) = (word32) *((word32) a5_174 + 114);
				*((word32) s11_162 + 0x0C) = (word32) *((word32) a5_174 + 115);
				Eq_2 a0_179 = (word32) *((word32) a5_174 + 112);
				if (a0_179 == 0x00)
				{
					word32 t4_1926;
					word32 s10_1924;
					word32 s11_1925;
					word32 s8_1922;
					word32 s9_1923;
					word32 s6_1920;
					word32 s7_1921;
					word32 s4_1918;
					word32 s5_1919;
					word32 a4_1916;
					word32 a7_1917;
					word32 a2_1914;
					word32 a3_1915;
					word32 a1_1913;
					mbedtls_debug_print_msg(ra, s11_162, 0x01, &g_t2308C518, a5_174, out a1_1913, out a2_1914, out a3_1915, out a4_1916, out a5, out a7_1917, out s4_1918, out s5_1919, out s6_1920, out s7_1921, out s8_1922, out s9_1923, out s10_1924, out s11_1925, out t4_1926);
					goto l23068AF0;
				}
				Eq_2 a5_1573;
				Eq_2 a3_1575;
				struct Eq_347377 * s5_181 = *((word32) s11_162 + 0x00A0);
				mbedtls_ssl_write_version(a0_179, (word32) a2_157->ptr0074->b0071, a2_157 >> 1 & 0x01, &s5_181->b0004);
				word32 t4_1912;
				word32 a5_1910;
				word32 a7_1911;
				word32 a3_1908;
				word32 a4_1909;
				word32 a1_1906;
				word32 a2_1907;
				word32 s4_206;
				word32 s6_208;
				word32 s7_209;
				word32 s8_210;
				word32 s9_211;
				word32 s10_204;
				struct Eq_347409 * s5_207;
				Eq_2 s11_1714;
				Eq_2 a0_197 = mbedtls_debug_print_msg(ra, s11_162, 0x03, &g_t2308C570, (word32) s5_181->b0004, out a1_1906, out a2_1907, out a3_1908, out a4_1909, out a5_1910, out a7_1911, out s4_206, out s5_207, out s6_208, out s7_209, out s8_210, out s9_211, out s10_204, out s11_1714, out t4_1912);
				ui32 a4_218 = (word32) *((word32) *s11_1714 + 116);
				struct Eq_347443 * s2_217 = *((word32) s11_1714 + 48);
				<anonymous> * a4_219 = a4_218 & 0x02;
				if ((a4_218 & 0x02) != 0x00)
				{
					a4_219 = s2_217->ptr0024;
					if (a4_219 != null)
						goto l23068B48;
				}
				word32 s2_255;
				word32 s4_257;
				word32 s5_258;
				word32 s6_259;
				word32 s7_260;
				word32 s8_261;
				word32 s9_262;
				word32 s10_263;
				word32 s11_264;
				Eq_2 a0_265;
				<anonymous> * a4_267;
				word32 a6_275;
				word32 t3_276;
				word32 t0_277;
				word32 tp_278;
				word32 t2_280;
				word32 t6_281;
				a4_219();
				s0_105 = a0_265;
				if (a0_265 != 0x00)
				{
l23068E08:
					a5_1573 = s0_105;
					a3_1575.u0 = 759;
					goto l230690EE;
				}
				Eq_2 a0_302;
				word32 a6_312;
				word32 t3_313;
				word32 t0_314;
				word32 tp_315;
				word32 t2_317;
				word32 t6_318;
				a4_267();
				s0_105 = a0_302;
				if (a0_302 != 0x00)
					goto l23068E08;
l23068B48:
				Eq_2 a6_375;
				struct Eq_347443 * a1_327 = *((word32) s11_1714 + 48);
				Eq_2 a5_329 = (char *) s5_207 + 6;
				sp_1690->t008C = a5_329;
				Eq_2 a5_336;
				word32 a7_1932;
				word32 a4_1930;
				word32 a6_1931;
				word32 a2_1928;
				word32 a3_1929;
				word32 a1_1927;
				memcpy(a5_329, (char *) &a1_327->ptr0024 + 0x00B4, 32, out a1_1927, out a2_1928, out a3_1929, out a4_1930, out a5_336, out a6_1931, out a7_1932);
				word32 a7_1938;
				word32 a3_1935;
				word32 a4_1936;
				word32 a5_1937;
				word32 a2_1934;
				word32 a1_1933;
				struct Eq_294369 * a0_358 = mbedtls_debug_print_buf(ra, 0x03, a5_336, out a1_1933, out a2_1934, out a3_1935, out a4_1936, out a5_1937, out a7_1938);
				struct Eq_347556 * a5_370 = (struct Eq_347556 *) 0x10;
				Eq_2 a6_371 = *((word32) *((word32) s11_1714 + 44) + 8);
				if (a6_371 <= ~0x1F)
				{
					a5_370 = (struct Eq_347556 *) *((word32) *((word32) s11_1714 + 48) + 328);
					a6_375 = a6_371;
					if (a5_370 == null)
						goto l23068B9A;
				}
				else
				{
l23068B9A:
					a6_375.u0 = 0x00;
				}
				if (a5_370 != null)
				{
					word32 a1_381 = a5_370->dw0068;
					if (a5_370 == null)
						goto l23068BC8;
					word32 a0_445;
					word32 a6_455;
					word32 t3_456;
					word32 t0_457;
					word32 tp_458;
					word32 t2_460;
					word32 t6_461;
					(a6_371 + -16)();
					if (a0_445 == 0x00)
					{
						*(union Eq_2 *) 0x28 = *((word32) s11_1714 + 44);
						a6_375.u0 = 32;
						goto l23068BC8;
					}
				}
				else
				{
l23068BC8:
					s5_207->b0026 = (byte) a6_375;
					Eq_2 s0_468 = &s5_207->b0026 + 1;
					Eq_2 a5_472 = 0x00;
					while (a6_375 != a5_472)
					{
						Mem483[s5_207 + a5_472 + 39:byte] = SLICE(CONVERT(Mem476[Mem476[s11_1714 + 44:int32] + a5_472 + 0x0C:byte], byte, word32), byte, 0);
						a5_472 = (word32) a5_472 + 1;
					}
					sp_1690->t008C = a6_375;
					word32 s8_1960;
					word32 s7_1959;
					word32 s6_1958;
					word32 s5_1957;
					word32 a7_1956;
					word32 a5_1955;
					word32 a4_1954;
					word32 a3_1953;
					word32 a1_1951;
					word32 a2_1952;
					word32 s9_1961;
					word32 s10_1962;
					word32 t4_1963;
					struct Eq_347679 * s4_509;
					Eq_2 s11_1717;
					mbedtls_debug_print_msg(ra, s11_1714, 0x03, &g_t2308C5B0, a6_375, out a1_1951, out a2_1952, out a3_1953, out a4_1954, out a5_1955, out a7_1956, out s4_509, out s5_1957, out s6_1958, out s7_1959, out s8_1960, out s9_1961, out s10_1962, out s11_1717, out t4_1963);
					word32 a1_1964;
					word32 a2_1965;
					word32 a4_1966;
					word32 a5_1967;
					word32 a7_1968;
					struct Eq_268327 * a3_1718;
					mbedtls_debug_print_buf(ra, 0x03, s0_468, out a1_1964, out a2_1965, out a3_1718, out a4_1966, out a5_1967, out a7_1968);
					ui32 a5_539 = (word32) *((word32) *s11_1717 + 116);
					if ((a5_539 & 0x02) != 0x00)
					{
						if ((a5_539 & 0x02) == 0x00)
						{
							byte * s4_600;
							word32 a1_1980;
							word32 a2_1981;
							word32 a4_1982;
							word32 a5_1983;
							word32 a7_1984;
							word32 s5_1985;
							word32 s6_1986;
							word32 s7_1987;
							word32 s8_1988;
							word32 s9_1989;
							word32 s10_1990;
							word32 t4_1991;
							mbedtls_debug_print_msg(ra, s11_1717, 0x03, &g_t2308C5F0, a5_539 & 0x02, out a1_1980, out a2_1981, out a3_1718, out a4_1982, out a5_1983, out a7_1984, out s4_600, out s5_1985, out s6_1986, out s7_1987, out s8_1988, out s9_1989, out s10_1990, out s11_1717, out t4_1991);
							*s4_600 = 0x00;
							s4_509 = (struct Eq_347679 *) &s4_509->b0001;
						}
						else
						{
							Eq_2 a1_553;
							word32 a2_1969;
							word32 a3_1970;
							word32 a4_1971;
							word32 a5_1972;
							word32 a7_1973;
							mbedtls_debug_print_buf(ra, 0x03, a5_539 & 0x02, out a1_553, out a2_1969, out a3_1970, out a4_1971, out a5_1972, out a7_1973);
							s4_509->b0000 = (byte) (word32) *((word32) *((word32) s11_1717 + 48) + 40);
							word32 a1_1974;
							word32 a2_1975;
							word32 a4_1976;
							word32 a5_1977;
							word32 a6_1978;
							word32 a7_1979;
							memcpy(&s4_509->b0001, a1_553, (word32) *((word32) *((word32) s11_1717 + 48) + 40), out a1_1974, out a2_1975, out a3_1718, out a4_1976, out a5_1977, out a6_1978, out a7_1979);
							s4_509 = (struct Eq_347679 *) (&s4_509->b0001 + (word32) (*((word32) (*((word32) s11_1717 + 48)) + 40)));
						}
					}
					int32 a4_614 = *((word32) s11_1717 + 0x0C);
					struct Eq_347731 * s3_1726 = &s4_509->b0001 + 1;
					struct Eq_268327 * a4_1716 = a4_614 << 2;
					int32 * s2_620 = *((word32) *s11_1717 + a4_614 * 0x04);
					word32 s0_1725 = 0x00;
					word32 s6_1720 = 0x2308C000;
					while (true)
					{
						struct Eq_268327 * a0_625 = *s2_620;
						if (a0_625 == null)
							break;
						word32 a5_1992;
						if (mbedtls_ssl_ciphersuite_from_id(a0_625, a4_1716, out a5_1992) != null)
						{
							struct Eq_347718 * a5_630 = *s11_1717;
							a4_1716 = (word32) a5_630->b0071;
							if (a4_1716 >= a3_1718)
							{
								a4_1716 = (word32) a5_630->b0073;
								struct Eq_348359 * a0_635 = a3_1718->ptr0018;
								if (a3_1718 >= a4_1716 && (((word32) a5_630->t0074 & 0x02) == 0x00 || ((word32) a0_635->b001C & 0x04) == 0x00))
								{
									word32 a1_2095;
									word32 a2_2096;
									word32 a5_2097;
									word32 a7_2098;
									word32 s5_2099;
									word32 s7_2100;
									word32 s8_2101;
									word32 s9_2102;
									word32 s10_2103;
									word32 t4_2104;
									mbedtls_debug_print_msg(ra, s11_1717, 0x03, s6_1720 + 0x0624, *s2_620, out a1_2095, out a2_2096, out a3_1718, out a4_1716, out a5_2097, out a7_2098, out s4_509, out s5_2099, out s6_1720, out s7_2100, out s8_2101, out s9_2102, out s10_2103, out s11_1717, out t4_2104);
									++s3_1726;
									s3_1726[0x07FF] = (struct Eq_347731) (byte) (*s2_620 >> 8);
									s3_1726->b0FFF = (byte) *s2_620;
									++s0_1725;
								}
							}
						}
						++s2_620;
					}
					s3_1726->b0001 = ~0x00;
					s3_1726->b0000 = 0x00;
					Eq_2 a5_689 = s0_1725 + 1;
					s4_509->b0000 = (byte) (a5_689 >> 0x07);
					s4_509->b0001 = (byte) (a5_689 << 0x01);
					Eq_2 s11_711;
					word32 a1_1993;
					word32 a2_1994;
					word32 a3_1995;
					word32 a4_1996;
					word32 a5_1997;
					word32 a7_1998;
					word32 s4_1999;
					word32 s5_2000;
					word32 s6_2001;
					word32 s7_2002;
					word32 s8_2003;
					word32 s9_2004;
					word32 s10_2005;
					word32 t4_2006;
					mbedtls_debug_print_msg(ra, s11_1717, 0x03, &g_t2308C648, a5_689, out a1_1993, out a2_1994, out a3_1995, out a4_1996, out a5_1997, out a7_1998, out s4_1999, out s5_2000, out s6_2001, out s7_2002, out s8_2003, out s9_2004, out s10_2005, out s11_711, out t4_2006);
					Eq_2 s11_737;
					word32 a1_2007;
					word32 a2_2008;
					word32 a3_2009;
					word32 a4_2010;
					word32 a5_2011;
					word32 a7_2012;
					word32 s4_2013;
					word32 s5_2014;
					word32 s6_2015;
					word32 s7_2016;
					word32 s8_2017;
					word32 s9_2018;
					word32 s10_2019;
					word32 t4_2020;
					mbedtls_debug_print_msg(ra, s11_711, 0x03, &g_t2308C66C, 0x01, out a1_2007, out a2_2008, out a3_2009, out a4_2010, out a5_2011, out a7_2012, out s4_2013, out s5_2014, out s6_2015, out s7_2016, out s8_2017, out s9_2018, out s10_2019, out s11_737, out t4_2020);
					word32 a1_2021;
					word32 a2_2022;
					word32 a3_2023;
					word32 a4_2024;
					word32 a5_2025;
					word32 a7_2026;
					word32 s4_2027;
					word32 s5_2028;
					word32 s6_2029;
					word32 s7_2030;
					word32 s8_2031;
					word32 s9_2032;
					word32 s10_2033;
					word32 t4_2034;
					Eq_2 s11_1003;
					mbedtls_debug_print_msg(ra, s11_737, 0x03, &g_t2308C68C, 0x00, out a1_2021, out a2_2022, out a3_2023, out a4_2024, out a5_2025, out a7_2026, out s4_2027, out s5_2028, out s6_2029, out s7_2030, out s8_2031, out s9_2032, out s10_2033, out s11_1003, out t4_2034);
					s3_1726[1] = (struct Eq_347731) 0x01;
					s3_1726->b0003 = 0x00;
					Eq_2 a5_777 = *((word32) s11_1003 + 0x00B4);
					ptr32 s4_1015 = s3_1726 + 2;
					word32 s7_780 = 0x00;
					if (a5_777 != 0x00)
					{
						struct Eq_348014 * s0_781 = *((word32) s11_1003 + 0x00A0);
						struct Eq_348018 * s6_801;
						word32 a1_2035;
						word32 a2_2036;
						word32 a3_2037;
						word32 a4_2038;
						word32 a5_2039;
						word32 a7_2040;
						word32 s5_2041;
						word32 s7_2042;
						word32 s8_2043;
						word32 s9_2044;
						word32 s10_2045;
						word32 t4_2046;
						mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t2308C6AC, a5_777, out a1_2035, out a2_2036, out a3_2037, out a4_2038, out a5_2039, out a7_2040, out s4_1015, out s5_2041, out s6_801, out s7_2042, out s8_2043, out s9_2044, out s10_2045, out s11_1003, out t4_2046);
						Eq_2 a5_813;
						word32 a1_2047;
						word32 a2_2048;
						word32 a3_2049;
						word32 a4_2050;
						Eq_2 a0_810 = strlen(*((word32) s11_1003 + 0x00B4), out a1_2047, out a2_2048, out a3_2049, out a4_2050, out a5_813);
						if (s0_781 + 0x04000000 >=u s6_801)
						{
							s7_780 = (word32) a0_810 + 9;
							if (s0_781 + 0x04000000 - s6_801 <u a0_810 + 9)
								goto l23068D2A;
							s3_1726[4] = (struct Eq_347731) (byte) ((word32) a0_810 + 5 >> 8);
							s3_1726->b0009 = (byte) ((a0_810 & 0x00FF) + 5);
							s3_1726[5] = (struct Eq_347731) (byte) ((word32) a0_810 + 3 >> 8);
							s3_1726->b000B = (byte) ((a0_810 & 0x00FF) + 3);
							s3_1726[3] = (struct Eq_347731) 0x00;
							s3_1726->b0007 = 0x00;
							s3_1726[6] = (struct Eq_347731) 0x00;
							s3_1726->b000D = (byte) (a0_810 >> 0x08);
							s3_1726[7] = (struct Eq_347731) (byte) (a0_810 & 0x00FF);
							word32 a1_2064;
							word32 a2_2065;
							word32 a3_2066;
							word32 a4_2067;
							word32 a5_2068;
							word32 a6_2069;
							word32 a7_2070;
							memcpy(&s3_1726->b000E + 1, *((word32) s11_1003 + 0x00B4), a0_810, out a1_2064, out a2_2065, out a3_2066, out a4_2067, out a5_2068, out a6_2069, out a7_2070);
						}
						else
						{
l23068D2A:
							word32 a1_2051;
							word32 a2_2052;
							word32 a3_2053;
							word32 a4_2054;
							word32 a5_2055;
							word32 a7_2056;
							word32 s5_2057;
							word32 s6_2058;
							word32 s7_2059;
							word32 s8_2060;
							word32 s9_2061;
							word32 s10_2062;
							word32 t4_2063;
							mbedtls_debug_print_msg(ra, s11_1003, 0x01, &g_t2308C6DC, a5_813, out a1_2051, out a2_2052, out a3_2053, out a4_2054, out a5_2055, out a7_2056, out s4_1015, out s5_2057, out s6_2058, out s7_2059, out s8_2060, out s9_2061, out s10_2062, out s11_1003, out t4_2063);
							s7_780 = 0x00;
						}
					}
					uint32 a5_1001 = 0x00;
					if ((word32) *((word32) *s11_1003 + 113) == 0x03)
					{
						struct Eq_348014 * s2_895 = *((word32) s11_1003 + 0x00A0);
						word32 a1_2071;
						word32 a2_2072;
						word32 a3_2073;
						word32 a4_2074;
						word32 a5_2075;
						word32 a7_2076;
						word32 s5_2077;
						word32 s6_2078;
						word32 s8_2079;
						word32 s9_2080;
						word32 s10_2081;
						word32 t4_2082;
						Eq_2 a0_897 = mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t2308C6F0, 0x00, out a1_2071, out a2_2072, out a3_2073, out a4_2074, out a5_2075, out a7_2076, out s4_1015, out s5_2077, out s6_2078, out s7_780, out s8_2079, out s9_2080, out s10_2081, out s11_1003, out t4_2082);
						Eq_363497 s9_917[] = *((word32) *s11_1003 + 88);
						Eq_2 a5_918 = 0x00;
						while (s9_917[a5_918].dw0000 != 0x00)
							a5_918 = (word32) a5_918 + 2;
						struct Eq_348246 * s0_930 = s7_780 + 2 + s4_1015;
						if (s2_895 + 0x04000000 >=u s0_930)
						{
							a5_918 = (word32) a5_918 + 6;
							if (s2_895 + 0x04000000 - s0_930 <u a5_918)
								goto l23068F24;
							word32 s8_968 = s0_930 + 6;
							uint32 a5_969 = 0x00;
							while (true)
							{
								uint32 s2_976 = a5_969 + 2;
								if (a0_897 == 0x00)
									break;
								a0_897 = mbedtls_ssl_hash_from_md_alg(a0_897);
								s8_968->b0000 = (byte) a0_897;
								s8_968->b0001 = 0x01;
								a5_969 = s2_976;
								s8_968 += 0x02;
							}
							s0_930->b0001 = 0x0D;
							ui32 a4_988 = a5_969 & 0x00FF;
							s0_930->b0003 = (byte) (a4_988 + 2);
							s0_930->b0000 = 0x00;
							s0_930[1] = (struct Eq_348246) (byte) (s2_976 >> 0x08);
							s0_930[2] = (struct Eq_348246) (byte) (a5_969 >> 0x08);
							s0_930->b0005 = (byte) a4_988;
							a5_1001 = a5_969 + 0x06;
						}
						else
						{
l23068F24:
							word32 a1_2083;
							word32 a2_2084;
							word32 a3_2085;
							word32 a4_2086;
							word32 a5_2087;
							word32 a7_2088;
							word32 s5_2089;
							word32 s6_2090;
							word32 s8_2091;
							word32 s9_2092;
							word32 s10_2093;
							word32 t4_2094;
							mbedtls_debug_print_msg(ra, s11_1003, 0x01, &g_t2308C6DC, a5_918, out a1_2083, out a2_2084, out a3_2085, out a4_2086, out a5_2087, out a7_2088, out s4_1015, out s5_2089, out s6_2090, out s7_780, out s8_2091, out s9_2092, out s10_2093, out s11_1003, out t4_2094);
							a5_1001 = 0x00;
						}
					}
					word32 s7_1002 = s7_780 + a5_1001;
					word32 a5_1009 = 0x00;
					if (((word32) *((word32) *s11_1003 + 116) & 448) != 0x00)
					{
						struct Eq_348014 * s2_1011 = *((word32) s11_1003 + 0x00A0);
						word32 a1_2105;
						word32 a2_2106;
						word32 a3_2107;
						word32 a4_2108;
						word32 a7_2109;
						word32 s5_2110;
						word32 s6_2111;
						word32 s8_2112;
						word32 s9_2113;
						word32 s10_2114;
						word32 t4_2115;
						Eq_2 a5_1030;
						mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t2308C724, 0x04000000, out a1_2105, out a2_2106, out a3_2107, out a4_2108, out a5_1030, out a7_2109, out s4_1015, out s5_2110, out s6_2111, out s7_1002, out s8_2112, out s9_2113, out s10_2114, out s11_1003, out t4_2115);
