pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
						struct Eq_348481 * s0_1018 = s7_1002 + 2 + s4_1015;
						if (s2_1011 + 0x04000000 >=u s0_1018)
						{
							a5_1030.u0 = 0x04;
							if (s2_1011 + 0x04000000 - s0_1018 <=u 0x04)
								goto l23068F84;
							s0_1018->b0000 = 0x00;
							s0_1018->b0001 = 0x01;
							s0_1018[1] = (struct Eq_348481) 0x00;
							s0_1018->b0003 = 0x01;
							s0_1018[2] = (struct Eq_348481) (byte) (*((word32) *s11_1003 + 116) >> 6 & 0x07);
							a5_1009 = 0x05;
						}
						else
						{
l23068F84:
							word32 a1_2116;
							word32 a2_2117;
							word32 a3_2118;
							word32 a4_2119;
							word32 a5_2120;
							word32 a7_2121;
							word32 s5_2122;
							word32 s6_2123;
							word32 s8_2124;
							word32 s9_2125;
							word32 s10_2126;
							word32 t4_2127;
							mbedtls_debug_print_msg(ra, s11_1003, 0x01, &g_t2308C6DC, a5_1030, out a1_2116, out a2_2117, out a3_2118, out a4_2119, out a5_2120, out a7_2121, out s4_1015, out s5_2122, out s6_2123, out s7_1002, out s8_2124, out s9_2125, out s10_2126, out s11_1003, out t4_2127);
							a5_1009 = 0x00;
						}
					}
					word32 s7_1093 = s7_1002 + a5_1009;
					Eq_348434 s0_1098 = 0x00;
					Eq_2 a5_1099 = *((word32) *s11_1003 + 96);
					if (a5_1099 != 0x00)
					{
						up32 s8_1122;
						word32 a1_2128;
						word32 a2_2129;
						word32 a3_2130;
						word32 a4_2131;
						word32 a5_2132;
						word32 a7_2133;
						word32 s5_2134;
						word32 s6_2135;
						word32 s9_2136;
						word32 s10_2137;
						word32 t4_2138;
						mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t2308C758, a5_1099, out a1_2128, out a2_2129, out a3_2130, out a4_2131, out a5_2132, out a7_2133, out s4_1015, out s5_2134, out s6_2135, out s7_1093, out s8_1122, out s9_2136, out s10_2137, out s11_1003, out t4_2138);
						Eq_2 s2_1129 = *((word32) *s11_1003 + 96);
						while (true)
						{
							Eq_2 a0_1132 = *s2_1129;
							if (a0_1132 == 0x00)
								break;
							word32 a1_2139;
							word32 a2_2140;
							word32 a3_2141;
							word32 a4_2142;
							word32 a5_2143;
							s0_1098 = (word32) s0_1098 + ((strlen(a0_1132, out a1_2139, out a2_2140, out a3_2141, out a4_2142, out a5_2143) & 0x00FF) + 0x01);
							s2_1129 = (word32) s2_1129 + 4;
						}
						struct Eq_348634 * s2_1148 = s7_1093 + 2 + s4_1015;
						Eq_2 a5_1150 = s8_1122 + 0x04000000;
						if (s8_1122 + 0x04000000 >= s2_1148)
						{
							a5_1150 = s8_1122 + 0x04000000 - s2_1148;
							if (a5_1150 < (word32) s0_1098.u0 + 6)
								goto l23068FEE;
							s2_1148->b0000 = 0x00;
							s2_1148->b0001 = 0x10;
							byte * s0_1158 = &s2_1148->b0005 + 1;
							Eq_2 s8_1159 = *((word32) *s11_1003 + 96);
							while (true)
							{
								Eq_2 a0_1162 = *s8_1159;
								if (a0_1162 == 0x00)
									break;
								word32 a1_2156;
								word32 a2_2157;
								word32 a3_2158;
								word32 a4_2159;
								word32 a5_2160;
								Eq_2 a0_1163 = strlen(a0_1162, out a1_2156, out a2_2157, out a3_2158, out a4_2159, out a5_2160);
								*s0_1158 = (byte) a0_1163;
								word32 a1_2161;
								word32 a2_2162;
								word32 a3_2163;
								word32 a4_2164;
								word32 a5_2165;
								word32 a6_2166;
								word32 a7_2167;
								memcpy(s0_1158 + 1, *s8_1159, a0_1163 & 0x00FF, out a1_2161, out a2_2162, out a3_2163, out a4_2164, out a5_2165, out a6_2166, out a7_2167);
								s8_1159 = (word32) s8_1159 + 4;
								s0_1158 += (word32) *s0_1158 + 0x01;
							}
							s0_1098 = s0_1158 - s2_1148;
							s2_1148->b0004 = (byte) ((word32) s0_1098.u0 - 6 >> 8);
							s2_1148->b0005 = (byte) ((s0_1098 & 0x00FF) + -6);
							s2_1148->b0002 = (byte) ((word32) s0_1098.u0 - 4 >> 8);
							s2_1148->b0003 = (byte) ((s0_1098 & 0x00FF) + ~0x03);
						}
						else
						{
l23068FEE:
							word32 a1_2144;
							word32 a2_2145;
							word32 a3_2146;
							word32 a4_2147;
							word32 a5_2148;
							word32 a7_2149;
							word32 s5_2150;
							word32 s6_2151;
							word32 s8_2152;
							word32 s9_2153;
							word32 s10_2154;
							word32 t4_2155;
							mbedtls_debug_print_msg(ra, s11_1003, 0x01, &g_t2308C6DC, a5_1150, out a1_2144, out a2_2145, out a3_2146, out a4_2147, out a5_2148, out a7_2149, out s4_1015, out s5_2150, out s6_2151, out s7_1093, out s8_2152, out s9_2153, out s10_2154, out s11_1003, out t4_2155);
							s0_1098.u0 = 0x00;
						}
					}
					word32 s0_1244 = (word32) s0_1098 + s7_1093;
					word32 s7_1245 = 0x00;
					if (((word32) *((word32) *s11_1003 + 116) & 0x0200) != 0x00)
					{
						Eq_2 a5_1269;
						Eq_2 s8_1281;
						struct Eq_348830 * s9_1282;
						word32 a1_2179;
						word32 a2_2180;
						word32 a3_2181;
						word32 a4_2182;
						word32 a7_2183;
						word32 s4_2184;
						word32 s5_2185;
						word32 s6_2186;
						word32 s7_2187;
						word32 s10_2188;
						word32 t4_2189;
						mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t2308C77C, *((word32) s11_1003 + 44), out a1_2179, out a2_2180, out a3_2181, out a4_2182, out a5_1269, out a7_2183, out s4_2184, out s5_2185, out s6_2186, out s7_2187, out s8_1281, out s9_1282, out s10_2188, out s11_1003, out t4_2189);
						struct Eq_348830 * s2_1257 = s0_1244 + 2 + s4_1015;
						if (s9_1282 >= s2_1257 && s9_1282 - s2_1257 >= (word32) s8_1281 + 4)
						{
							s2_1257->b0001 = 0x23;
							s2_1257->b0000 = 0x00;
							s2_1257->b0002 = (byte) (s8_1281 >> 0x08);
							s2_1257->b0003 = (byte) s8_1281;
							if (*((word32) *((word32) s11_1003 + 44) + 100) != 0x00 && s8_1281 != 0x00)
							{
								Eq_2 a1_1307;
								Eq_2 s8_1318;
								word32 a2_2204;
								word32 a3_2205;
								word32 a4_2206;
								word32 a5_2207;
								word32 a7_2208;
								word32 s4_2209;
								word32 s5_2210;
								word32 s6_2211;
								word32 s9_2212;
								word32 s10_2213;
								word32 t4_2214;
								mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t2308C7AC, s8_1281, out a1_1307, out a2_2204, out a3_2205, out a4_2206, out a5_2207, out a7_2208, out s4_2209, out s5_2210, out s6_2211, out s7_1245, out s8_1318, out s9_2212, out s10_2213, out s11_1003, out t4_2214);
								word32 a1_2215;
								word32 a2_2216;
								word32 a3_2217;
								word32 a4_2218;
								word32 a5_2219;
								word32 a6_2220;
								word32 a7_2221;
								memcpy(&s2_1257->b0003 + 1, a1_1307, s8_1318, out a1_2215, out a2_2216, out a3_2217, out a4_2218, out a5_2219, out a6_2220, out a7_2221);
							}
							else
								s7_1245 = 0x04;
						}
						else
						{
							word32 a1_2190;
							word32 a2_2191;
							word32 a3_2192;
							word32 a4_2193;
							word32 a5_2194;
							word32 a7_2195;
							word32 s4_2196;
							word32 s5_2197;
							word32 s6_2198;
							word32 s7_2199;
							word32 s8_2200;
							word32 s9_2201;
							word32 s10_2202;
							word32 t4_2203;
							mbedtls_debug_print_msg(ra, s11_1003, 0x01, &g_t2308C6DC, a5_1269, out a1_2190, out a2_2191, out a3_2192, out a4_2193, out a5_2194, out a7_2195, out s4_2196, out s5_2197, out s6_2198, out s7_2199, out s8_2200, out s9_2201, out s10_2202, out s11_1003, out t4_2203);
							s7_1245 = 0x00;
						}
					}
					Eq_2 s0_1375 = s0_1244 + s7_1245;
					word32 s5_1399;
					word32 s6_1400;
					word32 a1_2168;
					word32 a2_2169;
					word32 a3_2170;
					word32 a4_2171;
					word32 a5_2172;
					word32 a7_2173;
					word32 s7_2174;
					word32 s8_2175;
					word32 s9_2176;
					word32 s10_2177;
					word32 t4_2178;
					word32 s4_1398;
					Eq_2 s11_1397;
					mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t2308C7D0, s0_1375, out a1_2168, out a2_2169, out a3_2170, out a4_2171, out a5_2172, out a7_2173, out s4_1398, out s5_1399, out s6_1400, out s7_2174, out s8_2175, out s9_2176, out s10_2177, out s11_1397, out t4_2178);
					if (s0_1375 != 0x00)
					{
						s3_1726[2] = (struct Eq_347731) (byte) (s0_1375 >> 0x08);
						s3_1726->b0005 = (byte) s0_1375;
						s4_1398 = (word32) s0_1375 + s6_1400;
					}
					((word32) s11_1397 + 0x00A4)->u0 = 22;
					byte * a5_1430 = *((word32) s11_1397 + 0x00A0);
					*((word32) s11_1397 + 0x00A8) = s4_1398 - s5_1399;
					*a5_1430 = 0x01;
					*((word32) s11_1397 + 4) = (word32) *((word32) s11_1397 + 4) + 1;
					ui32 a5_1441 = (word32) *((word32) *s11_1397 + 116);
					Eq_2 a5_1442 = a5_1441 & 0x02;
					if ((a5_1441 & 0x02) != 0x00)
						ra = mbedtls_ssl_send_flight_completed(ra, 0x01, a5_1441 & 0x02, sp_1690->t0000, sp_1690->t0004, out s1, out a5_1442, out s11_1397);
					Eq_2 a5_1520;
					Eq_2 s11_1527;
					Eq_2 a0_1541;
					word32 s0_2222;
					word32 a1_2223;
					word32 a2_2224;
					word32 a3_2225;
					word32 a4_2226;
					word32 s2_2227;
					word32 s4_2228;
					word32 s5_2229;
					ra = mbedtls_ssl_write_record(ra, s1, s11_1397, a5_1442, mstatus, out s0_2222, out s1, out a0_1541, out a1_2223, out a2_2224, out a3_2225, out a4_2226, out a5_1520, out s2_2227, out s3, out s4_2228, out s5_2229, out s11_1527, out mstatus);
					if (a0_1541 != 0x00)
					{
						a5_1573 = a0_1541;
						a3_1575.u0 = 0x0415;
l230690EE:
						word32 s11_1950;
						word32 s9_1948;
						word32 s10_1949;
						word32 s8_1947;
						word32 s7_1946;
						word32 s6_1945;
						word32 s5_1944;
						word32 s4_1943;
						word32 a4_1942;
						word32 a3_1941;
						word32 a2_1940;
						word32 a1_1939;
						mbedtls_debug_print_ret(ra, 0x01, a3_1575, a5_1573, out a1_1939, out a2_1940, out a3_1941, out a4_1942, out a5, out s4_1943, out s5_1944, out s6_1945, out s7_1946, out s8_1947, out s9_1948, out s10_1949, out s11_1950);
					}
					else
					{
						word32 a1_2230;
						word32 a2_2231;
						word32 a3_2232;
						word32 a4_2233;
						word32 a7_2234;
						word32 s4_2235;
						word32 s5_2236;
						word32 s6_2237;
						word32 s7_2238;
						word32 s8_2239;
						word32 s9_2240;
						word32 s10_2241;
						word32 s11_2242;
						word32 t4_2243;
						mbedtls_debug_print_msg(ra, s11_1527, 0x02, &g_t2308C7FC, a5_1520, out a1_2230, out a2_2231, out a3_2232, out a4_2233, out a5, out a7_2234, out s4_2235, out s5_2236, out s6_2237, out s7_2238, out s8_2239, out s9_2240, out s10_2241, out s11_2242, out t4_2243);
					}
				}
			}
			break;
		}
	}
l23068A62:
	ptr32 s2_1703 = sp_1690->ptr0048;
	struct Eq_297387 * a4_1704 = sp_1690->ptr0068;
	ptr32 a0_1705 = sp_1690->ptr0088;
	ptr32 s5_1710 = sp_1690->ptr00C8->ptr013C;
	s1Out = s1;
	a0Out = a0_1705;
	a4Out = a4_1704;
	a5Out = a5;
	s2Out = s2_1703;
	s3Out = s3;
	s5Out = s5_1710;
	mstatusOut = mstatus;
	return ra;
}

// 2306A40C: void mbedtls_ssl_own_key(Register (ptr32 Eq_349120) a5)
void mbedtls_ssl_own_key(struct Eq_349120 * a5)
{
	if (a5 != null)
	{
		a5 = a5->ptr0008;
		if (a5 != null)
			return;
	}
	if (a5->dw004C == 0x00)
		;
}

