pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 2306A420: Register Eq_2 mbedtls_ssl_handshake_server_step(Register Eq_2 ra, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgC4, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_handshake_step
Eq_2 mbedtls_ssl_handshake_server_step(Eq_2 ra, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgC4, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s3Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 s0_105;
	Eq_2 a4_133 = 0x10;
	if (a5 == 0x10)
	{
l2306C080:
		s0_105.u0 = ~0x070000FF;
		goto l2306A4CE;
	}
	Eq_2 a0_33 = *(union Eq_2 *) 0x40;
	if (false)
		goto l2306C080;
	Eq_2 a5_43;
	Eq_2 s10_49;
	word32 t4_4159;
	word32 a2_4148;
	word32 s6_4154;
	word32 s11_4158;
	word32 s9_4157;
	word32 s8_4156;
	word32 s7_4155;
	word32 a3_4149;
	word32 s5_4153;
	word32 s4_4152;
	word32 a7_4151;
	word32 a4_4150;
	word32 a1_4147;
	mbedtls_debug_print_msg(ra, a0_33, 0x02, &g_t2308D014, a5, out a1_4147, out a2_4148, out a3_4149, out a4_4150, out a5_43, out a7_4151, out s4_4152, out s5_4153, out s6_4154, out s7_4155, out s8_4156, out s9_4157, out s10_49, out s11_4158, out t4_4159);
	Eq_2 a0_62;
	word32 a1_4161;
	word32 a2_4162;
	word32 a3_4163;
	word32 a5_4164;
	word32 s3_4165;
	word32 s4_4166;
	word32 s11_4170;
	word32 s6_4167;
	word32 s7_4168;
	word32 s9_4169;
	word32 s1_4160;
	Eq_2 s10_107;
	Eq_2 s2_109;
	mbedtls_ssl_flush_output(ra, s10_49, a5_43, dwArg18, out s1_4160, out a0_62, out a1_4161, out a2_4162, out a3_4163, out a4_133, out a5_4164, out s2_109, out s3_4165, out s4_4166, out s5, out s6_4167, out s7_4168, out s9_4169, out s10_107, out s11_4170);
	s0_105 = a0_62;
	if (a0_62 == 0x00)
	{
		if (((word32) *((word32) *s10_107 + 116) & 0x02) != 0x00 && (word32) (*((word32) (*((word32) s10_107 + 48)) + 52)) == 0x01)
		{
			Eq_2 a0_125;
			word32 s1_4206;
			word32 a5_4210;
			word32 s4_4212;
			word32 s6_4213;
			word32 s11_4216;
			word32 s9_4215;
			word32 s7_4214;
			word32 s3_4211;
			word32 a1_4207;
			word32 a2_4208;
			word32 a3_4209;
			ra = mbedtls_ssl_resend(ra, a0_62, s10_107, 0x01, s2_109, mstatus, dwArg18, out s0_105, out s1_4206, out a0_125, out a1_4207, out a2_4208, out a3_4209, out a4_133, out a5_4210, out s2_109, out s3_4211, out s4_4212, out s5, out s6_4213, out s7_4214, out s9_4215, out s10_107, out s11_4216, out mstatus);
			if (a0_125 != 0x00)
			{
				s0_105 = a0_125;
				goto l2306A4CE;
			}
		}
		Eq_2 s7_129 = *((word32) s10_107 + 4);
		if (s7_129 > 0x12)
		{
			word32 a3_4173;
			word32 a5_4174;
			word32 s4_4176;
			word32 s6_4177;
			word32 s10_4181;
			word32 s11_4182;
			word32 t4_4183;
			word32 s9_4180;
			word32 s8_4179;
			word32 s7_4178;
			word32 a7_4175;
			word32 a2_4172;
			word32 a1_4171;
			mbedtls_debug_print_msg(ra, s10_107, 0x01, &g_t2308CFA0, s7_129, out a1_4171, out a2_4172, out a3_4173, out a4_133, out a5_4174, out a7_4175, out s4_4176, out s5, out s6_4177, out s7_4178, out s8_4179, out s9_4180, out s10_4181, out s11_4182, out t4_4183);
			goto l2306C080;
		}
		a4_133.u0 = 587780040;
		Eq_2 a5_135 = *((char *) g_a2308CFC8 + s7_129 * 0x04);
		switch (*((word32) s10_107 + 4))
		{
		case 0x00:
			((word32) s10_107 + 4)->u0 = 0x01;
			s0_105 = s7_129;
			break;
		case 0x01:
			Eq_2 a5_2657;
			Eq_2 a3_2659;
			Eq_2 a5_145;
			Eq_2 s10_151;
			word32 t4_4196;
			word32 s8_4193;
			word32 s9_4194;
			word32 s11_4195;
			word32 a7_4188;
			word32 s4_4189;
			word32 s5_4190;
			word32 s6_4191;
			word32 s7_4192;
			word32 a1_4184;
			word32 a4_4187;
			word32 a2_4185;
			word32 a3_4186;
			mbedtls_debug_print_msg(ra, s10_107, 0x02, &g_t2308D028, a5_135, out a1_4184, out a2_4185, out a3_4186, out a4_4187, out a5_145, out a7_4188, out s4_4189, out s5_4190, out s6_4191, out s7_4192, out s8_4193, out s9_4194, out s10_151, out s11_4195, out t4_4196);
			Eq_2 a0_169;
			Eq_2 s10_179;
			Eq_2 s2_181;
			word32 s9_4204;
			word32 s11_4205;
			word32 s5_4200;
			word32 s6_4201;
			word32 s7_4202;
			word32 s8_4203;
			word32 s0_4197;
			word32 s3_4198;
			word32 s4_4199;
			Eq_2 ra_1000 = mbedtls_ssl_fetch_input(ra, s0_105, s10_151, 0x05, a5_145, s2_109, mstatus, s5, dwArg18, out s0_4197, out a0_169, out s2_181, out s3_4198, out s4_4199, out s5_4200, out s6_4201, out s7_4202, out s8_4203, out s9_4204, out s10_179, out s11_4205, out mstatus);
			s0_105 = a0_169;
			if (a0_169 != 0x00)
			{
				a5_2657 = a0_169;
				a3_2659.u0 = 1104;
				goto l2306A528;
			}
			Eq_2 s0_201 = *((word32) s10_179 + 88);
			((word32) *((word32) *s10_179 + 116) & 0x02) == 0x00;
			word32 a2_4218;
			word32 a7_4222;
			word32 a5_4221;
			word32 a4_4220;
			word32 a3_4219;
			word32 a1_4217;
			mbedtls_debug_print_buf(ra_1000, 0x04, s0_201, out a1_4217, out a2_4218, out a3_4219, out a4_4220, out a5_4221, out a7_4222);
			word32 a3_4225;
			word32 a4_4226;
			word32 a5_4227;
			word32 a7_4228;
			word32 s4_4229;
			word32 t4_4236;
			word32 s5_4230;
			word32 s9_4234;
			word32 s11_4235;
			word32 s6_4231;
			word32 s7_4232;
			word32 s8_4233;
			word32 a1_4223;
			word32 a2_4224;
			Eq_2 s10_1008;
			mbedtls_debug_print_msg(ra_1000, s10_179, 0x03, &g_t2308D050, (word32) *s0_201, out a1_4223, out a2_4224, out a3_4225, out a4_4226, out a5_4227, out a7_4228, out s4_4229, out s5_4230, out s6_4231, out s7_4232, out s8_4233, out s9_4234, out s10_1008, out s11_4235, out t4_4236);
			Eq_2 a5_1029 = 22;
			if ((word32) *s0_201 != 22)
			{
l2306A596:
				goto l2306A59A;
			}
			struct Eq_349463 * a3_257 = *((word32) s10_1008 + 92);
			uint32 a4_264 = (word32) a3_257->b0001 << 8 | (word32) a3_257->b0000;
			Eq_2 s10_280;
			word32 a1_4237;
			word32 a2_4238;
			word32 a4_4240;
			word32 a5_4241;
			word32 s9_4248;
			word32 s11_4249;
			word32 t4_4250;
			word32 s6_4245;
			word32 s7_4246;
			word32 s8_4247;
			word32 s5_4244;
			word32 s4_4243;
			word32 a7_4242;
			word32 a3_4239;
			mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308D090, (word32) (word16) (a4_264 << 0x08 | a4_264 >> 8), out a1_4237, out a2_4238, out a3_4239, out a4_4240, out a5_4241, out a7_4242, out s4_4243, out s5_4244, out s6_4245, out s7_4246, out s8_4247, out s9_4248, out s10_280, out s11_4249, out t4_4250);
			uint32 a2_303;
			word32 s8_4260;
			word32 s9_4261;
			word32 s11_4262;
			word32 t4_4263;
			word32 s5_4257;
			word32 s6_4258;
			word32 s7_4259;
			word32 a3_4252;
			word32 a4_4253;
			word32 a5_4254;
			word32 a7_4255;
			word32 s4_4256;
			word32 a1_4251;
			mbedtls_debug_print_msg(ra_1000, s10_280, 0x03, &g_t2308D0B4, (word32) *((word32) s0_201 + 1), out a1_4251, out a2_303, out a3_4252, out a4_4253, out a5_4254, out a7_4255, out s4_4256, out s5_4257, out s6_4258, out s7_4259, out s8_4260, out s9_4261, out s10_1008, out s11_4262, out t4_4263);
			a5_1029.u0 = 0x02;
			word32 a5_4264;
			if (mbedtls_ssl_read_version(fp + -232, fp + -228, a2_303 >> 1 & 0x01, (word32) s0_201 + 1, out a5_4264) <= 0x02)
				goto l2306A596;
			if (((word32) *((word32) *s10_1008 + 116) & 0x02) != 0x00)
			{
				struct Eq_349613 * a1_334 = *((word32) s10_1008 + 84);
				a5_1029 = (word32) a1_334->b0000;
				if (a5_1029 == 0x00)
				{
					a5_1029 = (word32) a1_334->b0001;
					if (a5_1029 != 0x00)
						goto l2306A646;
					word32 a6_4270;
					word32 a7_4271;
					word32 a4_4268;
					word32 a5_4269;
					word32 a1_4265;
					word32 a2_4266;
					word32 a3_4267;
					memcpy((word32) *((word32) s10_1008 + 144) + 2, &a1_334->b0001 + 1, 0x06, out a1_4265, out a2_4266, out a3_4267, out a4_4268, out a5_4269, out a6_4270, out a7_4271);
					goto l2306A662;
				}
l2306A646:
				goto l2306A596;
			}
l2306A662:
			struct Eq_349586 * a4_356 = *((word32) s10_1008 + 92);
			uint32 a5_360 = (word32) a4_356->b0001 << 8 | (word32) a4_356->b0000;
			up32 s8_365 = (word32) (word16) (a5_360 << 0x08 | a5_360 >> 8);
			a5_1029.u0 = 0x04000000;
			if (s8_365 > 0x04000000)
				goto l2306A596;
			word32 a1_368 = 0x05;
			ui32 a5_369 = (word32) *((word32) *s10_1008 + 116);
			if ((a5_369 & 0x02) != 0x00)
				a1_368 = 0x0D;
			Eq_2 a0_391;
			struct Eq_349668 * s10_401;
			word32 s11_402;
			word32 s2_403;
			word32 s3_404;
			word32 s4_405;
			word32 s5_406;
			word32 s6_407;
			word32 s7_408;
			word32 s8_409;
			word32 s9_410;
			word32 s0_4272;
			ra_1000 = mbedtls_ssl_fetch_input(ra_1000, dwArgC4, s10_1008, a1_368 + s8_365, a5_369 & 0x02, s2_181, mstatus, s5, dwArg18, out s0_4272, out a0_391, out s2_403, out s3_404, out s4_405, out s5_406, out s6_407, out s7_408, out s8_409, out s9_410, out s10_401, out s11_402, out mstatus);
			s0_105 = a0_391;
			if (a0_391 != 0x00)
			{
				a5_2657 = a0_391;
				a3_2659.u0 = 0x04B9;
l2306A528:
				word32 a2_4274;
				word32 a5_4276;
				word32 s10_4282;
				word32 s11_4283;
				word32 s4_4277;
				word32 s9_4281;
				word32 s8_4280;
				word32 s7_4279;
				word32 s6_4278;
				word32 a3_4275;
				word32 a1_4273;
				mbedtls_debug_print_ret(ra_1000, 0x01, a3_2659, a5_2657, out a1_4273, out a2_4274, out a3_4275, out a4_133, out a5_4276, out s4_4277, out s5, out s6_4278, out s7_4279, out s8_4280, out s9_4281, out s10_4282, out s11_4283);
			}
			else
			{
				if (((word32) s10_401->ptr0000->w0074 & 0x02) != 0x00)
					s10_401->dw007C = s8_409 + 0x0D;
				else
					s10_401->dw0074 = 0x00;
				Eq_2 s1_430 = s10_401->t0064;
				word32 a4_4301;
				word32 a5_4302;
				word32 a7_4303;
				word32 a3_4300;
				word32 a1_4298;
				word32 a2_4299;
				mbedtls_debug_print_buf(ra_1000, 0x04, s1_430, out a1_4298, out a2_4299, out a3_4300, out a4_4301, out a5_4302, out a7_4303);
				<anonymous> * a5_456 = s10_401->ptr0030->ptr00C4;
				struct Eq_349768 * s1_471;
				up32 s8_478;
				word32 a3_485;
				word32 a6_491;
				word32 a7_492;
				word32 t3_493;
				word32 t0_494;
				word32 t1_495;
				word32 t4_496;
				word32 tp_497;
				word32 t5_499;
				struct Eq_349831 * sp_1097;
				a5_456();
				ui32 a5_502 = (word32) *((word32) *s10_1008 + 116);
				up32 a4_501 = 0x04;
				a5_1029 = a5_502 & 0x02;
				if ((a5_502 & 0x02) != 0x00)
					a4_501 = 0x0C;
				if (s8_478 < a4_501)
					goto l2306A596;
				word32 a7_4289;
				word32 s4_4290;
				word32 s5_4291;
				word32 s6_4292;
				word32 s7_4293;
				word32 s8_4294;
				word32 s9_4295;
				word32 s11_4296;
				word32 t4_4297;
				word32 a4_4287;
				word32 a5_4288;
				word32 a3_4286;
				word32 a2_4285;
				word32 a1_4284;
				mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308D0F0, (word32) s1_471->b0000, out a1_4284, out a2_4285, out a3_4286, out a4_4287, out a5_4288, out a7_4289, out s4_4290, out s5_4291, out s6_4292, out s7_4293, out s8_4294, out s9_4295, out s10_1008, out s11_4296, out t4_4297);
				a5_1029.u0 = 0x01;
				if ((word32) s1_471->b0000 != 0x01)
					goto l2306A596;
				Eq_2 s8_566;
				word32 a1_4304;
				word32 t4_4316;
				word32 a2_4305;
				word32 s6_4312;
				word32 s11_4315;
				word32 s7_4313;
				word32 s9_4314;
				word32 a7_4309;
				word32 s4_4310;
				word32 s5_4311;
				word32 a5_4308;
				word32 a4_4307;
				word32 a3_4306;
				mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308D114, (word32) s1_471->b0001 << 16 | (word32) s1_471->b0002 << 8 | (word32) s1_471->b0003, out a1_4304, out a2_4305, out a3_4306, out a4_4307, out a5_4308, out a7_4309, out s4_4310, out s5_4311, out s6_4312, out s7_4313, out s8_566, out s9_4314, out s10_1008, out s11_4315, out t4_4316);
				a5_1029 = (word32) s1_471->b0001;
				if (a5_1029 != 0x00)
				{
l2306A7C4:
					goto l2306A596;
				}
				word32 a2_574 = 0x04;
				ui32 a3_575 = (word32) *((word32) *s10_1008 + 116);
				if ((a3_575 & 0x02) != 0x00)
					a2_574 = 0x0C;
				uint32 a5_583 = (word32) s1_471->b0003 << 8 | (word32) s1_471->b0002;
				a5_1029 = (word32) (word16) (a5_583 >> 8 | a5_583 << 0x08) + a2_574;
				if (s8_566 != a5_1029)
					goto l2306A7C4;
				int32 a5_624;
				if ((a3_575 & 0x02) == 0x00)
				{
l2306A850:
					a5_624 = 0x04;
					goto l2306A852;
				}
				struct Eq_349944 * a3_594 = *((word32) s10_1008 + 100);
				uint32 a4_598 = (word32) a3_594->b0005 << 8 | (word32) a3_594->b0004;
				struct Eq_349960 * a5_604 = (word32) (word16) (a4_598 << 0x08 | a4_598 >> 8);
				a5_604->dw001C = (int32) *((word32) s10_1008 + 48);
				a5_604->dw0021 = (int32) *((word32) s10_1008 + 48);
				struct Eq_349980 * a0_609 = *((word32) s10_1008 + 100);
				Eq_2 a5_2626 = (word32) a0_609->b0006;
				if (a5_2626 != 0x00)
				{
l2306A808:
					word32 s11_4328;
					word32 t4_4329;
					word32 s7_4324;
					word32 s8_4325;
					word32 s9_4326;
					word32 s10_4327;
					word32 a7_4321;
					word32 s4_4322;
					word32 s6_4323;
					word32 a1_4317;
					word32 a2_4318;
					word32 a3_4319;
					word32 a5_4320;
					mbedtls_debug_print_msg(ra_1000, s10_1008, 0x01, &g_t2308D138, a5_2626, out a1_4317, out a2_4318, out a3_4319, out a4_133, out a5_4320, out a7_4321, out s4_4322, out s5, out s6_4323, out s7_4324, out s8_4325, out s9_4326, out s10_4327, out s11_4328, out t4_4329);
					s0_105.u0 = ~0x0700007F;
				}
				else
				{
					a5_2626 = (word32) a0_609->b0007;
					if (a5_2626 != 0x00)
						goto l2306A808;
					a5_2626 = (word32) a0_609->b0008;
					if (a5_2626 != 0x00)
						goto l2306A808;
					word32 a1_4357;
					word32 a2_4358;
					word32 a3_4359;
					word32 a4_4360;
					if (memcmp((char *) a0_609 + 1, &a0_609->b0008 + 1, 0x03, out a1_4357, out a2_4358, out a3_4359, out a4_4360, out a5_2626) != 0x00)
						goto l2306A808;
					a5_624 = 0x0C;
					if (((word32) *((word32) *s10_1008 + 116) & 0x02) == 0x00)
						goto l2306A850;
l2306A852:
					Eq_2 s1_630 = s1_471 + a5_624 / 4;
					Eq_350203 s8_633 = s8_566 - a5_624;
					a5_1029.u0 = 37;
					if (s8_633 <= 37)
						goto l2306A596;
					uint32 a2_654;
					word32 a7_4334;
					word32 a4_4332;
					word32 a5_4333;
					word32 a1_4330;
					word32 a3_4331;
					mbedtls_debug_print_buf(ra_1000, 0x03, s1_630, out a1_4330, out a2_654, out a3_4331, out a4_4332, out a5_4333, out a7_4334);
					word32 a5_4335;
					mbedtls_ssl_read_version((word32) s10_1008 + 8, (word32) s10_1008 + 0x0C, a2_654 >> 1 & 0x01, s1_630, out a5_4335);
					*((word32) *((word32) s10_1008 + 48) + 332) = *((word32) s10_1008 + 8);
					Eq_34581 a6_677 = *((word32) s10_1008 + 0x0C);
					*((word32) *((word32) s10_1008 + 48) + 336) = a6_677;
					struct Eq_350077 * a4_679 = *s10_1008;
					Eq_2 a5_680 = *((word32) s10_1008 + 8);
					Eq_34581 a3_682 = (word32) a4_679->b0073;
					if (a5_680 >= (word32) a4_679->b0072 && a6_677 >= a3_682)
					{
						Eq_34581 a5_684;
						Eq_2 a3_683 = (word32) a4_679->b0070;
						if (a3_683 < a5_680)
						{
							*((word32) s10_1008 + 8) = a3_683;
							a5_684 = (word32) a4_679->b0071;
							goto l2306A910;
						}
						a5_684 = (word32) a4_679->b0071;
						if (a5_684 < a6_677)
						{
l2306A910:
							*((word32) s10_1008 + 0x0C) = a5_684;
						}
						word32 a5_4365;
						word32 a7_4366;
						word32 a4_4364;
						word32 a2_4362;
						word32 a3_4363;
						word32 a1_4361;
						mbedtls_debug_print_buf(ra_1000, 0x03, (word32) s1_630 + 2, out a1_4361, out a2_4362, out a3_4363, out a4_4364, out a5_4365, out a7_4366);
						word32 a2_4368;
						word32 a3_4369;
						word32 a7_4373;
						word32 a6_4372;
						word32 a5_4371;
						word32 a4_4370;
						word32 a1_4367;
						memcpy((word32) *((word32) s10_1008 + 48) + 0x00D8, (word32) s1_630 + 2, 32, out a1_4367, out a2_4368, out a3_4369, out a4_4370, out a5_4371, out a6_4372, out a7_4373);
						Eq_350260 s3_735 = (word32) *((word32) s1_630 + 0x0022);
						a5_1029.u0 = 32;
						if (s3_735 > 32 || s8_633 < (word32) s3_735 + 36)
							goto l2306A596;
						word32 a3_4376;
						word32 a7_4379;
						word32 a4_4377;
						word32 a5_4378;
						word32 a1_4374;
						word32 a2_4375;
						mbedtls_debug_print_buf(ra_1000, 0x03, (word32) s1_630 + 35, out a1_4374, out a2_4375, out a3_4376, out a4_4377, out a5_4378, out a7_4379);
						*((word32) *((word32) s10_1008 + 44) + 8) = s3_735;
						Eq_2 a2_769;
						word32 a5_4385;
						word32 t1_4380;
						word32 a0_4381;
						word32 a1_4382;
						word32 a3_4383;
						word32 a4_4384;
						ra_1000 = memset(ra_1000, (word32) *((word32) s10_1008 + 44) + 0x0C, 0x00, 32, out t1_4380, out a0_4381, out a1_4382, out a2_769, out a3_4383, out a4_4384, out a5_4385);
						word32 a7_4392;
						word32 a3_4388;
						word32 a4_4389;
						word32 a5_4390;
						word32 a6_4391;
						word32 a1_4386;
						word32 a2_4387;
						memcpy((word32) *((word32) a2_769 + 8) + 0x0C, (word32) s1_630 + 35, a2_769, out a1_4386, out a2_4387, out a3_4388, out a4_4389, out a5_4390, out a6_4391, out a7_4392);
						struct Eq_350339 * s3_765 = (word32) s3_735 + 35;
						if (((word32) *((word32) *s10_1008 + 116) & 0x02) != 0x00)
						{
							a5_1029 = (word32) s1_630 + ((word32) s3_735 + 35);
							Eq_350375 s2_797 = (word32) *a5_1029;
							if (s8_633 < ((word32) s2_797 + ((word32) s3_735 + 35)) + 0x03)
								goto l2306A596;
							word32 a4_4396;
							word32 a7_4397;
							word32 a1_4393;
							word32 a2_4394;
							word32 a3_4395;
							mbedtls_debug_print_buf(ra_1000, 0x03, (word32) s1_630 + ((word32) s3_735 + 36), out a1_4393, out a2_4394, out a3_4395, out a4_4396, out a5_1029, out a7_4397);
							if (s2_797 != 0x00)
								goto l2306A596;
							struct Eq_350339 * s5_835;
							word32 a1_4398;
							word32 a5_4402;
							word32 s4_4404;
							word32 s6_4405;
							word32 t4_4409;
							word32 s11_4408;
							word32 s9_4407;
							word32 s7_4406;
							word32 a7_4403;
							word32 a2_4399;
							word32 a3_4400;
							word32 a4_4401;
							mbedtls_debug_print_msg(ra_1000, s10_1008, 0x02, &g_t2308D1B8, a5_1029, out a1_4398, out a2_4399, out a3_4400, out a4_4401, out a5_4402, out a7_4403, out s4_4404, out s5_835, out s6_4405, out s7_4406, out s8_633, out s9_4407, out s10_1008, out s11_4408, out t4_4409);
							s3_765 = s5_835;
						}
						word32 a5_847 = s1_630 + s3_765;
						Eq_350358 s6_1089 = (word32) a5_847->b0000 << 8 | (word32) a5_847->b0001;
						a5_1029.u0 = 0x01;
						if (s6_1089 <= 0x01)
						{
l2306AA5E:
							goto l2306A596;
						}
						word32 s9_854 = s3_765 + s6_1089;
						if (s8_633 <u s9_854 + 3)
							goto l2306AA5E;
						uint32 s5_1741 = s6_1089 & 1;
						if ((s6_1089 & 1) != 0x00)
							goto l2306AA5E;
						word32 s3_1546 = s3_765 + 0x02 + s1_630;
						word32 a7_4415;
						word32 a1_4410;
						word32 a5_4414;
						word32 a4_4413;
						word32 a3_4412;
						word32 a2_4411;
						mbedtls_debug_print_buf(ra_1000, 0x03, s3_1546, out a1_4410, out a2_4411, out a3_4412, out a4_4413, out a5_4414, out a7_4415);
						word32 a6_884 = CONVERT(Mem763[s1_630 + (s9_854 + 0x02):byte], byte, word32);
						a5_1029.u0 = 0x0F;
						word32 s2_1560 = 0x2308A000;
						if (a6_884 > ~0x0F)
						{
l2306AAAE:
							goto l2306AABA;
						}
						word32 s9_888 = s9_854 + 0x02 + a6_884;
						if (s8_633 <u s9_888 + 1)
							goto l2306AAAE;
						Mem904[sp_1097 + 8:word32] = s9_888 + 1;
						Eq_350203 a7_911;
						word32 a2_4417;
						word32 a3_4418;
						word32 a4_4419;
						word32 a5_4420;
						word32 a1_4416;
						mbedtls_debug_print_buf(ra_1000, 0x03, s1_630 + (s9_854 + 3), out a1_4416, out a2_4417, out a3_4418, out a4_4419, out a5_4420, out a7_911);
						*((word32) *((word32) s10_1008 + 44) + 4) = 0x00;
						if (((word32) *((word32) *s10_1008 + 116) & 0x02) != 0x00)
							*((word32) *((word32) s10_1008 + 44) + 4) = 0x00;
						a5_1029 = s9_888 + 3;
						if (a7_911 < s8_633)
						{
							if (s8_633 <u s9_888 + 3)
								goto l2306AABA;
							s5_1741 = CONVERT(Mem930[s1_630 + a7_911:byte], byte, word32) << 8 | CONVERT(Mem930[(s9_888 + s1_630) + 2:byte], byte, word32);
							if (s5_1741 > ~0x02 && s8_633 == s5_1741 + (s9_888 + 3))
								goto l2306AB4A;
						}
						else
						{
l2306AB4A:
							word32 s1_1192 = s1_630 + (s9_888 + 3);
							word32 a4_4437;
							word32 a5_4438;
							word32 a7_4439;
							word32 a3_4436;
							word32 a2_4435;
							word32 a1_4434;
							mbedtls_debug_print_buf(ra_1000, 0x03, s1_1192, out a1_4434, out a2_4435, out a3_4436, out a4_4437, out a5_4438, out a7_4439);
							do
							{
								struct Eq_274 * a4_1363;
								Eq_2 a5_1359;
								if (s5_1741 == 0x00)
								{
									Eq_2 a5_1761 = s3_1546;
									do
									{
										if ((word32) *a5_1761 == 0x00 && (word32) (*((word32) a5_1761 + 1)) == 0x00FF)
										{
											word32 t4_4452;
											word32 s8_4449;
											word32 s9_4450;
											word32 s11_4451;
											word32 a5_4444;
											word32 a7_4445;
											word32 s4_4446;
											word32 s5_4447;
											word32 s7_4448;
											word32 a1_4440;
											word32 a4_4443;
											word32 a2_4441;
											word32 a3_4442;
											mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308D3A4, a5_1761, out a1_4440, out a2_4441, out a3_4442, out a4_4443, out a5_4444, out a7_4445, out s4_4446, out s5_4447, out s6_1089, out s7_4448, out s8_4449, out s9_4450, out s10_1008, out s11_4451, out t4_4452);
											*((word32) s10_1008 + 188) = 0x01;
											goto l2306ABA0;
										}
										a5_1761 += 0x02;
									} while (a5_1761 - s3_1546 < s6_1089);
									struct Eq_350871 * a5_1780 = *s10_1008;
									if (*((word32) s10_1008 + 188) != 0x01)
									{
										ui32 a5_1781 = (word32) a5_1780->w0074;
										a5_1359 = a5_1781 & 48;
										if ((a5_1781 & 48) == 32)
										{
											a4_1363 = (struct Eq_274 *) &g_t2308CBD0;
l2306AE02:
											Eq_2 a5_1804;
											Eq_2 s10_1810;
											word32 s9_4513;
											word32 s11_4514;
											word32 t4_4515;
											word32 s4_4508;
											word32 s5_4509;
											word32 s6_4510;
											word32 s7_4511;
											word32 s8_4512;
											word32 a2_4504;
											word32 a7_4507;
											word32 a3_4505;
											word32 a4_4506;
											word32 a1_4503;
											mbedtls_debug_print_msg(ra_1000, s10_1008, 0x01, a4_1363, a5_1359, out a1_4503, out a2_4504, out a3_4505, out a4_4506, out a5_1804, out a7_4507, out s4_4508, out s5_4509, out s6_4510, out s7_4511, out s8_4512, out s9_4513, out s10_1810, out s11_4514, out t4_4515);
											Eq_2 a0_1827;
											mbedtls_ssl_send_fatal_handshake_failure(ra_1000, s10_1810, a5_1804, mstatus, out a0_1827, out a4_133, out s5, out mstatus);
											s0_105 = a0_1827;
											if (a0_1827 == 0x00)
												goto l2306A5A2;
											goto l2306A4CE;
										}
									}
l2306ABA0:
									int32 * s5_1891 = *((word32) *s10_1008 + *((word32) s10_1008 + 0x0C) * 4);
									Eq_2 a5_1892 = 0x00;
									while (*s5_1891 != 0x00)
									{
										Eq_2 s4_1897 = s3_1546;
										do
										{
											struct Eq_268327 * a0_1900 = *s5_1891;
											if ((word32) *s4_1897 == (a0_1900 >> 0x08 & 0x00FF) && (word32) (*((word32) s4_1897 + 1)) == (a0_1900 & 0x00FF))
											{
												Eq_2 a5_1908;
												if (mbedtls_ssl_ciphersuite_from_id(a0_1900, a0_1900 & 0x00FF, out a5_1908) == null)
												{
													word32 a5_4493;
													word32 a7_4494;
													word32 s6_4496;
													word32 s7_4497;
													word32 s11_4501;
													word32 t4_4502;
													word32 s10_4500;
													word32 s9_4499;
													word32 s8_4498;
													word32 s4_4495;
