pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
													word32 a3_4492;
													word32 a1_4490;
													word32 a2_4491;
													mbedtls_debug_print_msg(ra_1000, s10_1008, 0x01, &g_t23088F14, a5_1908, out a1_4490, out a2_4491, out a3_4492, out a4_133, out a5_4493, out a7_4494, out s4_4495, out s5, out s6_4496, out s7_4497, out s8_4498, out s9_4499, out s10_4500, out s11_4501, out t4_4502);
													s0_105.u0 = 0xF9000400;
													goto l2306A4CE;
												}
												struct Eq_274 * a4_2285;
												Eq_2 a5_2083;
												struct Eq_350796 * a4_1925;
												word32 a1_4481;
												word32 a2_4482;
												word32 a3_4483;
												word32 a5_4484;
												word32 a7_4485;
												word32 s8_4486;
												word32 s9_4487;
												word32 s11_4488;
												word32 t4_4489;
												Eq_2 s7_1932;
												mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308D3CC, a5_1908, out a1_4481, out a2_4482, out a3_4483, out a4_1925, out a5_4484, out a7_4485, out s4_1897, out s5_1891, out s6_1089, out s7_1932, out s8_4486, out s9_4487, out s10_1008, out s11_4488, out t4_4489);
												struct Eq_350796 * a5_1939 = *((word32) s10_1008 + 0x0C);
												if (a5_1939 >= a4_1925)
												{
													struct Eq_347014 * s1_1941 = a4_1925->ptr0018;
													if (a4_1925 < a5_1939)
														goto l2306B140;
													if (((word32) *((word32) *s10_1008 + 116) & 0x02) != 0x00 && ((word32) s1_1941->b001C & 0x04) != 0x00)
														goto l2306B158;
													word32 a0_1949 = mbedtls_ssl_get_ciphersuite_sig_pk_alg(s1_1941);
													Eq_2 a5_1954 = *((word32) s10_1008 + 48);
													if (*((word32) a5_1954 + 16) == 0x00)
														a5_1954 = *s10_1008;
													if (a0_1949 != 0x00)
													{
														Eq_2 a5_1973;
														Eq_2 s10_1979;
														word32 t4_4580;
														word32 s7_4577;
														word32 s8_4578;
														word32 s9_4579;
														word32 a4_4572;
														word32 a7_4573;
														word32 s4_4574;
														word32 s5_4575;
														word32 s6_4576;
														word32 a3_4571;
														word32 a1_4569;
														word32 a2_4570;
														int32 * s11_1980;
														mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308D404, a5_1954, out a1_4569, out a2_4570, out a3_4571, out a4_4572, out a5_1973, out a7_4573, out s4_4574, out s5_4575, out s6_4576, out s7_4577, out s8_4578, out s9_4579, out s10_1979, out s11_1980, out t4_4580);
														if (s11_1980 == null)
														{
															word32 a3_4590;
															word32 s5_4594;
															word32 s7_4596;
															word32 s8_4597;
															word32 t4_4600;
															word32 s11_4599;
															word32 s9_4598;
															word32 s6_4595;
															word32 a4_4591;
															word32 a7_4592;
															word32 s4_4593;
															word32 a1_4588;
															word32 a2_4589;
															mbedtls_debug_print_msg(ra_1000, s10_1979, 0x03, &g_t2308D428, a5_1973, out a1_4588, out a2_4589, out a3_4590, out a4_4591, out a5_2083, out a7_4592, out s4_4593, out s5_4594, out s6_4595, out s7_4596, out s8_4597, out s9_4598, out s10_1008, out s11_4599, out t4_4600);
															goto l2306B1D2;
														}
														do
														{
															struct Eq_274 * a4_2063;
															struct Eq_299479 * s1_2008;
															ptr32 s9_2010;
															Eq_2 a5_2014;
															word32 a3_4584;
															word32 s4_4585;
															word32 s7_4586;
															word32 a0_4581;
															word32 a1_4582;
															word32 a2_4583;
															struct Eq_351304 * s11_2022;
															ra_1000 = mbedtls_debug_print_crt(ra_1000, 0x03, 587781188, *s11_1980, out s0_105, out s1_2008, out a0_4581, out a1_4582, out a2_4583, out a3_4584, out a5_2014, out s3_1546, out s4_4585, out s7_4586, out s9_2010, out s10_1008, out s11_2022);
															word32 a5_4587;
															if (mbedtls_pk_can_do(s11_2022[1], s9_2010, a5_2014, out a5_4587) == 0x00)
																a4_2063 = (struct Eq_274 *) &g_t2308D470;
															else
															{
																word32 a0_2042;
																word32 s8_2054;
																word32 s1_4611;
																word32 a5_4612;
																word32 s4_4613;
																s0_105 = mbedtls_ssl_check_cert_usage(s11_2022->ptr0000, s1_2008, 0x01, out s1_4611, out a0_2042, out a5_4612, out s3_1546, out s4_4613, out s8_2054);
																if (a0_2042 != 0x00)
																	a4_2063 = (struct Eq_274 *) &g_t2308D490;
																else
																{
																	if (*((word32) s10_1008 + 0x0C) > 0x02 || (word32) (s11_2022->ptr0000)->b0128 == 0x04)
																		goto l2306B22E;
																	a4_2063 = (struct Eq_274 *) &g_t2308D4C8;
																}
															}
															struct Eq_351447 * s11_2090;
															struct Eq_351304 * s8_2095;
															word32 s6_4621;
															word32 s7_4622;
															word32 t4_4624;
															word32 s9_4623;
															word32 s5_4620;
															word32 a1_4614;
															word32 a7_4618;
															word32 s4_4619;
															word32 a2_4615;
															word32 a3_4616;
															word32 a4_4617;
															mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, a4_2063, 0x2308D000, out a1_4614, out a2_4615, out a3_4616, out a4_4617, out a5_2083, out a7_4618, out s4_4619, out s5_4620, out s6_4621, out s7_4622, out s8_2095, out s9_4623, out s10_1008, out s11_2090, out t4_4624);
															s11_1980 = s11_2090->ptr0008;
														} while (s11_1980 != null);
														if (s8_2095 == null)
														{
l2306B1D2:
															a4_2285 = (struct Eq_274 *) &g_t2308D548;
															goto l2306B14C;
														}
														s11_2022 = s8_2095;
l2306B22E:
														*((word32) *((word32) s10_1008 + 48) + 8) = s11_2022;
														word32 a0_4759;
														word32 s1_4758;
														word32 a2_4761;
														word32 a3_4762;
														word32 a1_4760;
														word32 s3_4763;
														word32 s11_4767;
														word32 s9_4766;
														word32 s4_4764;
														word32 s7_4765;
														ra_1000 = mbedtls_debug_print_crt(ra_1000, 0x03, 587781380, **((word32) *((word32) s10_1008 + 48) + 8), out s0_105, out s1_4758, out a0_4759, out a1_4760, out a2_4761, out a3_4762, out a5_1954, out s3_4763, out s4_4764, out s7_4765, out s9_4766, out s10_1008, out s11_4767);
													}
													int32 * s1_2151 = *((word32) a5_1954 + 4);
													Eq_2 a2_2164;
													union Eq_2 ** s5_2171;
													word32 a1_4557;
													word32 a3_4558;
													word32 a5_4560;
													word32 a7_4561;
													word32 t4_4568;
													word32 s8_4565;
													word32 s9_4566;
													word32 s11_4567;
													word32 s7_4564;
													word32 s6_4563;
													word32 s4_4562;
													word32 a4_4559;
													Eq_2 s10_2168;
													mbedtls_debug_print_msg(ra_1000, s10_1008, 0x02, &g_t2308D52C, a5_1954, out a1_4557, out a2_2164, out a3_4558, out a4_4559, out a5_4560, out a7_4561, out s4_4562, out s5_2171, out s6_4563, out s7_4564, out s8_4565, out s9_4566, out s10_2168, out s11_4567, out t4_4568);
													**s5_2171 = (union Eq_2 **) *((word32) s10_2168 + 44);
													*s1_2151 = (int32) *((word32) s10_2168 + 64);
													*((word32) s10_2168 + 4) = (word32) *((word32) s10_2168 + 4) + 1;
													ui32 a5_2189 = (word32) *((word32) *s10_2168 + 116);
													Eq_2 a5_2190 = a5_2189 & 0x02;
													if ((a5_2189 & 0x02) != 0x00)
														ra_1000 = mbedtls_ssl_recv_flight_completed(ra_1000, a2_2164, a5_2189 & 0x02, mstatus, sp_1097->dw0000, sp_1097->dw0004, sp_1097[52], sp_1097->dw0178, out a5_2190, out s10_2168);
													word32 s11_4636;
													word32 t4_4637;
													word32 a1_4625;
													word32 s7_4632;
													word32 s10_4635;
													word32 s8_4633;
													word32 s9_4634;
													word32 a7_4629;
													word32 s4_4630;
													word32 s6_4631;
													word32 a5_4628;
													word32 a3_4627;
													word32 a2_4626;
													mbedtls_debug_print_msg(ra_1000, s10_2168, 0x02, &g_t2308D5CC, a5_2190, out a1_4625, out a2_4626, out a3_4627, out a4_133, out a5_4628, out a7_4629, out s4_4630, out s5, out s6_4631, out s7_4632, out s8_4633, out s9_4634, out s10_4635, out s11_4636, out t4_4637);
													goto l2306A4CE;
												}
l2306B140:
												a5_2083.u0 = 0x2308D000;
												a4_2285 = (struct Eq_274 *) &g_t2308D3E4;
l2306B14C:
												word32 s11_4609;
												word32 t4_4610;
												word32 s8_4607;
												word32 s9_4608;
												word32 a2_4602;
												word32 a7_4606;
												word32 a5_4605;
												word32 a4_4604;
												word32 a3_4603;
												word32 a1_4601;
												mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, a4_2285, a5_2083, out a1_4601, out a2_4602, out a3_4603, out a4_4604, out a5_4605, out a7_4606, out s4_1897, out s5_1891, out s6_1089, out s7_1932, out s8_4607, out s9_4608, out s10_1008, out s11_4609, out t4_4610);
l2306B158:
												a5_1892 = s7_1932;
											}
											s4_1897 += 0x02;
										} while (s4_1897 - s3_1546 < s6_1089);
										++s5_1891;
									}
									if (a5_1892 != 0x00)
									{
										Eq_2 a5_2459;
										Eq_2 s10_2465;
										word32 t4_4479;
										word32 a2_4468;
										word32 s6_4474;
										word32 s11_4478;
										word32 s9_4477;
										word32 s8_4476;
										word32 s7_4475;
										word32 a3_4469;
										word32 s5_4473;
										word32 s4_4472;
										word32 a7_4471;
										word32 a4_4470;
										word32 a1_4467;
										mbedtls_debug_print_msg(ra_1000, s10_1008, 0x01, &g_t2308D578, a5_1892, out a1_4467, out a2_4468, out a3_4469, out a4_4470, out a5_2459, out a7_4471, out s4_4472, out s5_4473, out s6_4474, out s7_4475, out s8_4476, out s9_4477, out s10_2465, out s11_4478, out t4_4479);
										word32 a0_4480;
										s0_105 = mbedtls_ssl_send_fatal_handshake_failure(ra_1000, s10_2465, a5_2459, mstatus, out a0_4480, out a4_133, out s5, out mstatus) + 1664;
									}
									else
									{
										Eq_2 a5_2394;
										Eq_2 s10_2400;
										word32 s8_4462;
										word32 s9_4463;
										word32 s11_4464;
										word32 t4_4465;
										word32 s6_4460;
										word32 s7_4461;
										word32 a4_4456;
										word32 a7_4457;
										word32 s4_4458;
										word32 s5_4459;
										word32 a1_4453;
										word32 a2_4454;
										word32 a3_4455;
										mbedtls_debug_print_msg(ra_1000, s10_1008, 0x01, &g_t2308D5AC, a5_1892, out a1_4453, out a2_4454, out a3_4455, out a4_4456, out a5_2394, out a7_4457, out s4_4458, out s5_4459, out s6_4460, out s7_4461, out s8_4462, out s9_4463, out s10_2400, out s11_4464, out t4_4465);
										word32 a0_4466;
										s0_105 = mbedtls_ssl_send_fatal_handshake_failure(ra_1000, s10_2400, a5_2394, mstatus, out a0_4466, out a4_133, out s5, out mstatus) + -896;
									}
									goto l2306A4CE;
								}
								uint32 a5_976 = (word32) *((word32) s1_1192 + 1) << 8 | (word32) (*s1_1192);
								uint32 a4_984 = (word32) *((word32) s1_1192 + 3) << 8 | (word32) (*((word32) s1_1192 + 2));
								a5_1029 = (word32) (word16) (a5_976 >> 8 | a5_976 << 0x08);
								if (s5_1741 < (word32) ((word16) (a4_984 << 0x08 | a4_984 >> 8)) + 4)
									break;
								Eq_350983 s8_1091;
								Eq_2 s4_1087;
								struct Eq_274 * a4_1062;
								struct Eq_274 * a4_1066;
								Eq_2 a5_1065;
								if (a5_1029 != 0x0D)
								{
									Eq_2 a2_1451;
									Eq_2 a5_1404;
									if (a5_1029 <= 0x0D)
									{
										if (a5_1029 != 0x00)
										{
											if (a5_1029 != 0x01)
												goto l2306AC44;
											sp_1097->dw0008 = (word32) a5_1029;
											word32 s11_4545;
											word32 t4_4546;
											word32 s7_4543;
											word32 s9_4544;
											word32 a1_4538;
											word32 a7_4542;
											word32 a4_4541;
											word32 a3_4540;
											word32 a2_4539;
											mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308D2EC, a5_1029, out a1_4538, out a2_4539, out a3_4540, out a4_4541, out a5_1029, out a7_4542, out s4_1087, out s5, out s6_1089, out s7_4543, out s8_1091, out s9_4544, out s10_1008, out s11_4545, out t4_4546);
											if (s4_1087 != a5_1029)
											{
l2306AF16:
												break;
											}
											a5_1029 = (word32) *((word32) s1_1192 + 4);
											if (a5_1029 > 0x04)
												goto l2306AF16;
											*((word32) *((word32) s10_1008 + 44) + 112) = (byte) a5_1029;
										}
										else
										{
											word32 a3_4530;
											word32 a5_4532;
											word32 a7_4533;
											word32 t4_4537;
											word32 s11_4536;
											word32 s9_4535;
											word32 s7_4534;
											word32 a4_4531;
											word32 a1_4528;
											word32 a2_4529;
											mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308D228, a5_1029, out a1_4528, out a2_4529, out a3_4530, out a4_4531, out a5_4532, out a7_4533, out s4_1087, out s5, out s6_1089, out s7_4534, out s8_1091, out s9_4535, out s10_1008, out s11_4536, out t4_4537);
											Eq_2 a5_1478 = *((word32) *s10_1008 + 44);
											if (a5_1478 != 0x00)
											{
												word32 s11_1493;
												word32 s7_1497;
												word32 s9_1499;
												word32 t4_4644;
												word32 a4_4641;
												word32 a5_4642;
												word32 a7_4643;
												word32 a1_4638;
												word32 a2_4639;
												word32 a3_4640;
												mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308D244, a5_1478, out a1_4638, out a2_4639, out a3_4640, out a4_4641, out a5_4642, out a7_4643, out s4_1087, out s5, out s6_1089, out s7_1497, out s8_1091, out s9_1499, out s10_1008, out s11_1493, out t4_4644);
												uint32 a4_1507 = (word32) *((word32) s1_1192 + 5) << 8 | (word32) (*((word32) s1_1192 + 4));
												a5_1029 = (word32) (word16) (a4_1507 << 0x08 | a4_1507 >> 8);
												if (s4_1087 != (word32) a5_1029 + 2)
													break;
												word32 a2_1514 = s1_1192 + 6;
												while (a5_1029 != 0x00)
												{
													uint32 a4_1522 = (word32) *((word32) a2_1514 + 2) << 8 | (word32) (*((word32) a2_1514 + 1));
													Eq_351781 a3_1527 = (word32) (word16) (a4_1522 << 0x08 | a4_1522 >> 8);
													if (a5_1029 <u a3_1527 + 3)
														goto l2306AABA;
													word32 a0_1529 = (word32) *a2_1514;
													if (a0_1529 == 0x00)
													{
														Eq_2 a0_1570;
														word32 a3_1573;
														word32 a6_1579;
														word32 a7_1580;
														word32 t3_1581;
														word32 t0_1582;
														word32 t1_1583;
														word32 t4_1584;
														word32 tp_1585;
														word32 t5_1587;
														(a3_1527 + 3)();
														if (a0_1570 == 0x00)
															break;
														word32 s11_4700;
														word32 s6_4696;
														word32 s9_4699;
														word32 s7_4697;
														word32 s8_4698;
														word32 a4_4693;
														word32 s4_4694;
														word32 s5_4695;
														word32 a3_4692;
														word32 a2_4691;
														word32 a1_4690;
														mbedtls_debug_print_ret(ra_1000, 0x01, 0x007B, a0_1570, out a1_4690, out a2_4691, out a3_4692, out a4_4693, out a5_1404, out s4_4694, out s5_4695, out s6_4696, out s7_4697, out s8_4698, out s9_4699, out s10_1008, out s11_4700);
														a2_1451.u0 = 112;
														goto l2306ADBC;
													}
													a5_1029 = (word32) a5_1029 + (~0x02 - a3_1527);
													a2_1514 += a3_1527 + 3;
												}
											}
										}
										goto l2306AD3A;
									}
									if (a5_1029 == 35)
									{
										word32 t4_4654;
										word32 s9_4652;
										word32 s11_4653;
										word32 a4_4648;
										word32 a5_4649;
										word32 a7_4650;
										word32 s7_4651;
										word32 a1_4645;
										word32 a2_4646;
										word32 a3_4647;
										mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308D310, 0x2308D000, out a1_4645, out a2_4646, out a3_4647, out a4_4648, out a5_4649, out a7_4650, out s4_1087, out s5, out s6_1089, out s7_4651, out s8_1091, out s9_4652, out s10_1008, out s11_4653, out t4_4654);
										struct Eq_351616 * a4_1103;
										ra_1000 = mbedtls_ssl_session_init(ra_1000, &sp_1097->dw000C + 20, out a4_1103);
										struct Eq_351622 * a5_1109 = a4_1103->ptr0040;
										if (a4_1103 == null || a5_1109->dw003C == 0x00)
											goto l2306AD3A;
										*((word32) *((word32) s10_1008 + 48) + 344) = 0x01;
										<anonymous> * a4_1126;
										word32 s11_4708;
										word32 t4_4709;
										word32 a7_4705;
										word32 s7_4706;
										word32 s9_4707;
										word32 a1_4701;
										word32 a2_4702;
										word32 a3_4703;
										word32 a5_4704;
										Eq_2 a0_1121 = mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308CF24, s4_1087, out a1_4701, out a2_4702, out a3_4703, out a4_1126, out a5_4704, out a7_4705, out s4_1087, out s5, out s6_1089, out s7_4706, out s8_1091, out s9_4707, out s10_1008, out s11_4708, out t4_4709);
										if (s4_1087 == 0x00)
											goto l2306AD3A;
										word32 a0_1146;
										Eq_2 a5_1147;
										Eq_2 a1_1148;
										Eq_2 a2_1149;
										a4_1126();
										if (a0_1146 != 0x00)
										{
											sp_1097->dw0008 = a0_1146;
											word32 a4_4729;
											word32 a3_4728;
											word32 a2_4727;
											word32 a0_4726;
											s1_1192 = mbedtls_ssl_session_free(ra_1000, &sp_1097->dw000C + 20, a1_1148, a2_1149, a5_1147, mstatus, sp_1097->dw0128, sp_1097->dw0148, sp_1097[60], sp_1097->dw0188, out a0_4726, out a2_4727, out a3_4728, out a4_4729, out a5_1065);
											if (a5_1065 == ~0x0700017F)
											{
												a4_1066 = (struct Eq_274 *) &g_t2308D330;
												goto l2306AE8C;
											}
											if (a5_1065 == 0xF9000280)
											{
												a4_1066 = (struct Eq_274 *) &g_t2308D348;
												goto l2306AE8C;
											}
											word32 a2_4741;
											word32 a1_4740;
											word32 a3_4742;
											word32 s9_4746;
											word32 s11_4747;
											word32 a4_4743;
											word32 a5_4744;
											word32 s7_4745;
											mbedtls_debug_print_ret(ra_1000, 0x01, 483, a5_1065, out a1_4740, out a2_4741, out a3_4742, out a4_4743, out a5_4744, out s4_1087, out s5, out s6_1089, out s7_4745, out s8_1091, out s9_4746, out s10_1008, out s11_4747);
										}
										else
										{
											word32 a1_1167 = *((word32) a2_1149 + 8);
											sp_1097->dw00B0 = (word32) a2_1149;
											Eq_2 a5_1171;
											Eq_2 a1_1173;
											Eq_2 a2_1174;
											word32 a6_4712;
											word32 a7_4713;
											word32 a3_4710;
											word32 a4_4711;
											memcpy(&sp_1097->dw000C + 23, a1_1167 + 0x0C, a2_1149, out a1_1173, out a2_1174, out a3_4710, out a4_4711, out a5_1171, out a6_4712, out a7_4713);
											word32 a5_4718;
											word32 a3_4716;
											word32 a4_4717;
											word32 a0_4714;
											word32 a2_4715;
											s1_1192 = mbedtls_ssl_session_free(ra_1000, *((word32) s10_1008 + 44), a1_1173, a2_1174, a5_1171, mstatus, sp_1097->dw0128, sp_1097->dw0148, sp_1097[60], sp_1097->dw0188, out a0_4714, out a2_4715, out a3_4716, out a4_4717, out a5_4718);
											word32 a4_4722;
											word32 a6_4724;
											word32 a7_4725;
											word32 a5_4723;
											word32 a1_4719;
											word32 a2_4720;
											word32 a3_4721;
											memcpy(*((word32) s10_1008 + 44), &sp_1097->dw000C + 20, 116, out a1_4719, out a2_4720, out a3_4721, out a4_4722, out a5_4723, out a6_4724, out a7_4725);
											byte * a5_1212 = &sp_1097->dw000C + 20;
											do
											{
												*a5_1212 = 0x00;
												++a5_1212;
											} while (a5_1212 != &sp_1097->dw00C4 + 3);
											word32 a1_4748;
											word32 a4_4751;
											word32 s7_4754;
											word32 s9_4755;
											word32 s11_4756;
											word32 t4_4757;
											word32 a7_4753;
											word32 a5_4752;
											word32 a2_4749;
											word32 a3_4750;
											mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308D378, 0x2308D000, out a1_4748, out a2_4749, out a3_4750, out a4_4751, out a5_4752, out a7_4753, out s4_1087, out s5, out s6_1089, out s7_4754, out s8_1091, out s9_4755, out s10_1008, out s11_4756, out t4_4757);
											*((word32) *((word32) s10_1008 + 48) + 328) = 0x01;
											*((word32) *((word32) s10_1008 + 48) + 344) = 0x00;
										}
										goto l2306AD3A;
									}
									if (a5_1029 != 0x0FFFFF01)
									{
										if (a5_1029 == 0x10)
										{
											word32 t4_4673;
											word32 s9_4671;
											word32 s11_4672;
											word32 a2_4666;
											word32 s7_4670;
											word32 a7_4669;
											word32 a5_4668;
											word32 a3_4667;
											word32 a1_4665;
											mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308CB90, a5_1029, out a1_4665, out a2_4666, out a3_4667, out a4_133, out a5_4668, out a7_4669, out s4_1087, out s5, out s6_1089, out s7_4670, out s8_1091, out s9_4671, out s10_1008, out s11_4672, out t4_4673);
											int32 * s11_1392 = *((word32) *s10_1008 + 96);
											if (s11_1392 != null)
											{
												if (s4_1087 > 0x03)
												{
													uint32 a5_1397 = (word32) *((word32) s1_1192 + 5) << 8 | (word32) (*((word32) s1_1192 + 4));
													a4_133 = (word32) s4_1087 - 2;
													if ((word32) (word16) (a5_1397 >> 8 | a5_1397 << 0x08) == (word32) s4_1087 - 2)
													{
														a5_1404 = s1_1192 + 6;
														sp_1097->dw0008 = (word32) a5_1404;
														word32 s9_1406 = s1_1192 + s8_1091;
														while (true)
														{
															Eq_2 a0_1409 = *s11_1392;
															if (a0_1409 == 0x00)
																break;
															word32 a1_4674;
															word32 a2_4675;
															word32 a3_4676;
															word32 a4_4677;
															a4_133 = strlen(a0_1409, out a1_4674, out a2_4675, out a3_4676, out a4_4677, out a5_1404);
															while (s9_1406 != a5_1404)
															{
																if (s9_1406 < a5_1404)
																	goto l2306A5A2;
																word32 a6_1421 = a5_1404 + 1;
																Eq_2 a5_1423 = (word32) *a5_1404;
																if (a5_1423 == 0x00)
																	goto l2306A5A2;
																if (a4_133 == a5_1423)
																{
																	Eq_2 a1_1426 = *s11_1392;
																	sp_1097->dw008C = (word32) a5_1423;
																	sp_1097[2] = (struct Eq_349831) a4_133;
																	sp_1097->dw0088 = (word32) a6_1421;
																	word32 a2_4688;
																	word32 a3_4689;
																	word32 a1_4687;
																	Eq_2 a0_1433 = memcmp(a6_1421, a1_1426, a4_133, out a1_4687, out a2_4688, out a3_4689, out a4_133, out a5_1423);
																	s4_1087 = sp_1097->dw0008;
																	s8_1091 = sp_1097->dw00C4;
																	if (a0_1433 == 0x00)
																	{
																		*((word32) s10_1008 + 0x00B8) = *s11_1392;
																		goto l2306AD3A;
																	}
