pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
																}
																a5_1404 = a5_1423 + a6_1421;
															}
															++s11_1392;
														}
														a2_1451.u0 = 0x0078;
l2306ADBC:
														word32 s9_4685;
														word32 s10_4686;
														word32 s8_4684;
														word32 s0_4678;
														word32 s2_4682;
														word32 s3_4683;
														word32 s1_4679;
														word32 a0_4680;
														word32 a5_4681;
														mbedtls_ssl_send_alert_message(ra_1000, s10_1008, a2_1451, a5_1404, mstatus, out s0_4678, out s1_4679, out a0_4680, out a4_133, out a5_4681, out s2_4682, out s3_4683, out s5, out s8_4684, out s9_4685, out s10_4686, out mstatus);
													}
												}
												goto l2306A5A2;
											}
										}
										else
										{
l2306AC44:
											a4_1062 = (struct Eq_274 *) &g_t2308CBA8;
l2306AEDA:
											word32 a1_4547;
											word32 a2_4548;
											word32 a3_4549;
											word32 t4_4556;
											word32 a4_4550;
											word32 s9_4554;
											word32 s11_4555;
											word32 a5_4551;
											word32 a7_4552;
											word32 s7_4553;
											mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, a4_1062, a5_1029, out a1_4547, out a2_4548, out a3_4549, out a4_4550, out a5_4551, out a7_4552, out s4_1087, out s5, out s6_1089, out s7_4553, out s8_1091, out s9_4554, out s10_1008, out s11_4555, out t4_4556);
										}
										goto l2306AD3A;
									}
									word32 a4_4658;
									word32 a7_4660;
									word32 s7_4661;
									word32 t4_4664;
									word32 s11_4663;
									word32 s9_4662;
									word32 a5_4659;
									word32 a1_4655;
									word32 a2_4656;
									word32 a3_4657;
									mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308CB08, a5_1029, out a1_4655, out a2_4656, out a3_4657, out a4_4658, out a5_4659, out a7_4660, out s4_1087, out s5, out s6_1089, out s7_4661, out s8_1091, out s9_4662, out s10_1008, out s11_4663, out t4_4664);
									a5_1359.u0 = 0x01;
									if (s4_1087 == 0x01)
									{
										a5_1359 = (word32) *((word32) s1_1192 + 4);
										if (a5_1359 != 0x00)
											goto l2306ADF6;
										*((word32) s10_1008 + 188) = s4_1087;
										goto l2306AD3A;
									}
l2306ADF6:
									a4_1363 = (struct Eq_274 *) &g_t2308CB28;
									goto l2306AE02;
								}
								ptr32 s4_1010;
								Eq_351017 s8_1014;
								word32 s11_4526;
								word32 t4_4527;
								word32 s7_4524;
								word32 s9_4525;
								word32 a5_4520;
								word32 a7_4521;
								word32 s5_4522;
								word32 s6_4523;
								word32 a1_4516;
								word32 a2_4517;
								word32 a3_4518;
								word32 a4_4519;
								mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t2308D270, 0x2308D000, out a1_4516, out a2_4517, out a3_4518, out a4_4519, out a5_4520, out a7_4521, out s4_1010, out s5_4522, out s6_4523, out s7_4524, out s8_1014, out s9_4525, out s10_1008, out s11_4526, out t4_4527);
								uint32 a4_1024 = (word32) *((word32) s1_1192 + 5) << 8 | (word32) (*((word32) s1_1192 + 4));
								word32 a3_1022 = s1_1192 + s8_1014;
								a5_1029 = (word32) (word16) (a4_1024 << 0x08 | a4_1024 >> 8);
								if (s4_1010 != (word32) a5_1029 + 2)
								{
l2306AE64:
									break;
								}
								a5_1029 &= 0x01;
								if ((a5_1029 & 0x01) != 0x00)
									goto l2306AE64;
								int32 * s11_1033 = *((word32) *s10_1008 + 88);
								while (*s11_1033 != 0x00)
								{
									word32 s9_1038;
									for (s9_1038 = s1_1192 + 6; s9_1038 < a3_1022; s9_1038 += 0x02)
									{
										int32 a5_1043 = *s11_1033;
										word32 a0_1044 = (word32) *s9_1038;
										sp_1097->dw0088 = (word32) a3_1022;
										sp_1097->dw0008 = a5_1043;
										word32 a5_1050;
										if (a5_1050 == mbedtls_ssl_md_alg_from_hash(a0_1044, out a5_1050))
										{
											null[(word32) *s9_1038 / 4] = (struct Eq_352289 *) *((word32) s10_1008 + 48);
											a4_1062 = (struct Eq_274 *) &g_t2308D298;
											a5_1029 = **((word32) s10_1008 + 48);
											goto l2306AEDA;
										}
									}
									++s11_1033;
								}
								a5_1065.u0 = 0x2308D000;
								a4_1066 = (struct Eq_274 *) &g_t2308D2C8;
l2306AE8C:
								word32 t4_4739;
								word32 s11_4738;
								word32 s9_4737;
								word32 a7_4735;
								word32 s7_4736;
								word32 a1_4730;
								word32 a5_4734;
								word32 a4_4733;
								word32 a3_4732;
								word32 a2_4731;
								mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, a4_1066, a5_1065, out a1_4730, out a2_4731, out a3_4732, out a4_4733, out a5_4734, out a7_4735, out s4_1087, out s5, out s6_1089, out s7_4736, out s8_1091, out s9_4737, out s10_1008, out s11_4738, out t4_4739);
l2306AD3A:
								up32 s4_1740 = s5 - s4_1087;
								s5_1741 = s4_1740 + -4;
								a5_1029.u0 = 0x02;
								s1_1192 += s8_1091;
							} while (s4_1740 > ~0x06);
						}
l2306AABA:
l2306A59A:
						word32 s8_4429;
						word32 s9_4430;
						word32 s11_4432;
						word32 t4_4433;
						word32 s10_4431;
						word32 a1_4421;
						word32 s7_4428;
						word32 a2_4422;
						word32 s4_4426;
						word32 s6_4427;
						word32 a3_4423;
						word32 a5_4424;
						word32 a7_4425;
						mbedtls_debug_print_msg(ra_1000, s10_1008, 0x01, &g_t2308D074, a5_1029, out a1_4421, out a2_4422, out a3_4423, out a4_133, out a5_4424, out a7_4425, out s4_4426, out s5, out s6_4427, out s7_4428, out s8_4429, out s9_4430, out s10_4431, out s11_4432, out t4_4433);
l2306A5A2:
						s0_105.u0 = 0xF8000700;
					}
					else
					{
						sp_1097->dw0000 = (word32) a3_682;
						Eq_2 a5_2555;
						Eq_2 s10_2561;
						word32 a3_4338;
						word32 a7_4340;
						word32 s9_4346;
						word32 t4_4348;
						word32 s11_4347;
						word32 s4_4341;
						word32 s8_4345;
						word32 s7_4344;
						word32 s6_4343;
						word32 s5_4342;
						word32 a4_4339;
						word32 a1_4336;
						word32 a2_4337;
						mbedtls_debug_print_msg(ra_1000, s10_1008, 0x01, &g_t2308D178, a5_680, out a1_4336, out a2_4337, out a3_4338, out a4_4339, out a5_2555, out a7_4340, out s4_4341, out s5_4342, out s6_4343, out s7_4344, out s8_4345, out s9_4346, out s10_2561, out s11_4347, out t4_4348);
						word32 s0_2585;
						word32 s3_4353;
						word32 s8_4354;
						word32 s9_4355;
						word32 s10_4356;
						word32 a5_4351;
						word32 s2_4352;
						word32 a0_4350;
						word32 s1_4349;
						mbedtls_ssl_send_alert_message(ra_1000, s10_2561, 70, a5_2555, mstatus, out s0_2585, out s1_4349, out a0_4350, out a4_133, out a5_4351, out s2_4352, out s3_4353, out s5, out s8_4354, out s9_4355, out s10_4356, out mstatus);
						s0_105 = s0_2585 + 384;
					}
				}
			}
			break;
		}
	}
l2306A4CE:
	a4Out = a4_133;
	a5Out = dwArgE8;
	s3Out = dwArgC8;
	s5Out = s5;
	mstatusOut = mstatus;
	return s0_105;
}

