pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 2306C094: Register (ptr32 Eq_314656) mbedtls_x509_get_serial(Register Eq_2 a1, Register (ptr32 Eq_314656) a2, Register Eq_2 a5, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_x509_crt_parse_der
struct Eq_314656 * mbedtls_x509_get_serial(Eq_2 a1, struct Eq_314656 * a2, Eq_2 a5, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a5Out)
{
	Eq_352309 a0_5 = *a5;
	if (a1 - a5 <= 0x00)
	{
		a0Out.u0 = ~0x020002DF;
		a1Out = a1;
		a5Out = a5;
		return s1;
	}
	else if (((word32) *a5 & 0x007F) != 0x02)
	{
		a0Out.u0 = 4261412126;
		a1Out = a1;
		a5Out = a5;
		return s1;
	}
	else
	{
		Eq_2 a5_40;
		*((word32) a5 + 1) = a0_5;
		Eq_2 a5_24 = (word32) *a5;
		a2->t1000 = a5_24;
		struct Eq_314656 * s1_26 = a2;
		Eq_2 a1_32;
		struct Eq_352340 * a4_34;
		struct Eq_352341 * a5_35;
		word32 a2_83;
		word32 a3_84;
		Eq_2 a0_30 = mbedtls_asn1_get_len(a1, (char *) a2 + 4, a5_24, out a1_32, out a2_83, out a3_84, out a4_34, out a5_35);
		if (a0_30 != 0x00)
		{
			a5_40.u0 = 4261412224;
			a0_30 = (word32) a0_30 - 0x02000280;
		}
		else
		{
			word32 s0_37 = a5_35->dw0000;
			s1_26 = a4_34->ptr0004;
			a5_35->ptr0008 = s1_26;
			a5_40 = a5_35 + a4_34;
			*a5_40 = s0_37;
		}
		a0Out = a0_30;
		a1Out = a1_32;
		a5Out = a5_40;
		return s1_26;
	}
}

// 2306C0FC: Register Eq_2 mbedtls_x509_get_alg(Register Eq_2 a1, Register (ptr32 Eq_285049) a2, Register Eq_2 a3, Register Eq_2 a5, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_314587 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_314589) s3Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_x509_get_alg(Eq_2 a1, struct Eq_285049 * a2, Eq_2 a3, Eq_2 a5, Eq_2 dwArgA4, Eq_2 dwArg0118, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_314587 & a5Out, ptr32 & s2Out, struct Eq_314589 & s3Out)
{
	ptr32 a1_10;
	ptr32 s2_18;
	struct Eq_314589 * s3_19;
	word32 s4_60;
	word32 a4_59;
	word32 a3_58;
	word32 a2_57;
	ptr32 a0_24;
	Eq_314587 a5_14;
	Eq_2 s1_17 = mbedtls_asn1_get_alg(a1, a2, a3, a5, dwArgA4, dwArg0118, out a0_24, out a1_10, out a2_57, out a3_58, out a4_59, out a5_14, out s2_18, out s3_19, out s4_60);
	if (a0_24 != 0x00)
	{
		a5_14.u0 = ~0x020002FF;
		a0_24 += ~0x020002FF;
	}
	a0Out = a0_24;
	a1Out = a1_10;
	a2Out = dwArg10;
	a5Out = a5_14;
	s2Out = s2_18;
	s3Out = s3_19;
	return s1_17;
}

// 2306C114: Register Eq_2 mbedtls_x509_get_name(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0198, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out ptr32 s7Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_x509_get_name(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0198, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s5Out, union Eq_2 & s6Out, ptr32 & s7Out)
{
	Eq_2 s1_130 = a0;
	Eq_2 s6_169 = a2;
	uint32 s4_162 = 0x50581008;
	word32 s3_124 = ~0x0200037F;
l2306C13A:
	ptr32 a0_121;
	word32 a2_424;
	word32 a3_425;
	Eq_2 a4_111;
	ptr32 a1_109;
	Eq_2 a0_40 = mbedtls_asn1_get_tag(a1, fp + -56, 49, a5, out a1_109, out a2_424, out a3_425, out a4_111, out a5);
	if (a0_40 != 0x00)
	{
		a5.u0 = ~0x0200037F;
		a0_121 = (word32) a0_40 - 0x02000380;
	}
	else
	{
		Eq_2 s0_115 = s6_169;
		s7 = 0x1E;
		s2 = Mem47[s1_130 + 0x00:int32] + a5;
		s6_169.u0 = 0x01;
		do
		{
			word32 a2_418;
			Eq_2 a3_108;
			Eq_2 a0_107 = mbedtls_asn1_get_tag(s2, fp + -52, 48, a5, out a1_109, out a2_418, out a3_108, out a4_111, out a5);
			if (a0_107 != 0x00)
			{
l2306C186:
				a0_121 = (word32) a0_107 + s3_124;
				if (a0_121 != 0x00)
					goto l2306C152;
				goto l2306C18A;
			}
			s1_130 = *a5.u0;
			a4_111 = s2 - a5;
			if (a4_111 <= 0x00)
			{
l2306C1B6:
				a0_121 = ~0x020003DF;
				goto l2306C152;
			}
			Eq_2 a5_73 = (word32) *a5.u0;
			*a5_73 = s0_115;
			word32 a2_419;
			a0_107 = mbedtls_asn1_get_tag(s2, (word16) s0_115.u0 + 4, 0x06, a5_73, out a1_109, out a2_419, out a3_108, out a4_111, out a5);
			if (a0_107 != 0x00)
				goto l2306C186;
			s1_130 = *a5.u0;
			s0_115 = *((word32) a4_111 + 4);
			*((word16) a5.u0 + 8) = s0_115;
			a5 += a4_111;
			*a5.u0 = s1_130;
			a4_111 = s2 - a5;
			if (a4_111 <= 0x00)
				goto l2306C1B6;
			a4_111 = (word32) *a5.u0;
			if (a4_111 > 0x1E)
			{
l2306C220:
				a0_121 = ~0x020003E1;
				goto l2306C152;
			}
			uint32 a4_96 = s4_162 >> a4_111;
			a4_111 = a4_96 & 0x01;
			if ((a4_96 & 0x01) == 0x00)
				goto l2306C220;
			*((word16) a5.u0 + 1) = s1_130;
			Eq_2 a5_102 = (word32) *a5.u0;
			*((word32) a5_102 + 0x0C) = s0_115;
			word32 a2_420;
			a0_107 = mbedtls_asn1_get_len(s2, (word16) s0_115.u0 + 16, a5_102, out a1_109, out a2_420, out a3_108, out a4_111, out a5);
			if (a0_107 != 0x00)
				goto l2306C186;
			Eq_2 s1_114 = *a5.u0;
			s0_115 = *((word32) a4_111 + 16);
			*((word16) a5.u0 + 20) = s0_115;
			a5 += a4_111;
			*a5.u0 = s1_114;
			((word16) s0_115.u0 + 24)->u0 = 0x00;
l2306C18A:
			s1_130 = *a5.u0;
			if (a5 == s2)
			{
				if (a1 == s2)
				{
					a0_121 = 0x00;
					goto l2306C152;
				}
				else
				{
					Eq_2 s0_158;
					word32 s8_423;
					word32 a2_421;
					word32 a3_422;
					ra = mycalloc(ra, s1_130, 0x01, 32, a3_108, a4_111, a5, mstatus, dwLoc20, dwLoc1C, dwArgD8, dwArg0118, out s0_158, out s1_130, out a1_109, out a2_421, out a3_422, out a4_111, out a5, out s2, out s3_124, out s4_162, out s8_423);
					*(union Eq_2 *) 0x19 = s0_158;
					s6_169.u0 = 0x01;
					if (false)
						break;
					goto l2306C13A;
				}
			}
			((word32) s0_115 + 28)->u1 = 0x01;
			Eq_2 s0_185;
			word32 s8_417;
			word32 a2_415;
			word32 a3_416;
			ra = mycalloc(ra, s1_130, 0x01, 32, a3_108, a4_111, a5, mstatus, dwLoc20, dwLoc1C, dwArgD8, dwArg0118, out s0_185, out s1_130, out a1_109, out a2_415, out a3_416, out a4_111, out a5, out s2, out s3_124, out s4_162, out s8_417);
			*(union Eq_2 *) 0x19 = s0_185;
			s0_115.u0 = 0x01;
		} while (true);
		s6_169.u0 = 0x01;
		a0_121 = 0xFD000780;
	}
l2306C152:
	0x00 = (uint16) dwArg0198;
	s1Out = s1_130;
	a0Out = a0_121;
	a1Out = a1_109;
	a4Out = a4_111;
	a5Out = a5;
	s2Out = s2;
	s5Out = a1;
	s6Out = s6_169;
	s7Out = s7;
	return ra;
}

// 2306C244: Register Eq_2 mbedtls_x509_get_sig(Register Eq_2 a1, Register Eq_2 a5, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_x509_get_sig(Eq_2 a1, Eq_2 a5, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s8Out)
{
	if (a1 - a5 <= 0x00)
	{
		a0Out = 4261411616;
		a1Out = a1;
		a2Out = a2;
		a5Out = a5;
		s2Out = s2;
		s8Out = s8;
		return s1;
	}
	else
	{
		Eq_2 a5_38;
		ptr32 s2_23 = (word32) *a5;
		Eq_2 a1_25;
		struct Eq_352631 * a4_28;
		struct Eq_352632 * a5_29;
		word32 a3_100;
		ptr32 a0_24;
		ptr32 a2_26;
		Eq_2 s1_31 = mbedtls_asn1_get_bitstring_null(a1, fp + ~0x13, a5, out a0_24, out a1_25, out a2_26, out a3_100, out a4_28, out a5_29);
		if (a0_24 != 0x00)
		{
			a5_38.u0 = ~0x0200047F;
			a0_24 += ~0x0200047F;
		}
		else
		{
			*s1_31 = s2_23;
			a4_28->t0004 = s1_31;
			word32 s0_36 = a5_29->dw0000;
			a5_29->t0008 = s1_31;
			a5_38 = a5_29 + a4_28;
			*a5_38 = s0_36;
			a2_26 = dwArgA4;
		}
		a0Out = a0_24;
		a1Out = a1_25;
		a2Out = a2_26;
		a5Out = a5_38;
		s2Out = s2_23;
		s8Out = dwLoc1C;
		return s1_31;
	}
}

// 2306C296: Register word32 mbedtls_x509_get_sig_alg(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_x509_crt_parse_der
word32 mbedtls_x509_get_sig_alg(Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a5, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a5Out)
{
	if (a5 != 0x00)
	{
		a0Out = ~0x020007FF;
		a1Out = a1;
		a5Out = a5;
		return s1;
	}
	else
	{
		ptr32 a1_21;
		ptr32 a0_20;
		Eq_2 a5_25;
		word32 s1_26 = mbedtls_oid_get_sig_alg(a0, a2, a3, a5, out a0_20, out a1_21, out a5_25);
		if (a0_20 != 0x00)
		{
			a5_25.u0 = ~0x020005FF;
			a0_20 += ~0x020005FF;
		}
		else if (a5_25 != 0x05 && a5_25 != 0x00 || a5_25 != 0x00)
			a0_20 = ~0x020002FF;
		a0Out = a0_20;
		a1Out = a1_21;
		a5Out = a5_25;
		return s1_26;
	}
}

// 2306C2DA: Register Eq_2 mbedtls_x509_get_ext(Register Eq_2 a1, Register Eq_2 a2, Register ui32 a3, Register Eq_2 a5, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_x509_get_ext(Eq_2 a1, Eq_2 a2, ui32 a3, Eq_2 a5, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a5Out)
{
	if (a5 != a1)
	{
		Eq_2 a5_14 = (word32) *a5;
		*a5_14 = a2;
		Eq_2 s1_16 = a2;
		word32 a2_100;
		word32 a3_101;
		word32 a4_102;
		Eq_2 a1_24;
		Eq_2 a5_28;
		Eq_2 a0_22 = mbedtls_asn1_get_tag(a1, (word32) a2 + 4, a3 | 0x00A0, a5_14, out a1_24, out a2_100, out a3_101, out a4_102, out a5_28);
		if (a0_22 == 0x00)
		{
			*((word32) a5_28 + 8) = a2;
			s1_16 = Mem32[a2 + 4:word32] + a5_28;
			word32 a4_42;
			word32 a5_43;
			word32 a2_103;
			word32 a3_104;
			Eq_2 a0_37 = mbedtls_asn1_get_tag(s1_16, fp + ~0x13, 48, a5_28, out a1_24, out a2_103, out a3_104, out a4_42, out a5_43);
			if (a0_37 != 0x00)
			{
				a5_28.u0 = ~0x020004FF;
				a0_22 = (word32) a0_37 - 0x02000500;
			}
			else
			{
				a0_22.u0 = 0x00;
				a5_28 = a5_43 + a4_42;
				if (s1_16 != a5_28)
					a0_22.u0 = ~0x02000565;
			}
		}
		a0Out = a0_22;
		a1Out = a1_24;
		a5Out = a5_28;
		return s1_16;
	}
	else
	{
		a0Out.u0 = 0x00;
		a1Out = a1;
		a5Out = a5;
		return s1;
	}
}

// 2306C340: Register Eq_2 mbedtls_x509_dn_gets(Register Eq_2 ra, Register Eq_2 a0, Register Eq_7997 a1, Register Eq_2 a2, Register out ptr32 s10Out)
// Called from:
//      mbedtls_x509_crt_info
Eq_2 mbedtls_x509_dn_gets(Eq_2 ra, Eq_2 a0, Eq_7997 a1, Eq_2 a2, ptr32 & s10Out)
{
	Eq_7997 s3_11 = a1;
	Eq_2 s6_13 = a2;
	Eq_2 s1_15 = a0;
	word32 t1_613;
	word32 a1_615;
	word32 a3_616;
	word32 a0_614;
	word32 a4_617;
	word32 a5_618;
	Eq_2 a2_106;
	Eq_2 ra_124 = memset(ra, fp->aFFFFFED0, 0x00, 0x0100, out t1_613, out a0_614, out a1_615, out a2_106, out a3_616, out a4_617, out a5_618);
	Eq_2 s2_103 = a2;
	Eq_7997 s0_121 = a1;
	Eq_2 a5_105 = 0x00;
	word32 s8_118 = 0x2308E000;
	word32 s9_149 = 0x2308E000;
	struct Eq_274 * s4_252 = &g_t2308DA4C;
	struct Eq_274 * s5_253 = &g_t23080648;
	while (true)
	{
		Eq_2 a0_265;
		if (s2_103 == 0x00)
			break;
		if (*((word32) s2_103 + 8) != 0x00)
		{
			if (s2_103 != s6_13)
			{
				struct Eq_274 * a2_60 = s4_252;
				if (a5_105 == 0x00)
					a2_60 = s5_253;
				Eq_352833 a0_76;
				Eq_352833 s0_84;
				word32 a3_621;
				word32 a4_622;
				word32 a7_623;
				word32 s5_626;
				word32 s3_624;
				word32 s4_625;
				word32 s1_619;
				word32 s6_627;
				word32 s7_628;
				word32 a1_620;
				word32 s11_629;
				ra_124 = snprintf(ra_124, s1_15, s0_121, a2_60, dwLoc0128, dwLoc0108, dwLocDC, dwLocC0, 0x00, dwLoc98, dwLoc74, out s0_84, out s1_619, out a0_76, out a1_620, out a2_106, out a3_621, out a4_622, out a5_105, out a7_623, out s2_103, out s3_624, out s4_625, out s5_626, out s6_627, out s7_628, out s8_118, out s9_149, out s10, out s11_629);
				if (a0_76 < 0x00 || a0_76 >= s0_84)
					goto l2306C3D0;
				s0_121 = s0_84 - a0_76;
			}
			struct Eq_352813 * s2_137;
			Eq_2 ra_132;
			word32 s7_142;
			word32 s1_134;
			Eq_352817 s0_133;
			Eq_352817 a0_125;
			word32 a0_109;
			Eq_2 s1_115 = mbedtls_oid_get_attr_short_name(s2_103, (char *) fp - 308, a2_106, a5_105, dwLoc0108, out a0_109);
			if (a0_109 == 0x00)
			{
				word32 s9_654;
				word32 s11_655;
				word32 a1_643;
				word32 a3_645;
				word32 a4_646;
				word32 a5_647;
				word32 a7_648;
				word32 s5_651;
				word32 s6_652;
				word32 s8_653;
				word32 s3_649;
				word32 s4_650;
				word32 a2_644;
				ra_132 = snprintf(ra_124, s1_115, s0_121, s9_149 + -0x05B0, dwLoc0128, dwLoc0108, dwLocDC, dwLocC0, 0x00, dwLoc98, dwLoc74, out s0_133, out s1_134, out a0_125, out a1_643, out a2_644, out a3_645, out a4_646, out a5_647, out a7_648, out s2_137, out s3_649, out s4_650, out s5_651, out s6_652, out s7_142, out s8_653, out s9_654, out s10, out s11_655);
			}
			else
			{
				word32 a5_634;
				word32 a7_635;
				word32 s3_636;
				word32 s4_637;
				word32 s8_640;
				word32 s9_641;
				word32 s11_642;
				word32 s5_638;
				word32 s6_639;
				word32 a4_633;
				word32 a3_632;
				word32 a1_630;
				word32 a2_631;
				ra_132 = snprintf(ra_124, s1_115, s0_121, s8_118 + -0x05AC, dwLoc0128, dwLoc0108, dwLocDC, dwLocC0, 0x00, dwLoc98, dwLoc74, out s0_133, out s1_134, out a0_125, out a1_630, out a2_631, out a3_632, out a4_633, out a5_634, out a7_635, out s2_137, out s3_636, out s4_637, out s5_638, out s6_639, out s7_142, out s8_640, out s9_641, out s10, out s11_642);
			}
			if (a0_125 < 0x00 || a0_125 >= s0_133)
			{
l2306C3D0:
				a0_265.u0 = 0xFD000680;
				goto l2306C3D6;
			}
			Eq_7997 s0_179 = s0_133 - a0_125;
			Eq_2 s1_181 = (word32) a0_125 + s1_134;
			Eq_352955 a5_182 = 0x00;
			while (a5_182 < s2_137->t0010 && a5_182 != 0x00FF)
			{
				word32 a4_194 = CONVERT(Mem188[Mem188[s2_137 + 20:int32] + a5_182:byte], byte, word32);
				if (a4_194 <= 0x1F || (a4_194 == 0x007F || ((word32) a4_194.u0 + 0x007F & 0x00FF) <= 0x1E))
					a4_194.u0 = 63;
				Mem209[fp + -304 + a5_182:byte] = SLICE(a4_194, byte, 0);
				a5_182 = (word32) a5_182 + 1;
			}
			Mem232[a5_182 + (fp + -48) + 0x0F00:byte] = 0x00;
			Eq_352966 a0_238;
			Eq_352966 s0_246;
			word32 s1_247;
			word32 a1_656;
			word32 a3_657;
			word32 a4_658;
			word32 a5_659;
			word32 s11_662;
			word32 a7_660;
			word32 s7_661;
			ra_124 = snprintf(ra_132, s1_181, s0_179, s7_142 + -808, dwLoc0128, dwLoc0108, dwLocDC, dwLocC0, 0x00, dwLoc98, dwLoc74, out s0_246, out s1_247, out a0_238, out a1_656, out a2_106, out a3_657, out a4_658, out a5_659, out a7_660, out s2_103, out s3_11, out s4_252, out s5_253, out s6_13, out s7_661, out s8_118, out s9_149, out s10, out s11_662);
			if (a0_238 < 0x00 || a0_238 >= s0_246)
				goto l2306C3D0;
			s0_121 = s0_246 - a0_238;
			s1_15 = (word32) a0_238 + s1_247;
			a5_105 = (word32) *((word32) s2_103 + 28);
		}
		s2_103 = *((word32) s2_103 + 24);
	}
	a0_265 = s3_11 - s0_121;
l2306C3D6:
	s10Out = s10;
	return a0_265;
}

