pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 2306C4B0: Register Eq_2 mbedtls_x509_serial_gets(Register Eq_2 ra, Register Eq_2 a0, Register Eq_7997 a1, Register (ptr32 Eq_310828) a2, Register Eq_2 s7, Register Eq_2 s9, Stack Eq_2 dwArg08, Stack word32 dwArg1C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_7997 s1Out, Register out ptr32 a0Out, Register out Eq_310840 s2Out, Register out Eq_310840 s3Out, Register out Eq_2 s4Out, Register out ptr32 s7Out, Register out Eq_310840 s10Out)
// Called from:
//      mbedtls_x509_crt_info
Eq_2 mbedtls_x509_serial_gets(Eq_2 ra, Eq_2 a0, Eq_7997 a1, struct Eq_310828 * a2, Eq_2 s7, Eq_2 s9, Eq_2 dwArg08, word32 dwArg1C, Eq_2 dwArg34, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_7997 & s1Out, ptr32 & a0Out, union Eq_310840 & s2Out, union Eq_310840 & s3Out, union Eq_2 & s4Out, ptr32 & s7Out, union Eq_310840 & s10Out)
{
	Eq_310840 s3_100 = a2->t0004;
	Eq_2 s4_111 = a0;
	Eq_7997 s1_128 = a1;
	struct Eq_310828 * s5_102 = a2;
	if (s3_100 > 32)
		s3_100.u0 = 0x1C;
	Eq_7997 s0_110 = a1;
	Eq_310840 s2_112 = 0x00;
	Eq_310840 s8_105 = (word32) s3_100 - 1;
	word32 s9_106 = 0x2308E000;
	ptr32 s7_104 = 0x23088E60;
	Eq_310840 s10_129 = 0x01;
	while (true)
	{
		ptr32 a0_143;
		if (s2_112 == s3_100)
			break;
		byte * a5_52 = s5_102->ptr0008;
		if (s2_112 != 0x00 || (s3_100 == s10_129 || (word32) (*a5_52) != 0x00))
		{
			Eq_353128 a0_87;
			Eq_353128 s0_95;
			word32 s4_101;
			word32 a7_439;
			word32 s11_441;
			word32 s6_440;
			word32 a1_434;
			word32 a5_438;
			word32 a2_435;
			word32 a3_436;
			word32 a4_437;
			ra = snprintf(ra, s4_111, s0_110, s9_106 + -0x059C, dwLoc18, dwArg08, dwArg34, s9, s7, dwArg78, dwArg9C, out s0_95, out s1_128, out a0_87, out a1_434, out a2_435, out a3_436, out a4_437, out a5_438, out a7_439, out s2_112, out s3_100, out s4_101, out s5_102, out s6_440, out s7_104, out s8_105, out s9_106, out s10_129, out s11_441);
			if (a0_87 < 0x00 || a0_87 >= s0_95)
				goto l2306C558;
			s0_110 = s0_95 - a0_87;
			s4_111 = (word32) a0_87 + s4_101;
		}
		s2_112 = (word32) s2_112 + 1;
	}
	if (s5_102->t0004 != s2_112)
	{
		Eq_353076 a0_119;
		Eq_353076 s0_127;
		word32 s8_431;
		word32 s11_433;
		word32 s9_432;
		word32 a2_423;
		word32 a4_425;
		word32 a5_426;
		word32 s6_430;
		word32 a7_427;
		word32 s4_428;
		word32 s5_429;
		word32 a3_424;
		word32 a1_422;
		ra = snprintf(ra, s4_111, s0_110, &g_t2308DA6C, dwLoc18, dwArg08, dwArg34, s9, s7, dwArg78, dwArg9C, out s0_127, out s1_128, out a0_119, out a1_422, out a2_423, out a3_424, out a4_425, out a5_426, out a7_427, out s2_112, out s3_100, out s4_428, out s5_429, out s6_430, out s7_104, out s8_431, out s9_432, out s10_129, out s11_433);
		if (a0_119 < 0x00 || a0_119 >= s0_127)
		{
l2306C558:
			a0_143 = 0xFD000680;
l2306C55E:
			0x00 = (uint16) dwArg0128;
			0x00 = dwArg1C;
			s0Out = s4;
			s1Out = s1_128;
			a0Out = a0_143;
			s2Out = s2_112;
			s3Out = s3_100;
			s4Out = dwArg78;
			s7Out = s7_104;
			s10Out = s10_129;
			return ra;
		}
		s0_110 = s0_127 - a0_119;
	}
	a0_143 = s1_128 - s0_110;
	goto l2306C55E;
}

// 2306C586: Register Eq_2 mbedtls_x509_sig_alg_gets(Register Eq_2 ra, Register Eq_7997 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_311120 s0Out, Register out Eq_311120 a0Out, Register out ptr32 a5Out, Register out (ptr32 Eq_311123) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 s10Out)
// Called from:
//      mbedtls_x509_crt_info
Eq_2 mbedtls_x509_sig_alg_gets(Eq_2 ra, Eq_7997 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_311120 & s0Out, union Eq_311120 & a0Out, ptr32 & a5Out, struct Eq_311123 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & s10Out)
{
	ptr32 s7_165;
	ptr32 s3_156;
	struct Eq_311123 * s2_153;
	ptr32 s10_147;
	Eq_2 ra_139;
	ptr32 a5_133;
	Eq_311120 a0_119;
	Eq_311120 s0_40;
	word32 a0_19;
	Eq_2 s1_25 = mbedtls_oid_get_sig_alg_desc(a2, fp + ~0x13, a2, a5, out a0_19);
	if (a0_19 != 0x00)
	{
		word32 s11_210;
		word32 s8_208;
		word32 s9_209;
		word32 s5_206;
		word32 s6_207;
		word32 a7_204;
		word32 s4_205;
		word32 a3_202;
		word32 a4_203;
		word32 a1_200;
		word32 a2_201;
		word32 s1_199;
		ra_139 = snprintf(ra, s1_25, a1, &g_t2307F0C4, dwLoc08, dwArg18, dwArg44, dwArg60, 0x00, dwArg88, dwArgAC, out s0_40, out s1_199, out a0_119, out a1_200, out a2_201, out a3_202, out a4_203, out a5_133, out a7_204, out s2_153, out s3_156, out s4_205, out s5_206, out s6_207, out s7_165, out s8_208, out s9_209, out s10_147, out s11_210);
	}
	else
	{
		word32 s11_198;
		word32 s8_196;
		word32 s9_197;
		word32 s5_194;
		word32 s6_195;
		word32 a7_192;
		word32 s4_193;
		word32 a3_190;
		word32 a4_191;
		word32 a1_188;
		word32 a2_189;
		word32 s1_187;
		ra_139 = snprintf(ra, s1_25, a1, &g_t23085CD8, dwLoc08, dwArg18, dwArg44, dwArg60, 0x00, dwArg88, dwArgAC, out s0_40, out s1_187, out a0_119, out a1_188, out a2_189, out a3_190, out a4_191, out a5_133, out a7_192, out s2_153, out s3_156, out s4_193, out s5_194, out s6_195, out s7_165, out s8_196, out s9_197, out s10_147, out s11_198);
	}
	if (a0_119 < 0x00 || a0_119 >= s0_40)
		a0_119.u0 = 0xFD000680;
	s0Out = s0_40;
	a0Out = a0_119;
	a5Out = a5_133;
	s2Out = s2_153;
	s3Out = s3_156;
	s4Out = dwArg04;
	s7Out = s7_165;
	s10Out = s10_147;
	return ra_139;
}

// 2306C5DA: Register Eq_2 mbedtls_x509_key_size_helper(Register Eq_2 ra, Register Eq_2 a0, Register Eq_7997 a1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out (ptr32 Eq_311172) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out)
// Called from:
//      mbedtls_x509_crt_info
Eq_2 mbedtls_x509_key_size_helper(Eq_2 ra, Eq_2 a0, Eq_7997 a1, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a5Out, struct Eq_311172 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out)
{
	ptr32 a0_39;
	Eq_353267 a0_15;
	ptr32 a5_20;
	Eq_353267 s0_23;
	ptr32 s1_24;
	ptr32 s10_25;
	struct Eq_311172 * s2_27;
	ptr32 s3_28;
	ptr32 s4_29;
	ptr32 s5_30;
	ptr32 s6_31;
	ptr32 s7_32;
	word32 s9_118;
	word32 s11_119;
	word32 a7_116;
	word32 s8_117;
	word32 a3_114;
	word32 a4_115;
	word32 a1_112;
	word32 a2_113;
	Eq_2 ra_22 = snprintf(ra, a0, a1, &g_t2308DA58, dwArg08, dwArg28, dwArg54, dwArg70, ra, dwArg98, dwArgBC, out s0_23, out s1_24, out a0_15, out a1_112, out a2_113, out a3_114, out a4_115, out a5_20, out a7_116, out s2_27, out s3_28, out s4_29, out s5_30, out s6_31, out s7_32, out s8_117, out s9_118, out s10_25, out s11_119);
	if (a0_15 >= 0x00 && a0_15 < s0_23)
		a0_39 = 0x00;
	else
		a0_39 = 0xFD000680;
	s1Out = s1_24;
	a0Out = a0_39;
	a5Out = a5_20;
	s2Out = s2_27;
	s3Out = s3_28;
	s4Out = s4_29;
	s5Out = s5_30;
	s6Out = s6_31;
	s7Out = s7_32;
	s10Out = s10_25;
	return ra_22;
}

// 2306C60A: Register word32 mbedtls_x509_time_is_past()
// Called from:
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
word32 mbedtls_x509_time_is_past()
{
	return 0x00;
}

