pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 2306C60E: Register word32 mbedtls_x509_time_is_future()
// Called from:
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
word32 mbedtls_x509_time_is_future()
{
	return 0x00;
}

// 2306C612: Register int32 mbedtls_base64_decode(Register (ptr32 Eq_341548) a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register Eq_2 a3, Register Eq_2 a4, Register out Eq_341553 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_341558) a5Out, Register out (ptr32 byte) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      mbedtls_pem_read_buffer
int32 mbedtls_base64_decode(struct Eq_341548 * a0, Eq_2 a1, union Eq_2 * a2, Eq_2 a3, Eq_2 a4, union Eq_341553 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_341558 & a5Out, byte & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	struct Eq_341558 * a5_17 = null;
	uint32 a6_18 = 0x00;
	Eq_2 a7_105 = 0x00;
l2306C646:
	Eq_341553 a0_148;
	if (a7_105 >= a4)
		a4 = a7_105;
	else
	{
		word32 t4_31 = 0x00;
		do
		{
			word32 t6_34 = a3 + a7_105;
			struct Eq_353339 * t1_36 = (word32) t6_34->b0000;
			if (t1_36 != (struct Eq_353339 *) 32)
			{
				if (a4 == a7_105)
					break;
				s5 = a4 - a7_105;
				if (s5 > 0x01 && t1_36 == (struct Eq_353339 *) 0x0D)
				{
					if ((word32) t6_34->b0001 == 0x0A)
						goto l2306C688;
					goto l2306C690;
				}
				if (t1_36 != (struct Eq_353339 *) 0x0A)
				{
l2306C690:
					if (t4_31 != 0x00)
					{
l2306C69E:
						a0_148.u0 = -44;
						goto l2306C71A;
					}
					if (t1_36 == (struct Eq_353339 *) 61)
					{
						++a5_17;
						if (a5_17 > (struct Eq_341558 *) 0x02)
							goto l2306C69E;
						goto l2306C6B0;
					}
					if ((int32) (byte) t1_36 < 0x00)
						goto l2306C69E;
l2306C6B0:
					Eq_353422 t1_80 = (word32) t1_36->b2308DA74;
					if (t1_80 == 0x007F || t1_80 <= 63 && a5_17 != null)
						goto l2306C69E;
					++a6_18;
				}
l2306C688:
				a7_105 = (word32) a7_105 + 1;
				goto l2306C646;
			}
			a7_105 = (word32) a7_105 + 1;
			++t4_31;
		} while (a4 != a7_105);
	}
	if (a6_18 == 0x00)
		*a2 = (union Eq_2 *) 0x00;
	else
	{
		Eq_2 a6_117 = (a6_18 >> 0x03) + 0x06 - a5_17 + ((a6_18 & 7) + 0x0D >> 0x03);
		if (a0 == null || a1 < a6_117)
		{
			*a2 = (union Eq_2 *) a6_117;
			a0_148.u0 = -42;
			goto l2306C71A;
		}
		a4 += a3;
		struct Eq_341548 * a5_161 = a0;
		uint32 a6_162 = 0x00;
		word32 a7_163 = 0x03;
		word32 t1_164 = 0x00;
		while (a4 != a3)
		{
			struct Eq_353394 * t3_174 = (word32) *a3;
			uint32 a1_176 = (char *) t3_174 - 0x0A & 0x00FF;
			if (a1_176 <= 22)
			{
				uint32 a1_179 = 0x00400009 >> a1_176;
				a1 = a1_179 & 0x01;
				if ((a1_179 & 0x01) == 0x00)
					goto l2306C742;
			}
			else
			{
l2306C742:
				Eq_353435 a1_186 = (word32) t3_174->b2308DA74;
				++t1_164;
				a1 = a1_186 & 63;
				a7_163 -= (word32) (a1_186 < -65);
				a6_162 = a1_186 & 63 | a6_162 << 6;
				if (t1_164 == 0x04)
				{
					t1_164 = 0x00;
					if (a7_163 != 0x00)
					{
						a5_161->b0000 = (byte) (a6_162 >> 0x10);
						a1 = a6_162 >> 0x10;
						if (a7_163 == 0x01)
							a5_161 = (struct Eq_341548 *) &a5_161->b0001;
						else
						{
							a5_161->b0001 = (byte) (a6_162 >> 0x08);
							a1 = a6_162 >> 0x08;
							if (a7_163 == 0x02)
								a5_161 = (struct Eq_341548 *) &a5_161->b0002;
							else
							{
								a5_161->b0002 = (byte) a6_162;
								++a5_161;
							}
						}
					}
				}
			}
			a3 = (word32) a3 + 1;
		}
		a5_17 = a5_161 - a0;
		a5_17->dw0000 = a2;
	}
	a0_148.u0 = 0x00;
l2306C71A:
	a0Out = a0_148;
	a1Out = a1;
	a2Out = s2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_17;
	s2Out = (byte *) 63;
	s3Out = 0x02;
	s4Out = dwArg28;
	s5Out = s5;
	return 0x007F;
}

// 2306C794: void modf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_64250 a1, Register Eq_2 a2, Register ptr32 fflags, Register ptr32 frm)
// Called from:
//      ecvtbuf
void modf(Eq_2 ra, Eq_2 a0, Eq_64250 a1, Eq_2 a2, ptr32 fflags, ptr32 frm)
{
	Eq_2 a6_22;
	Eq_2 t1_21;
	int32 a4_6 = a1 >> 0x14 & 0x07FF;
	Eq_64250 a5_11 = a1;
	if (a4_6 <= -0x0412)
	{
		if (a4_6 < ~0x03FE)
		{
			a2->u0 = 0;
			*((word32) a2 + 4) = a1 & 0x80000000;
			return;
		}
		int32 a6_35 = 0x000FFFFF >> a4_6 + -0x03FF;
		if ((a6_35 & a1 | a0) == 0x00)
			goto l2306C7D4;
		a5_11 = ~a6_35 & a1;
		t1_21.u0 = 0;
		a6_22.u0 = 0;
	}
	else
	{
		if (a4_6 > -0x0432)
			goto l2306C7D4;
		uint32 a4_17 = -1 >> a4_6 + -0x0413;
		if ((a4_17 & a0) == 0x00)
		{
l2306C7D4:
			*((word32) a2 + 4) = a1;
			*a2 = a0;
			return;
		}
		Eq_2 a3_20 = ~a4_17 & a0;
		t1_21 = a3_20;
		a6_22 = a3_20;
	}
	*a2 = t1_21;
	*((word32) a2 + 4) = a5_11;
	__subdf3(ra, a0, a1, a6_22, a5_11, fflags, frm);
}

// 2306C888: Register Eq_277006 __lshrdi3(Register Eq_277006 a0, Register uint32 a1, Register int32 a2)
// Called from:
//      EF_Ctrl_Read_PowerOffset_Opt
Eq_277006 __lshrdi3(Eq_277006 a0, uint32 a1, int32 a2)
{
	if (a2 != 0x00)
	{
		int32 a5_5 = 32 - a2;
		if (a5_5 <= 0x00)
			a0 = a1 >> a2 + -32;
		else
			a0 = a0 >> a2 | a1 << a5_5;
	}
	return a0;
}

// 2306C8C0: Register Eq_2 __clzsi2(Register Eq_2 a0, Register out Eq_20866 a4Out)
// Called from:
//      txl_payload_handle
//      txl_transmit_trigger
//      rc_get_initial_rate_config
//      ke_evt_schedule
//      rxu_mgt_ind_handler
//      apm_start_req_handler
//      vTaskSwitchContext
//      bloop_run
//      __adddf3
//      __divdf3
//      __muldf3
//      __subdf3
//      __floatsidf
//      __floatunsidf
//      __extendsfdf2
Eq_2 __clzsi2(Eq_2 a0, union Eq_20866 & a4Out)
{
	int32 a5_10;
	if (a0 < 0x00010000)
		a5_10 = (word32) (a0 > 0x00FF) << 0x03;
	else
	{
		a5_10 = 16;
		if (a0 >= 0x01000000)
			a5_10 = 24;
	}
	Eq_20866 a4_13 = 32 - a5_10;
	word32 a0_22 = a4_13 - CONVERT(Mem0[0x2308DB6C<p32> + (a0 >>u a5_10):byte], byte, word32);
	a4Out = a4_13;
	return a0_22;
}

// 2306C90C: Register word32 __floatundisf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 fflags, Register ptr32 frm, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 fa0Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      iperf_server_udp_recv_fn
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
word32 __floatundisf(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 fflags, ptr32 frm, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & fa0Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	Eq_64250 a1_19;
	Eq_64619 a0_34;
	Eq_64620 a1_35;
	ptr32 fflags_49;
	ptr32 frm_50;
	Eq_2 s0_52;
	word32 s1_53;
	ptr32 s2_54;
	ptr32 s4_56;
	ptr32 s5_57;
	ptr32 s6_58;
	ptr32 s7_59;
	ptr32 s9_61;
	word32 a4_113;
	word32 a5_114;
	word32 a7_115;
	word32 s3_116;
	word32 s8_117;
	Eq_2 ra_51 = __muldf3(ra, __floatunsidf(a1, out a1_19), a1_19, g_t4200D9B8, g_t4200D9BC, fflags, frm, out s0_52, out s1_53, out a0_34, out a1_35, out a4_113, out a5_114, out a7_115, out s2_54, out s3_116, out s4_56, out s5_57, out s6_58, out s7_59, out s8_117, out s9_61, out fflags_49, out frm_50);
	uint32 a1_66;
	uint32 a1_74;
	Eq_2 a0_73 = __adddf3(ra_51, __floatunsidf(s0_52, out a1_66), a1_66, a0_34, a1_35, fflags_49, frm_50, out a1_74);
	ptr32 a3_84;
	ptr32 a5_86;
	ptr32 fa0_89;
	word32 a2_118;
	word32 a4_119;
	ptr32 a1_82 = __truncdfsf2(ra_51, a0_73, a1_74, fflags_49, frm_50, out a2_118, out a3_84, out a4_119, out a5_86, out fa0_89);
	a0Out = a0_73;
	a1Out = a1_82;
	a3Out = a3_84;
	a5Out = a5_86;
	s2Out = s2_54;
	s4Out = s4_56;
	s5Out = s5_57;
	s6Out = s6_58;
	s7Out = s7_59;
	s9Out = s9_61;
	fa0Out = fa0_89;
	fflagsOut = fflags_49;
	frmOut = frm_50;
	return s1_53;
}

