pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 2306C988: Register Eq_138732 __divdi3(Register Eq_138732 a0, Register Eq_138732 a1, Register Eq_138732 a2, Register Eq_138732 a3, Register out Eq_138796 a1Out)
// Called from:
//      uptime_cmd
Eq_138732 __divdi3(Eq_138732 a0, Eq_138732 a1, Eq_138732 a2, Eq_138732 a3, union Eq_138796 & a1Out)
{
	int32 a7_10 = 0;
	if (a1 < 0x00)
	{
		a0 = 0x00 - a0;
		a1 = 0x00 - a1 - (word32) (a0 != 0x00);
		a7_10 = -1;
	}
	if (a3 < 0x00)
	{
		a2 = 0x00 - a2;
		a7_10 = ~a7_10;
		a3 = 0x00 - a3 - (word32) (a2 != 0x00);
	}
	Eq_138796 t3_141;
	Eq_138732 a5_106;
	Eq_138732 a6_151 = a2;
	Eq_138732 a4_155 = a3;
	Eq_138732 t1_178 = a0;
	Eq_138732 t3_292 = a1;
	if (a3 != 0x00)
	{
		if (a1 < a3)
		{
			t3_141.u0 = 0;
			a5_106.u0 = 0;
			goto l2306CB90;
		}
		int32 a4_35;
		if (a3 < 0x00010000)
			a4_35 = (word32) (a3 > 0x00FF) << 0x03;
		else
		{
			a4_35 = 16;
			if (a3 >= 0x01000000)
				a4_35 = 24;
		}
		word32 a6_52 = CONVERT(Mem0[0x2308DB6C<p32> + (a3 >>u a4_35):byte], byte, word32) + a4_35;
		t3_141 = 32 - a6_52;
		if (t3_141 == 0x00)
		{
			a5_106.u0 = 1;
			if (a3 >= a1)
				a5_106 = (word32) (a0 < a2) ^ 1;
			goto l2306CB90;
		}
		uint32 a3_57 = a2 >> a6_52 | a3 << t3_141;
		uint32 a5_60 = a1 >> a6_52;
		uint32 a1_64 = a0 >> a6_52 | a1 << t3_141;
		word32 t5_67 = (word32) (word16) a3_57;
		uint32 a5_70 = a5_60 >> (a3_57 >> 0x10);
		uint32 a2_69 = a2 << t3_141;
		uint32 a4_72 = (a5_60 & a3_57 >> 0x10) << 0x10 | a1_64 >> 0x10;
		uint32 t1_73 = t5_67 + a5_70;
		uint32 t4_74 = a5_70;
		if (a4_72 < t1_73)
		{
			a4_72 += a3_57;
			t4_74 = a5_70 + -1;
			if (a4_72 >= a3_57 && a4_72 < t1_73)
			{
				t4_74 = a5_70 + -2;
				a4_72 += a3_57;
			}
		}
		uint32 a4_81 = a4_72 - t1_73;
		uint32 a4_87 = a4_81 >> (a3_57 >> 0x10);
		uint32 a6_101 = (a4_81 & a3_57 >> 0x10) << 0x10 | (word32) ((word16) a1_64);
		uint32 t5_91 = t5_67 + a4_87;
		uint32 a5_105 = a4_87;
		if (a6_101 < t5_91)
		{
			a6_101 += a3_57;
			a5_105 = a4_87 + -1;
			if (a6_101 >= a3_57 && a6_101 < t5_91)
			{
				a5_105 = a4_87 + -2;
				a6_101 += a3_57;
			}
		}
		a5_106 = t4_74 << 0x10 | a5_105;
		uint32 a3_115 = (a5_106 >> 0x10) + (a2_69 & 0xFFFF);
		uint32 t4_114 = (a5_106 & 0xFFFF) + (a2_69 & 0xFFFF);
		uint32 a6_103 = a6_101 - t5_91;
		uint32 a4_119 = (t4_114 >> 0x10) + (((a5_106 & 0xFFFF) + (a2_69 >> 0x10)) + a3_115);
		uint32 a1_120 = (a5_106 >> 0x10) + (a2_69 >> 0x10);
		if (a4_119 < a3_115)
			a1_120 += 0x00010000;
		uint32 a1_125 = (a4_119 >> 0x10) + a1_120;
		if (a6_103 >= a1_125)
		{
			if (a6_103 != a1_125)
				goto l2306CAA8;
			t3_141.u0 = 0;
			if (a0 << t3_141 >= ((a4_119 & 0xFFFF) << 0x10) + (t4_114 & 0xFFFF))
				goto l2306CB90;
		}
		a5_106 = (word32) a5_106.u0 - 1;
		goto l2306CAA8;
	}
	else
	{
		if (a1 < a2)
		{
			int32 a5_272;
			if (a2 < 0x00010000)
				a5_272 = (word32) (a2 > 0x00FF) << 0x03;
			else
			{
				a5_272 = 16;
				if (a2 >= 0x01000000)
					a5_272 = 24;
			}
			word32 a5_284 = CONVERT(Mem0[0x2308DB6C<p32> + (a2 >>u a5_272):byte], byte, word32) + a5_272;
			int32 a4_286 = 32 - a5_284;
			if (a4_286 != 0x00)
			{
				a6_151 = a2 << a4_286;
				t3_292 = a0 >> a5_284 | a1 << a4_286;
				t1_178 = a0 << a4_286;
			}
			uint32 a2_296 = a6_151 >> 0x10;
			uint32 a1_300 = a6_151 << 0x10;
			uint32 t3_305 = t3_292 >> a2_296;
			Eq_138732 a4_307 = (t3_292 & a2_296) << 0x10 | t1_178 >> 0x10;
			Eq_138732 a3_308 = (a1_300 >> 0x10) + t3_305;
			uint32 a5_309 = t3_305;
			if (a4_307 < a3_308)
			{
				a4_307 += a6_151;
				a5_309 = t3_305 + -1;
				if (a4_307 >= a6_151 && a4_307 < a3_308)
				{
					a5_309 = t3_305 + -2;
					a4_307 += a6_151;
				}
			}
			uint32 a4_316 = a4_307 - a3_308;
			uint32 a4_322 = a4_316 >> a2_296;
			Eq_138732 t1_324 = (a4_316 & a2_296) << 0x10 | (word32) ((word16) t1_178);
			Eq_138732 a1_326 = (a1_300 >> 0x10) + a4_322;
			uint32 a0_327 = a4_322;
			if (t1_324 < a1_326)
			{
				word32 t1_329 = a6_151 + t1_324;
				a0_327 = a4_322 + -1;
				if (t1_329 >= a6_151 && t1_329 < a1_326)
					a0_327 = a4_322 + -2;
			}
			a5_106 = a5_309 << 0x10 | a0_327;
l2306CAA8:
			t3_141.u0 = 0;
			goto l2306CB90;
		}
		if (a2 == 0x00)
			a6_151 = 1 >> a3;
		if (a6_151 < 0x00010000)
		{
			if (a6_151 > 0x00FF)
				a4_155.u0 = 8;
		}
		else
		{
			a4_155.u0 = 16;
			if (a6_151 >= 0x01000000)
				a4_155.u0 = 24;
		}
		Eq_353855 a1_220;
		word32 a5_170 = CONVERT(Mem0[0x2308DB6C<p32> + (a6_151 >>u a4_155):byte], byte, word32) + a4_155;
		int32 a3_171 = 32 - a5_170;
		if (a3_171 == 0x00)
		{
			a1_220 = a1 - a6_151;
			t3_141.u0 = 1;
		}
		else
		{
			a6_151 <<= a3_171;
			uint32 a4_175 = a1 >> a5_170;
			uint32 a2_182 = a0 >> a5_170 | a1 << a3_171;
			word32 a1_185 = (word32) (word16) a6_151;
			uint32 a4_187 = a4_175 >> (a6_151 >> 0x10);
			t1_178 = a0 << a3_171;
			Eq_138732 a5_189 = (a4_175 & a6_151 >> 0x10) << 0x10 | a2_182 >> 0x10;
			Eq_138732 a3_190 = a1_185 + a4_187;
			uint32 t3_191 = a4_187;
			if (a5_189 < a3_190)
			{
				a5_189 += a6_151;
				t3_191 = a4_187 + -1;
				if (a5_189 >= a6_151 && a5_189 < a3_190)
				{
					t3_191 = a4_187 + -2;
					a5_189 += a6_151;
				}
			}
			uint32 a3_198 = a5_189 - a3_190;
			uint32 a3_204 = a3_198 >> (a6_151 >> 0x10);
			Eq_138732 a4_207 = a1_185 + a3_204;
			Eq_138732 a1_208 = (a3_198 & a6_151 >> 0x10) << 0x10 | (word32) ((word16) a2_182);
			uint32 a5_209 = a3_204;
			if (a1_208 < a4_207)
			{
				a1_208 += a6_151;
				a5_209 = a3_204 + -1;
				if (a1_208 >= a6_151 && a1_208 < a4_207)
				{
					a5_209 = a3_204 + -2;
					a1_208 += a6_151;
				}
			}
			a1_220 = a1_208 - a4_207;
			t3_141 = t3_191 << 0x10 | a5_209;
		}
		uint32 a0_227 = a6_151 >> 0x10;
		uint32 a2_228 = a6_151 << 0x10;
		uint32 a4_237 = a1_220 >> a0_227;
		Eq_138732 a1_239 = (a2_228 >> 0x10) + a4_237;
		Eq_138732 a3_241 = (a1_220 & a0_227) << 0x10 | t1_178 >> 0x10;
		uint32 a5_242 = a4_237;
		if (a3_241 < a1_239)
		{
			a3_241 += a6_151;
			a5_242 = a4_237 + -1;
			if (a3_241 >= a6_151 && a3_241 < a1_239)
			{
				a5_242 = a4_237 + -2;
				a3_241 += a6_151;
			}
		}
		uint32 a3_249 = a3_241 - a1_239;
		uint32 a3_255 = a3_249 >> a0_227;
		Eq_138732 t1_257 = (a3_249 & a0_227) << 0x10 | (word32) ((word16) t1_178);
		Eq_138732 a1_259 = (a2_228 >> 0x10) + a3_255;
		uint32 a0_260 = a3_255;
		if (t1_257 < a1_259)
		{
			word32 t1_262 = a6_151 + t1_257;
			a0_260 = a3_255 + -1;
			if (t1_262 >= a6_151 && t1_262 < a1_259)
				a0_260 = a3_255 + -2;
		}
		a5_106 = a5_242 << 0x10 | a0_260;
l2306CB90:
		Eq_138732 a0_340 = a5_106;
		Eq_138796 a1_345 = t3_141;
		if (a7_10 != 0x00)
		{
			a0_340 = 0x00 - a5_106;
			a1_345 = 0x00 - t3_141 - (word32) (a0_340 != 0x00);
		}
		a1Out = a1_345;
		return a0_340;
	}
}

// 2306CE08: void __moddi3(Register Eq_138783 a0, Register Eq_138783 a1, Register Eq_138783 a2, Register Eq_138783 a3)
// Called from:
//      uptime_cmd
void __moddi3(Eq_138783 a0, Eq_138783 a1, Eq_138783 a2, Eq_138783 a3)
{
	int32 a7_10 = 0;
	if (a1 < 0x00)
	{
		a0 = 0x00 - a0;
		a1 = 0x00 - a1 - (word32) (a0 != 0x00);
		a7_10 = -1;
	}
	if (a3 < 0x00)
	{
		a2 = 0x00 - a2;
		a3 = 0x00 - a3 - (word32) (a2 != 0x00);
	}
	Eq_138783 t1_187 = a2;
	Eq_138783 a4_191 = a3;
	Eq_138783 a5_214 = a0;
	Eq_138783 a6_28 = a1;
	if (a3 == 0x00)
	{
		if (a1 < a2)
		{
			if (a2 < 0x00010000)
			{
				if (a2 > 0x00FF)
					a4_191.u0 = 8;
			}
			else
			{
				a4_191.u0 = 16;
				if (a2 >= 0x01000000)
					a4_191.u0 = 24;
			}
			word32 a4_301 = CONVERT(Mem0[0x2308DB6C<p32> + (a2 >>u a4_191):byte], byte, word32) + a4_191;
			int32 t3_302 = 32 - a4_301;
			if (t3_302 != 0x00)
			{
				t1_187 = a2 << t3_302;
				a6_28 = a0 >> a4_301 | a1 << t3_302;
				a5_214 = a0 << t3_302;
			}
			uint32 a2_312 = t1_187 >> 0x10;
			uint32 a0_316 = t1_187 << 0x10;
			Eq_138783 a1_322 = (a0_316 >> 0x10) + (a6_28 >> a2_312);
			Eq_138783 a4_324 = (a6_28 & a2_312) << 0x10 | a5_214 >> 0x10;
			if (a4_324 < a1_322)
			{
				a4_324 += t1_187;
				if (a4_324 >= t1_187 && a4_324 < a1_322)
					a4_324 += t1_187;
			}
			uint32 a4_329 = a4_324 - a1_322;
			Eq_138783 a4_337 = (a0_316 >> 0x10) + (a4_329 >> a2_312);
			Eq_138783 a5_339 = (a4_329 & a2_312) << 0x10 | (word32) ((word16) a5_214);
			if (a5_339 < a4_337)
			{
				word32 a5_341 = a5_339 + t1_187;
			}
		}
		else
		{
			if (a2 == 0x00)
				t1_187 = 1 >> a3;
			if (t1_187 < 0x00010000)
			{
				if (t1_187 > 0x00FF)
					a4_191.u0 = 8;
			}
			else
			{
				a4_191.u0 = 16;
				if (t1_187 >= 0x01000000)
					a4_191.u0 = 24;
			}
			Eq_354242 a1_247;
			word32 a6_206 = CONVERT(Mem0[0x2308DB6C<p32> + (t1_187 >>u a4_191):byte], byte, word32) + a4_191;
			int32 t3_207 = 32 - a6_206;
			if (t3_207 == 0x00)
				a1_247 = a1 - t1_187;
			else
			{
				t1_187 <<= t3_207;
				uint32 a2_211 = a1 >> a6_206;
				uint32 a6_219 = a0 >> a6_206 | a1 << t3_207;
				word32 a1_221 = (word32) (word16) t1_187;
				a5_214 = a0 << t3_207;
				Eq_138783 a4_225 = (a2_211 & t1_187 >> 0x10) << 0x10 | a6_219 >> 0x10;
				Eq_138783 a2_226 = a1_221 + (a2_211 >> (t1_187 >> 0x10));
				if (a4_225 < a2_226)
				{
					a4_225 += t1_187;
					if (a4_225 >= t1_187 && a4_225 < a2_226)
						a4_225 += t1_187;
				}
				uint32 a3_231 = a4_225 - a2_226;
				Eq_138783 a3_240 = a1_221 + (a3_231 >> (t1_187 >> 0x10));
				Eq_138783 a1_241 = (a3_231 & t1_187 >> 0x10) << 0x10 | (word32) ((word16) a6_219);
				if (a1_241 < a3_240)
				{
					a1_241 += t1_187;
					if (a1_241 >= t1_187 && a1_241 < a3_240)
						a1_241 += t1_187;
				}
				a1_247 = a1_241 - a3_240;
			}
			uint32 a3_251 = t1_187 >> 0x10;
			uint32 a0_252 = t1_187 << 0x10;
			Eq_138783 a4_264 = (a1_247 & a3_251) << 0x10 | a5_214 >> 0x10;
			Eq_138783 a1_265 = (a0_252 >> 0x10) + (a1_247 >> a3_251);
			if (a4_264 < a1_265)
			{
				a4_264 += t1_187;
				if (a4_264 >= t1_187 && a4_264 < a1_265)
					a4_264 += t1_187;
			}
			uint32 a1_270 = a4_264 - a1_265;
			Eq_138783 a1_278 = (a0_252 >> 0x10) + (a1_270 >> a3_251);
			Eq_138783 a5_280 = (a1_270 & a3_251) << 0x10 | (word32) ((word16) a5_214);
			if (a5_280 < a1_278)
			{
				word32 a5_282 = a5_280 + t1_187;
			}
		}
	}
	else if (a1 >= a3)
	{
		int32 a4_31;
		if (a3 < 0x00010000)
			a4_31 = (word32) (a3 > 0x00FF) << 0x03;
		else
		{
			a4_31 = 16;
			if (a3 >= 0x01000000)
				a4_31 = 24;
		}
		word32 t5_48 = CONVERT(Mem0[0x2308DB6C<p32> + (a3 >>u a4_31):byte], byte, word32) + a4_31;
		int32 t4_49 = 32 - t5_48;
		if (t4_49 == 0x00)
		{
			if (a3 < a1 || a0 >= a2)
				;
		}
		else
		{
			uint32 a3_53 = a2 >> t5_48 | a3 << t4_49;
			uint32 a4_56 = a1 >> t5_48;
			uint32 a5_61 = a0 >> t5_48 | a1 << t4_49;
			word32 a1_63 = (word32) (word16) a3_53;
			uint32 a4_67 = a4_56 >> (a3_53 >> 0x10);
			uint32 a2_65 = a2 << t4_49;
			uint32 a0_66 = a0 << t4_49;
			uint32 t1_69 = (a4_56 & a3_53 >> 0x10) << 0x10 | a5_61 >> 0x10;
			uint32 t6_70 = a1_63 + a4_67;
			uint32 t3_71 = a4_67;
			if (t1_69 < t6_70)
			{
				t1_69 += a3_53;
				t3_71 = a4_67 + -1;
				if (t1_69 >= a3_53 && t1_69 < t6_70)
				{
					t3_71 = a4_67 + -2;
					t1_69 += a3_53;
				}
			}
			uint32 t1_78 = t1_69 - t6_70;
			uint32 t1_84 = t1_78 >> (a3_53 >> 0x10);
			uint32 t6_86 = (t1_78 & a3_53 >> 0x10) << 0x10 | (word32) ((word16) a5_61);
			uint32 a1_88 = a1_63 + t1_84;
			uint32 a5_102 = t1_84;
			if (t6_86 < a1_88)
			{
				t6_86 += a3_53;
				a5_102 = t1_84 + -1;
				if (t6_86 >= a3_53 && t6_86 < a1_88)
				{
					a5_102 = t1_84 + -2;
					t6_86 += a3_53;
				}
			}
			uint32 t3_103 = t3_71 << 0x10 | a5_102;
			uint32 a5_112 = (t3_103 >> 0x10) + (a2_65 & 0xFFFF);
			uint32 a4_111 = (t3_103 & 0xFFFF) + (a2_65 & 0xFFFF);
			uint32 a1_97 = t6_86 - a1_88;
			uint32 t3_114 = (t3_103 >> 0x10) + (a2_65 >> 0x10);
			uint32 a6_117 = (a4_111 >> 0x10) + (((t3_103 & 0xFFFF) + (a2_65 >> 0x10)) + a5_112);
			if (a6_117 < a5_112)
				t3_114 += 0x00010000;
			uint32 t3_122 = (a6_117 >> 0x10) + t3_114;
			uint32 a4_129 = ((a6_117 & 0xFFFF) << 0x10) + (a4_111 & 0xFFFF);
			if (a1_97 < t3_122 || a1_97 == t3_122 && a0_66 < a4_129)
				;
		}
	}
}

// 2306D260: Register Eq_2 __udivdi3(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register out Eq_11891 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mm_check_beacon
//      InitGroupKey
//      cmd_sys_time_now
//      bl_timer_now_us
//      format_int
//      mbedtls_mpi_div_mpi
Eq_2 __udivdi3(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, union Eq_11891 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a4_12;
	Eq_11891 a1_11;
	Eq_2 a5_106 = a1;
	Eq_2 a6_129 = a2;
	Eq_2 a4_133 = a3;
	Eq_2 t1_10 = a0;
	if (a3 != 0x00)
	{
		if (a1 < a3)
		{
			a1_11.u0 = 0;
			a4_12.u0 = 0;
			goto l2306D434;
		}
		int32 a4_15;
		if (a3 < 0x00010000)
			a4_15 = (word32) (a3 > 0x00FF) << 0x03;
		else
		{
			a4_15 = 16;
			if (a3 >= 0x01000000)
				a4_15 = 24;
		}
		word32 a6_30 = CONVERT(Mem0[0x2308DB6C<p32> + (a3 >>u a4_15):byte], byte, word32) + a4_15;
		a1_11 = 32 - a6_30;
		if (a1_11 == 0x00)
		{
			a4_12.u0 = 1;
			if (a3 >= a1)
				a4_12 = (word32) (a0 < a2) ^ 1;
			goto l2306D434;
		}
		uint32 a3_35 = a2 >> a6_30 | a3 << a1_11;
		uint32 a4_38 = a1 >> a6_30;
		uint32 t1_43 = a0 >> a6_30 | a1 << a1_11;
		word32 a5_45 = (word32) (word16) a3_35;
		uint32 a4_48 = a4_38 >> (a3_35 >> 0x10);
		uint32 a2_47 = a2 << a1_11;
		uint32 a6_50 = (a4_38 & a3_35 >> 0x10) << 0x10 | t1_43 >> 0x10;
		uint32 t5_51 = a5_45 + a4_48;
		uint32 t3_52 = a4_48;
		if (a6_50 < t5_51)
		{
			a6_50 += a3_35;
			t3_52 = a4_48 + -1;
			if (a6_50 >= a3_35 && a6_50 < t5_51)
			{
				t3_52 = a4_48 + -2;
				a6_50 += a3_35;
			}
		}
		uint32 a6_59 = a6_50 - t5_51;
		uint32 a6_62 = a6_59 >> (a3_35 >> 0x10);
		uint32 t4_65 = a5_45 + a6_62;
		uint32 a5_69 = (a6_59 & a3_35 >> 0x10) << 0x10 | (word32) ((word16) t1_43);
		uint32 a4_70 = a6_62;
		if (a5_69 < t4_65)
		{
			a5_69 += a3_35;
			a4_70 = a6_62 + -1;
			if (a5_69 >= a3_35 && a5_69 < t4_65)
			{
				a4_70 = a6_62 + -2;
				a5_69 += a3_35;
			}
		}
		a4_12 = t3_52 << 0x10 | a4_70;
		Eq_2 a6_93 = (a4_12 >> 0x10) + (a2_47 & 0xFFFF);
		uint32 t3_92 = (a4_12 & 0xFFFF) + (a2_47 & 0xFFFF);
		a5_106 = a5_69 - t4_65;
		a3 = (t3_92 >> 0x10) + ((word32) a6_93 + ((a4_12 & 0xFFFF) + (a2_47 >> 0x10)));
		uint32 a7_102 = (a4_12 >> 0x10) + (a2_47 >> 0x10);
		if (a3 < a6_93)
			a7_102 += 0x00010000;
		Eq_2 a7_103 = (a3 >> 0x10) + a7_102;
		if (a5_106 >= a7_103)
		{
			if (a5_106 != a7_103)
				goto l2306D34C;
			a5_106.u0 = 0xFFFF;
			a3 = ((a3 & 0xFFFF) << 0x10) + (t3_92 & 0xFFFF);
			a1_11.u0 = 0;
			if (a0 << a1_11 >= a3)
				goto l2306D434;
		}
		a4_12 = (word16) a4_12.u0 - 1;
		goto l2306D34C;
	}
	else
	{
		if (a1 < a2)
		{
			int32 a4_250;
			if (a2 < 0x00010000)
				a4_250 = (word32) (a2 > 0x00FF) << 0x03;
			else
			{
				a4_250 = 16;
				if (a2 >= 0x01000000)
					a4_250 = 24;
			}
			word32 a4_262 = CONVERT(Mem0[0x2308DB6C<p32> + (a2 >>u a4_250):byte], byte, word32) + a4_250;
			int32 a3_264 = 32 - a4_262;
			if (a3_264 != 0x00)
			{
				a6_129 = a2 << a3_264;
				a1 = a0 >> a4_262 | a1 << a3_264;
				t1_10 = a0 << a3_264;
			}
			uint32 a0_274 = a6_129 >> 0x10;
			uint32 a2_278 = a6_129 << 0x10;
			uint32 a1_283 = a1 >> a0_274;
			Eq_2 a3_285 = (a1 & a0_274) << 0x10 | t1_10 >> 0x10;
			Eq_2 a5_286 = (a2_278 >> 0x10) + a1_283;
			uint32 a4_287 = a1_283;
			if (a3_285 < a5_286)
			{
				a3_285 += a6_129;
				a4_287 = a1_283 + -1;
				if (a3_285 >= a6_129 && a3_285 < a5_286)
				{
					a4_287 = a1_283 + -2;
					a3_285 += a6_129;
				}
			}
			uint32 a3_294 = a3_285 - a5_286;
			ui32 a5_296 = a3_294 & a0_274;
			a3 = a3_294 >> a0_274;
			a5_106 = a5_296 << 0x10;
			Eq_2 t1_302 = a5_296 << 0x10 | (word32) ((word16) t1_10);
			Eq_2 a1_304 = (word32) a3 + (a2_278 >> 0x10);
			Eq_2 a0_305 = a3;
			if (t1_302 < a1_304)
			{
				word32 t1_307 = a6_129 + t1_302;
				a0_305 = (word32) a3 - 1;
				if (t1_307 >= a6_129 && t1_307 < a1_304)
					a0_305 = (word32) a3 - 2;
			}
			a4_12 = a4_287 << 0x10 | a0_305;
l2306D34C:
			a1_11.u0 = 0;
			goto l2306D434;
		}
		if (a2 == 0x00)
			a6_129 = 1 >> a2;
		if (a6_129 < 0x00010000)
		{
			if (a6_129 > 0x00FF)
				a4_133.u0 = 8;
		}
		else
		{
			a4_133.u0 = 16;
			if (a6_129 >= 0x01000000)
				a4_133.u0 = 24;
		}
		uint32 a5_195;
		word32 a3_147 = CONVERT(Mem0[0x2308DB6C<p32> + (a6_129 >>u a4_133):byte], byte, word32) + a4_133;
		int32 a4_149 = 32 - a3_147;
		if (a4_149 == 0x00)
		{
			a5_195 = a1 - a6_129;
			a1_11.u0 = 1;
		}
		else
		{
			a6_129 <<= a4_149;
			uint32 a1_153 = a1 >> a3_147;
			uint32 a7_161 = a0 >> a3_147 | a1 << a4_149;
			word32 a5_163 = (word32) (word16) a6_129;
			uint32 a1_165 = a1_153 >> (a6_129 >> 0x10);
			t1_10 = a0 << a4_149;
			Eq_2 a4_167 = (a1_153 & a6_129 >> 0x10) << 0x10 | a7_161 >> 0x10;
			Eq_2 a3_168 = a5_163 + a1_165;
			uint32 a2_169 = a1_165;
			if (a4_167 < a3_168)
			{
				a4_167 += a6_129;
				a2_169 = a1_165 + -1;
				if (a4_167 >= a6_129 && a4_167 < a3_168)
				{
					a2_169 = a1_165 + -2;
					a4_167 += a6_129;
				}
			}
			uint32 a3_176 = a4_167 - a3_168;
			uint32 a3_182 = a3_176 >> (a6_129 >> 0x10);
			Eq_2 a1_185 = a5_163 + a3_182;
			Eq_2 a5_186 = (a3_176 & a6_129 >> 0x10) << 0x10 | (word32) ((word16) a7_161);
			uint32 a4_187 = a3_182;
			if (a5_186 < a1_185)
			{
				a5_186 += a6_129;
				a4_187 = a3_182 + -1;
				if (a5_186 >= a6_129 && a5_186 < a1_185)
				{
					a4_187 = a3_182 + -2;
					a5_186 += a6_129;
				}
			}
			a5_195 = a5_186 - a1_185;
			a1_11 = a2_169 << 0x10 | a4_187;
		}
		uint32 a2_205 = a6_129 >> 0x10;
		uint32 a7_206 = a6_129 << 0x10;
		uint32 a5_216 = a5_195 >> a2_205;
		Eq_2 a3_218 = (a5_195 & a2_205) << 0x10 | t1_10 >> 0x10;
		Eq_2 a0_219 = (a7_206 >> 0x10) + a5_216;
		uint32 a4_220 = a5_216;
		if (a3_218 < a0_219)
		{
			a3_218 += a6_129;
			a4_220 = a5_216 + -1;
			if (a3_218 >= a6_129 && a3_218 < a0_219)
			{
				a4_220 = a5_216 + -2;
				a3_218 += a6_129;
			}
		}
		uint32 a3_227 = a3_218 - a0_219;
		ui32 a5_229 = a3_227 & a2_205;
		a3 = a3_227 >> a2_205;
		a5_106 = a5_229 << 0x10;
		Eq_2 t1_235 = a5_229 << 0x10 | (word32) ((word16) t1_10);
		Eq_2 a7_237 = (word32) a3 + (a7_206 >> 0x10);
		Eq_2 a0_238 = a3;
		if (t1_235 < a7_237)
		{
			word32 t1_240 = a6_129 + t1_235;
			a0_238 = (word32) a3 - 1;
			if (t1_240 >= a6_129 && t1_240 < a7_237)
				a0_238 = (word32) a3 - 2;
		}
		a4_12 = a4_220 << 0x10 | a0_238;
l2306D434:
		a1Out = a1_11;
		a3Out = a3;
		a4Out = a4_12;
		a5Out = a5_106;
		return a4_12;
	}
}

