pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 2306D694: Register Eq_2 __umoddi3(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register out Eq_2 a5Out)
// Called from:
//      format_int
Eq_2 __umoddi3(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, union Eq_2 & a5Out)
{
	Eq_2 a7_167 = a2;
	Eq_2 a4_171 = a3;
	Eq_2 a5_141 = a0;
	Eq_2 a6_10 = a1;
	if (a3 == 0x00)
	{
		int32 t1_187;
		if (a1 < a2)
		{
			if (a2 < 0x00010000)
			{
				if (a2 > 0x00FF)
					a4_171.u0 = 8;
			}
			else
			{
				a4_171.u0 = 16;
				if (a2 >= 0x01000000)
					a4_171.u0 = 24;
			}
			word32 t3_281 = CONVERT(Mem0[0x2308DB6C<p32> + (a2 >>u a4_171):byte], byte, word32) + a4_171;
			t1_187 = 32 - t3_281;
			if (t1_187 != 0x00)
			{
				a7_167 = a2 << t1_187;
				a6_10 = a0 >> t3_281 | a1 << t1_187;
				a5_141 = a0 << t1_187;
			}
			uint32 a2_292 = a7_167 >> 0x10;
			uint32 a0_296 = a7_167 << 0x10;
			Eq_2 a3_303 = (a6_10 & a2_292) << 0x10 | a5_141 >> 0x10;
			Eq_2 a6_304 = (a0_296 >> 0x10) + (a6_10 >> a2_292);
			if (a3_303 < a6_304)
			{
				a3_303 += a7_167;
				if (a3_303 >= a7_167 && a3_303 < a6_304)
					a3_303 += a7_167;
			}
			uint32 a3_309 = a3_303 - a6_304;
			Eq_2 a3_317 = (a0_296 >> 0x10) + (a3_309 >> a2_292);
			Eq_2 a5_319 = (a3_309 & a2_292) << 0x10 | (word32) ((word16) a5_141);
			if (a5_319 < a3_317)
			{
				a5_319 += a7_167;
				if (a5_319 >= a7_167 && a5_319 < a3_317)
					a5_319 += a7_167;
			}
			a5_141 = a5_319 - a3_317;
		}
		else
		{
			if (a2 == 0x00)
				a7_167 = 1 >> a2;
			if (a7_167 < 0x00010000)
			{
				if (a7_167 > 0x00FF)
					a4_171.u0 = 8;
			}
			else
			{
				a4_171.u0 = 16;
				if (a7_167 >= 0x01000000)
					a4_171.u0 = 24;
			}
			uint32 a1_227;
			word32 t3_186 = CONVERT(Mem0[0x2308DB6C<p32> + (a7_167 >>u a4_171):byte], byte, word32) + a4_171;
			t1_187 = 32 - t3_186;
			if (t1_187 == 0x00)
				a1_227 = a1 - a7_167;
			else
			{
				a7_167 <<= t1_187;
				uint32 a4_191 = a1 >> t3_186;
				uint32 t3_199 = a0 >> t3_186 | a1 << t1_187;
				word32 a1_201 = (word32) (word16) a7_167;
				a5_141 = a0 << t1_187;
				Eq_2 a3_205 = (a4_191 & a7_167 >> 0x10) << 0x10 | t3_199 >> 0x10;
				Eq_2 a4_206 = a1_201 + (a4_191 >> (a7_167 >> 0x10));
				if (a3_205 < a4_206)
				{
					a3_205 += a7_167;
					if (a3_205 >= a7_167 && a3_205 < a4_206)
						a3_205 += a7_167;
				}
				uint32 a2_211 = a3_205 - a4_206;
				Eq_2 a2_220 = a1_201 + (a2_211 >> (a7_167 >> 0x10));
				Eq_2 a1_221 = (a2_211 & a7_167 >> 0x10) << 0x10 | (word32) ((word16) t3_199);
				if (a1_221 < a2_220)
				{
					a1_221 += a7_167;
					if (a1_221 >= a7_167 && a1_221 < a2_220)
						a1_221 += a7_167;
				}
				a1_227 = a1_221 - a2_220;
			}
			uint32 a4_231 = a7_167 >> 0x10;
			uint32 a0_232 = a7_167 << 0x10;
			Eq_2 a3_244 = (a1_227 & a4_231) << 0x10 | a5_141 >> 0x10;
			Eq_2 a1_245 = (a0_232 >> 0x10) + (a1_227 >> a4_231);
			if (a3_244 < a1_245)
			{
				a3_244 += a7_167;
				if (a3_244 >= a7_167 && a3_244 < a1_245)
					a3_244 += a7_167;
			}
			uint32 a1_250 = a3_244 - a1_245;
			Eq_2 a1_258 = (a0_232 >> 0x10) + (a1_250 >> a4_231);
			Eq_2 a5_260 = (a1_250 & a4_231) << 0x10 | (word32) ((word16) a5_141);
			if (a5_260 < a1_258)
			{
				a5_260 += a7_167;
				if (a5_260 >= a7_167 && a5_260 < a1_258)
					a5_260 += a7_167;
			}
			a5_141 = a5_260 - a1_258;
		}
		a0 = a5_141 >> t1_187;
	}
	else if (a1 >= a3)
	{
		int32 a4_13;
		if (a3 < 0x00010000)
			a4_13 = (word32) (a3 > 0x00FF) << 0x03;
		else
		{
			a4_13 = 16;
			if (a3 >= 0x01000000)
				a4_13 = 24;
		}
		word32 t4_28 = CONVERT(Mem0[0x2308DB6C<p32> + (a3 >>u a4_13):byte], byte, word32) + a4_13;
		int32 t3_29 = 32 - t4_28;
		if (t3_29 == 0x00)
		{
			if (a3 < a1 || a0 >= a2)
				a5_141 = a0 - a2;
			a0 = a5_141;
		}
		else
		{
			uint32 a3_33 = a2 >> t4_28 | a3 << t3_29;
			uint32 a4_36 = a1 >> t4_28;
			uint32 a5_41 = a0 >> t4_28 | a1 << t3_29;
			word32 a1_43 = (word32) (word16) a3_33;
			uint32 a4_47 = a4_36 >> (a3_33 >> 0x10);
			uint32 a2_45 = a2 << t3_29;
			uint32 a0_46 = a0 << t3_29;
			uint32 a7_49 = (a4_36 & a3_33 >> 0x10) << 0x10 | a5_41 >> 0x10;
			uint32 t5_50 = a1_43 + a4_47;
			uint32 t1_51 = a4_47;
			if (a7_49 < t5_50)
			{
				a7_49 += a3_33;
				t1_51 = a4_47 + -1;
				if (a7_49 >= a3_33 && a7_49 < t5_50)
				{
					t1_51 = a4_47 + -2;
					a7_49 += a3_33;
				}
			}
			uint32 a7_58 = a7_49 - t5_50;
			uint32 a7_61 = a7_58 >> (a3_33 >> 0x10);
			uint32 a6_64 = a1_43 + a7_61;
			uint32 a1_68 = (a7_58 & a3_33 >> 0x10) << 0x10 | (word32) ((word16) a5_41);
			uint32 a5_69 = a7_61;
			if (a1_68 < a6_64)
			{
				a1_68 += a3_33;
				a5_69 = a7_61 + -1;
				if (a1_68 >= a3_33 && a1_68 < a6_64)
				{
					a5_69 = a7_61 + -2;
					a1_68 += a3_33;
				}
			}
			uint32 t1_80 = t1_51 << 0x10 | a5_69;
			uint32 a5_92 = (t1_80 >> 0x10) + (a2_45 & 0xFFFF);
			uint32 a4_91 = (t1_80 & 0xFFFF) + (a2_45 & 0xFFFF);
			uint32 a1_85 = a1_68 - a6_64;
			uint32 t1_101 = (t1_80 >> 0x10) + (a2_45 >> 0x10);
			uint32 a6_97 = (a4_91 >> 0x10) + (((t1_80 & 0xFFFF) + (a2_45 >> 0x10)) + a5_92);
			if (a6_97 < a5_92)
				t1_101 += 0x00010000;
			uint32 t1_102 = (a6_97 >> 0x10) + t1_101;
			uint32 a4_109 = ((a6_97 & 0xFFFF) << 0x10) + (a4_91 & 0xFFFF);
			if (a1_85 < t1_102 || a1_85 == t1_102 && a0_46 < a4_109)
			{
				uint32 a2_117 = a4_109 - a2_45;
				t1_102 -= (word32) (a4_109 < a2_117) + a3_33;
				a4_109 = a2_117;
			}
			uint32 a4_129 = a0_46 - a4_109;
			a5_141 = a1_85 - t1_102 - (word32) (a0_46 < a4_129) << t4_28;
			a0 = a5_141 | a4_129 >> t3_29;
		}
	}
	a5Out = a5_141;
	return a0;
}

// 2306DAA4: Register Eq_2 __adddf3(Register Eq_2 ra, Register Eq_2 a0, Register uint32 a1, Register Eq_64619 a2, Register Eq_64620 a3, Register ptr32 fflags, Register ptr32 frm, Register out Eq_64662 a1Out)
// Called from:
//      rf_set_channel
//      pa_adapt
//      trpc_get_default_power_idx
//      rfc_init
//      rf_pri_get_vco_freq_cw
//      rf_pri_get_vco_idac_cw
//      ecvtbuf
//      __floatundisf
Eq_2 __adddf3(Eq_2 ra, Eq_2 a0, uint32 a1, Eq_64619 a2, Eq_64620 a3, ptr32 fflags, ptr32 frm, union Eq_64662 & a1Out)
{
	int32 a4_200;
	Eq_355204 s3_284 = a1 >> 0x14 & 0x07FF;
	Eq_355204 a4_100 = a3 >> 0x14 & 0x07FF;
	ui32 a0_33 = (a3 & 0x000FFFFF) << 0x03;
	Eq_355204 a3_217 = s3_284 - a4_100;
	struct Eq_84 * s1_17 = __csrrs(frm, fp + -32);
	Eq_2 t1_106 = a0 << 0x03;
	Eq_355204 s2_111 = a1 >> 0x1F;
	Eq_2 a1_107 = a0 >> 0x1D | (a1 & 0x000FFFFF) << 0x03;
	Eq_2 a5_183 = a2 >> 0x1D | a0_33;
	Eq_2 a7_184 = a2 << 0x03;
	Eq_355204 a6_124 = a3_217;
	if (a1 >> 0x1F == a3 >> 0x1F)
	{
		if (a3_217 > 0x00)
		{
			if (a4_100 == 0x00)
			{
				if ((a5_183 | a2 << 0x03) == 0x00)
					goto l2306DB28;
				a3_217 = (word32) a3_217.u0 - 1;
				if (a3_217 == ~0x00)
				{
					a7_184 = (a2 << 0x03) + (a0 << 0x03);
					a5_183 = a1_107 + a5_183 + CONVERT(a7_184 <u a0 << 0x03, bool, word32);
					goto l2306DB54;
				}
				if (a3_217 == 0x07FF)
				{
l2306DB64:
					a7_184 = a1_107 | a0 << 0x03;
					a5_183.u0 = 0;
					if (a7_184 == 0x00)
						goto l2306E544;
					if (a1_107 << 0x09 >= 0x00)
					{
l2306DBA8:
						a5_183 = a1_107;
						a7_184 = a0 << 0x03;
						s3_284.u0 = 0;
						goto l2306DBAC;
					}
					a5_183 = a1_107;
					a7_184 = a0 << 0x03;
					s3_284.u0 = 0;
l2306DCB4:
					if ((a7_184 & 7) == 0x00)
					{
						if (s3_284 == 0x00 || (a4_100 & 1) == 0x00)
							goto l2306E544;
						goto l2306DCC8;
					}
					goto l2306DED0;
				}
l2306DBBC:
				Eq_355866 a3_534;
				ui32 a7_519;
				if (a3_217 <= 56)
				{
					if (a3_217 <= 31)
					{
						int32 s0_536 = 32 - a3_217;
						a7_519 = a5_183 << s0_536 | (a2 << 0x03) >> a3_217 | (word32) ((a2 << 0x03) << s0_536 != 0x00);
						a3_534 = a5_183 >> a3_217;
						goto l2306DBF0;
					}
					uint32 a4_523 = a5_183 >> (word32) a3_217 - 32;
					int32 s0_524 = 0;
					if (a3_217 != 32)
						s0_524 = a5_183 << 64 - a3_217;
					a7_519 = a4_523 | (word32) ((s0_524 | a2 << 0x03) != 0x00);
				}
				else
					a7_519 = (word32) ((a5_183 | a2 << 0x03) != 0x00);
				a3_534.u0 = 0;
l2306DBF0:
				a7_184 = a7_519 + (a0 << 0x03);
				a5_183 = a3_534 + a1_107 + CONVERT(a7_184 <u a0 << 0x03, bool, word32);
				a6_124 = s3_284;
				goto l2306DC04;
			}
			if (s3_284 != 0x07FF)
			{
				a5_183 |= 0x00800000;
				goto l2306DBBC;
			}
l2306DB8C:
			a7_184 = a1_107 | a0 << 0x03;
			if (a7_184 != 0x00)
			{
				if (a1_107 << 0x09 >= 0x00)
				{
					a6_124.u0 = 0x07FF;
					goto l2306DBA8;
				}
				a5_183 = a1_107;
				a7_184 = a0 << 0x03;
l2306E474:
				a6_124.u0 = 0x07FF;
				goto l2306DE90;
			}
			goto l2306E428;
		}
		if (a3_217 != 0x00)
		{
			Eq_355204 a3_418;
			a6_124 = a4_100 - s3_284;
			if (s3_284 == 0x00)
			{
				if ((a1_107 | a0 << 0x03) == 0x00)
				{
					if (a6_124 != 0x07FF)
					{
l2306E3C0:
						if (a6_124 != 0x00)
							goto l2306DE90;
						goto l2306E3C4;
					}
					goto l2306DC9C;
				}
				a3_418 = (word32) a6_124 - 1;
				if (a6_124 == ~0x00)
				{
					Eq_2 t1_481 = (a0 << 0x03) + (a2 << 0x03);
					a5_183 = a1_107 + a5_183 + CONVERT(t1_481 <u a2 << 0x03, bool, word32);
					a7_184 = t1_481;
l2306DB54:
					a6_124.u0 = 1;
l2306DC04:
					if (a5_183 << 0x08 < 0x00)
					{
						a6_124 = (word32) a6_124.u0 + 1;
						if (a6_124 != 0x07FF)
						{
							uint32 a0_700 = a5_183 & ~0x00800000;
							a7_184 = a0_700 << 0x1F | (a7_184 >> 0x01 | a7_184 & 1);
							a5_183 = a0_700 >> 0x01;
							goto l2306DE90;
						}
						if (s1_17 != null)
						{
							if (s1_17 == (struct Eq_84 *) 3)
							{
								if (a1 >> 0x1F == 0x00)
									goto l2306DF10;
l2306E440:
								goto l2306DECC;
							}
							if (s1_17 != (struct Eq_84 *) 2)
								goto l2306E440;
							if (a1 >> 0x1F == 0x00)
							{
l2306DECC:
								a6_124.u0 = 0x07FE;
								s3_284.u0 = 0;
								a5_183.u0 = -1;
								a7_184.u0 = -1;
								a4_100.u0 = 5;
l2306DED0:
								Eq_2 a1_817;
								a4_100 |= 1;
								if (s1_17 != (struct Eq_84 *) 2)
								{
									if (s1_17 != (struct Eq_84 *) 3)
									{
										if (s1_17 != null)
											goto l2306DEF8;
										a1_817 = (word16) a7_184.u0 + 4;
										if ((a7_184 & 0x0F) == 4)
										{
l2306DEF8:
											if (s3_284 != 0x00)
											{
l2306DCC8:
												a4_100 |= 2;
												goto l2306E544;
											}
											goto l2306E544;
										}
l2306E4D0:
										a5_183 = (word16) a5_183.u0 + (word32) (a1_817 < a7_184);
										a7_184 = a1_817;
										goto l2306DEF8;
									}
									if (s2_111 != 0x00)
										goto l2306DEF8;
								}
								else if (s2_111 == 0x00)
									goto l2306DEF8;
								a1_817 = (word16) a7_184.u0 + 8;
								goto l2306E4D0;
							}
						}
						goto l2306DF10;
					}
					goto l2306E3C0;
				}
				if (a6_124 == 0x07FF)
				{
l2306DC9C:
					if ((a5_183 | a2 << 0x03) != 0x00)
					{
						a4_100 = (word32) ((a5_183 & 0x00400000) < 1) << 0x04;
						goto l2306DCB4;
					}
					goto l2306E47C;
				}
l2306DCF8:
				Eq_356055 a3_450;
				ui32 t1_435;
				if (a3_418 <= 56)
				{
					if (a3_418 <= 31)
					{
						int32 a0_452 = 32 - a3_418;
						t1_435 = a1_107 << a0_452 | (a0 << 0x03) >> a3_418 | (word32) ((a0 << 0x03) << a0_452 != 0x00);
						a3_450 = a1_107 >> a3_418;
						goto l2306DD2C;
					}
					uint32 a2_439 = a1_107 >> (word32) a3_418 - 32;
					int32 a0_440 = 0;
					if (a3_418 != 32)
						a0_440 = a1_107 << 64 - a3_418;
					t1_435 = a2_439 | (word32) ((a0_440 | a0 << 0x03) != 0x00);
				}
				else
					t1_435 = (word32) ((a1_107 | a0 << 0x03) != 0x00);
				a3_450.u0 = 0;
l2306DD2C:
				Eq_2 t1_466 = t1_435 + (a2 << 0x03);
				a5_183 = a3_450 + a5_183 + CONVERT(t1_466 <u a2 << 0x03, bool, word32);
				a7_184 = t1_466;
				a6_124 = a4_100;
				goto l2306DC04;
			}
			if (a4_100 != 0x07FF)
			{
				a1_107 |= 0x00800000;
				a3_418 = a6_124;
				goto l2306DCF8;
			}
			if ((a5_183 | a2 << 0x03) == 0x00)
			{
				a7_184.u0 = 0;
l2306E428:
				a6_124.u0 = 0x07FF;
				goto l2306E42C;
			}
l2306DD60:
			a6_124.u0 = 0x07FF;
			a4_200 = (a2 >> 0x1D | a0_33) << 0x09;
			s3_284.u0 = 0;
			goto l2306E098;
		}
		a6_124 = (word32) s3_284.u0 + 1;
		if (((word32) s3_284.u0 + 1 & 0x07FE) != 0x00)
		{
			if (s3_284 == -0x07FE)
			{
				if (s1_17 != null)
				{
					if (s1_17 == (struct Eq_84 *) 3)
					{
						if (a1 >> 0x1F != 0x00)
							goto l2306DEBC;
					}
					else if (s1_17 != (struct Eq_84 *) 2 || a1 >> 0x1F == 0x00)
						goto l2306DEBC;
				}
				a6_124.u0 = 0x07FF;
l2306DF10:
				a5_183.u0 = 0;
				a7_184.u0 = 0;
				a4_100.u0 = 5;
				goto l2306E544;
			}
			uint32 a7_352 = (a0 << 0x03) + (a2 << 0x03);
			word32 t1_355 = a1_107 + a5_183 + CONVERT(a7_352 <u a0 << 0x03, bool, word32);
			a7_184 = t1_355 << 0x1F | a7_352 >> 0x01;
			a5_183 = t1_355 >> 0x01;
l2306DE90:
			s3_284.u0 = 0;
			goto l2306E09C;
		}
		ui32 a3_360 = a1_107 | a0 << 0x03;
		if (s3_284 == 0x00)
		{
			if (a3_360 != 0x00)
			{
				if ((a5_183 | a2 << 0x03) == 0x00)
					goto l2306E194;
				a7_184 = (a2 << 0x03) + (a0 << 0x03);
				a1_107 = a1_107 + a5_183 + CONVERT(a7_184 <u a0 << 0x03, bool, word32);
				if (a1_107 << 0x08 < 0x00)
				{
					a5_183 = a1_107 & ~0x00800000;
					a4_100.u0 = 0;
					a6_124.u0 = 1;
					goto l2306DCB4;
				}
l2306E3C8:
				t1_106 = a7_184;
l2306E194:
				a7_184 = t1_106 | a1_107;
				if (a7_184 != 0x00)
				{
					uint32 s3_596 = (a1_107 << 0x01) + (t1_106 >> 0x1F);
					Eq_355452 a5_597 = t1_106 << 0x01;
					a4_100.u0 = 0;
					if ((a5_597 & 7) != 0x00)
					{
						if (s1_17 != (struct Eq_84 *) 2)
						{
							if (s1_17 != (struct Eq_84 *) 3)
							{
								a4_100.u0 = 1;
								if (s1_17 == null && (a5_597 & 0x0F) != 4)
									s3_596 += (word32) (a5_597 < -4) ^ 1;
							}
							else
							{
								a4_100 = s2_111;
								if (s2_111 == 0x00)
								{
									s3_596 += (word32) (a5_597 < -8) ^ 1;
									a4_100.u0 = 1;
								}
							}
						}
						else
						{
							a4_100.u0 = 1;
							if (s2_111 != 0x00)
							{
								s3_596 += (word32) (a5_597 < -8) ^ 1;
								a4_100 = s2_111;
							}
						}
					}
					s3_284 = (s3_596 >> 0x18 ^ 1) & 1;
					a5_183 = a1_107;
					a7_184 = t1_106;
					a6_124.u0 = 0;
					goto l2306DCB4;
				}
				a6_124.u0 = 0;
l2306E42C:
				a5_183.u0 = 0;
				a4_100.u0 = 0;
				goto l2306E544;
			}
l2306E3C4:
			a1_107 = a5_183;
			goto l2306E3C8;
		}
		Eq_355204 a6_362;
		if (s3_284 == 0x07FF)
		{
			if (a3_360 != 0x00)
			{
				a6_362 = (word32) ((a1_107 & 0x00400000) < 1) << 0x04;
				if (a4_100 != s3_284)
					goto l2306DE4C;
			}
			else
			{
				if (a4_100 != s3_284)
					goto l2306E474;
				a6_362.u0 = 0;
			}
		}
		else
		{
			a6_362.u0 = 0;
			if (a4_100 != 0x07FF)
				goto l2306DE48;
		}
		if ((a5_183 | a2 << 0x03) == 0x00)
		{
			if (a3_360 == 0x00)
				goto l2306DE5C;
l2306DE54:
			a5_183 = a1_107;
			a7_184 = a0 << 0x03;
l2306DE5C:
			a4_100 = a6_362;
l2306E4B4:
			s3_284.u0 = 0;
			a6_124.u0 = 0x07FF;
			goto l2306DCB4;
		}
		if (a5_183 << 0x09 >= 0x00)
			a6_362.u0 = 16;
l2306DE48:
		if (a3_360 == 0x00)
			goto l2306DE5C;
l2306DE4C:
		if ((a5_183 | a2 << 0x03) == 0x00)
			goto l2306DE54;
		a4_100 = a6_362;
l2306E538:
		s2_111.u0 = 0;
		a5_183.u0 = 0x00400000;
		a7_184.u0 = 0;
		a6_124.u0 = 0x07FF;
l2306E544:
		if (a5_183 << 0x08 >= 0x00)
		{
l2306E564:
			Eq_2 a7_938 = a5_183 << 0x1D | a7_184 >> 0x03;
			Eq_355510 a5_939 = a5_183 >> 0x03;
			if (a6_124 == 0x07FF)
			{
				a7_938 |= a5_939;
				a5_939.u0 = 0;
				if (a7_938 != 0x00)
				{
					a5_939.u0 = 0x00080000;
					a7_938.u0 = 0;
					s2_111.u0 = 0;
				}
			}
			Eq_64662 a1_962 = (word32) (word20) a5_939 | (a6_124 & 0x07FF) << 0x14 | s2_111 << 0x1F;
			if (a4_100 != 0x00)
				__csrrs(fflags, ra);
			a1Out = a1_962;
			return a7_938;
		}
		a6_124 = (word32) a6_124.u0 + 1;
		if (a6_124 != 0x07FF)
		{
			a5_183 &= ~0x00800000;
			goto l2306E564;
		}
		a7_184.u0 = 0;
		if (s1_17 != null)
		{
			if (s1_17 == (struct Eq_84 *) 3)
			{
				if (s2_111 == 0x00)
					goto l2306E514;
			}
			else if (s1_17 == (struct Eq_84 *) 2 && s2_111 != 0x00)
				goto l2306E514;
			a7_184.u0 = -1;
			a6_124.u0 = 0x07FE;
		}
l2306E514:
		a4_100 |= 5;
		a5_183 = a7_184;
		goto l2306E564;
	}
	Eq_2 s4_282;
	Eq_2 s0_279;
	if (a3_217 > 0x00)
	{
		if (a4_100 == 0x00)
		{
			if ((a5_183 | a2 << 0x03) == 0x00)
			{
l2306DB28:
				if (a3_217 != 0x07FF)
				{
					a5_183 = a1_107;
					a7_184 = a0 << 0x03;
					goto l2306DE90;
				}
				goto l2306DB64;
			}
			a3_217 = (word32) a3_217 - 1;
			if (a3_217 == ~0x00)
			{
				a7_184 = (a0 << 0x03) - (a2 << 0x03);
				a5_183 = a1_107 - a5_183 - (word32) (a0 << 0x03 < a7_184);
				goto l2306DF58;
			}
			if (a3_217 == 0x07FF)
				goto l2306DB64;
		}
		else
		{
			if (s3_284 == 0x07FF)
				goto l2306DB8C;
			a5_183 |= 0x00800000;
		}
		Eq_355311 a3_239;
		ui32 a7_224;
		if (a3_217 <= 56)
		{
			if (a3_217 <= 31)
			{
				int32 s0_241 = 32 - a3_217;
				a7_224 = a5_183 << s0_241 | (a2 << 0x03) >> a3_217 | (word32) ((a2 << 0x03) << s0_241 != 0x00);
				a3_239 = a5_183 >> a3_217;
				goto l2306DF9C;
			}
			uint32 a4_228 = a5_183 >> (word32) a3_217 - 32;
			int32 s0_229 = 0;
			if (a3_217 != 32)
				s0_229 = a5_183 << 64 - a3_217;
			a7_224 = a4_228 | (word32) ((s0_229 | a2 << 0x03) != 0x00);
		}
		else
			a7_224 = (word32) ((a5_183 | a2 << 0x03) != 0x00);
		a3_239.u0 = 0;
l2306DF9C:
		a7_184 = (a0 << 0x03) - a7_224;
		a5_183 = a1_107 - a3_239 - (word32) (a0 << 0x03 < a7_184);
		a6_124 = s3_284;
		goto l2306DFB0;
	}
	if (a3_217 != 0x00)
	{
		Eq_355204 s0_128;
		a6_124 = a4_100 - s3_284;
		if (s3_284 == 0x00)
		{
			if ((a1_107 | a0 << 0x03) == 0x00)
			{
				s2_111 = a3 >> 0x1F;
				if (a6_124 != 0x07FF)
					goto l2306E3C0;
				if ((a5_183 | a2 << 0x03) != 0x00)
				{
					a4_100.u0 = 0;
					if (a5_183 << 0x09 < 0x00)
						goto l2306DCB4;
					goto l2306DBAC;
				}
l2306E47C:
				a7_184.u0 = 0;
				goto l2306E42C;
			}
			s0_128 = (word32) a6_124.u0 - 1;
			if (a6_124 == ~0x00)
			{
				Eq_2 t1_202 = (a2 << 0x03) - (a0 << 0x03);
				a5_183 = a5_183 - a1_107 - (word32) (a2 << 0x03 < t1_202);
				s2_111 = a3 >> 0x1F;
				a7_184 = t1_202;
l2306DF58:
				a6_124.u0 = 1;
				goto l2306DFB0;
			}
			if (a6_124 == 0x07FF)
			{
				if ((a5_183 | a2 << 0x03) != 0x00)
				{
					a4_200 = a5_183 << 0x09;
					s2_111 = a3 >> 0x1F;
l2306E098:
					if (a4_200 < 0x00)
					{
l2306E09C:
						a4_100.u0 = 0;
						goto l2306DCB4;
					}
l2306DBAC:
					a4_100.u0 = 16;
					goto l2306DCB4;
				}
				goto l2306E490;
			}
		}
		else
		{
			if (a4_100 == 0x07FF)
			{
				if ((a5_183 | a2 << 0x03) != 0x00)
				{
					s2_111 = a3 >> 0x1F;
					goto l2306DD60;
				}
				a6_124.u0 = 0x07FF;
l2306E490:
				a7_184.u0 = 0;
				s2_111 = a3 >> 0x1F;
				goto l2306E42C;
			}
			a1_107 |= 0x00800000;
			s0_128 = a6_124;
		}
		Eq_355822 a3_159;
		ui32 t1_144;
		if (s0_128 <= 56)
		{
			if (s0_128 <= 31)
			{
				int32 a0_161 = 32 - s0_128;
				t1_144 = a1_107 << a0_161 | (a0 << 0x03) >> s0_128 | (word32) ((a0 << 0x03) << a0_161 != 0x00);
				a3_159 = a1_107 >> s0_128;
				goto l2306E104;
			}
			uint32 a2_148 = a1_107 >> (word32) s0_128 - 32;
			int32 a0_149 = 0;
			if (s0_128 != 32)
				a0_149 = a1_107 << 64 - s0_128;
			t1_144 = a2_148 | (word32) ((a0_149 | a0 << 0x03) != 0x00);
		}
		else
			t1_144 = (word32) ((a1_107 | a0 << 0x03) != 0x00);
		a3_159.u0 = 0;
l2306E104:
		Eq_2 t1_175 = (a2 << 0x03) - t1_144;
		a5_183 = a5_183 - a3_159 - (word32) (a2 << 0x03 < t1_175);
		a7_184 = t1_175;
		a6_124 = a4_100;
		s2_111 = a3 >> 0x1F;
l2306DFB0:
		if (a5_183 << 0x08 >= 0x00)
			goto l2306E3C0;
		s0_279 = a5_183 & 0x007FFFFF;
		s4_282 = a7_184;
		s3_284 = a6_124;
l2306E2E8:
		Eq_2 a0_291;
		if (s0_279 != 0x00)
		{
			word32 a4_1934;
			a0_291 = __clzsi2(s0_279, out a4_1934);
		}
		else
		{
			word32 a4_1933;
			a0_291 = (word32) __clzsi2(s4_282, out a4_1933) + 32;
		}
		uint32 s0_301;
		Eq_355204 a6_297 = (word32) a0_291 - 8;
		if (a6_297 <= 31)
		{
			s0_301 = s4_282 >> 32 - a6_297 | s0_279 << a6_297;
			a7_184 = s4_282 << a6_297;
		}
		else
		{
			s0_301 = s4_282 << (word32) a0_291 - 40;
			a7_184.u0 = 0;
		}
		if (a6_297 < s3_284)
		{
			a6_124 = s3_284 - a6_297;
			a5_183 = s0_301 & ~0x00800000;
			goto l2306E3C0;
		}
		int32 a6_319 = a6_297 - s3_284;
		if (a6_319 <= -30)
		{
			int32 a2_338 = 32 - (a6_319 + 1);
			t1_106 = s0_301 << a2_338 | a7_184 >> a6_319 + 1 | (word32) (a7_184 << a2_338 != 0x00);
			a1_107 = s0_301 >> a6_319 + 1;
			goto l2306E194;
		}
		uint32 a6_324 = s0_301 >> a6_319 + -31;
		int32 a4_325 = 0;
		if (a6_319 != -31)
			a4_325 = s0_301 << 64 - (a6_319 + 1);
		t1_106 = a6_324 | (word32) ((a7_184 | a4_325) != 0x00);
l2306E248:
		a1_107.u0 = 0;
		goto l2306E194;
	}
	if (((word32) s3_284.u0 + 1 & 0x07FE) != 0x00)
	{
		s4_282 = (a0 << 0x03) - (a2 << 0x03);
		s0_279 = a1_107 - a5_183 - (word32) (a0 << 0x03 < s4_282);
		if (s0_279 << 0x08 < 0x00)
		{
			s4_282 = (a2 << 0x03) - (a0 << 0x03);
			s0_279 = a5_183 - a1_107 - (word32) (a2 << 0x03 < s4_282);
			s2_111 = a3 >> 0x1F;
			goto l2306E2E8;
		}
		t1_106 = s4_282 | s0_279;
		if (t1_106 != 0x00)
			goto l2306E2E8;
		goto l2306E240;
	}
	ui32 a0_55 = a1_107 | a0 << 0x03;
	ui32 a2_56 = a5_183 | a2 << 0x03;
	if (s3_284 == 0x00)
	{
		if (a0_55 == 0x00)
		{
			if (a2_56 == 0x00)
			{
				s2_111 = (word32) (s1_17 < (struct Eq_84 *) -3);
				a1_107.u0 = 0;
				t1_106.u0 = 0;
				goto l2306E194;
			}
			a1_107 = a5_183;
			t1_106 = a2 << 0x03;
l2306E230:
			s2_111 = a3 >> 0x1F;
			goto l2306E194;
		}
		if (a2_56 == 0x00)
			goto l2306E194;
		Eq_2 a3_101 = (a0 << 0x03) - (a2 << 0x03);
		Eq_2 a4_104 = a1_107 - a5_183 - (word32) (a0 << 0x03 < a3_101);
		if (a4_104 << 0x08 < 0x00)
		{
			t1_106 = (a2 << 0x03) - (a0 << 0x03);
			a1_107 = a5_183 - a1_107 - (word32) (a2 << 0x03 < t1_106);
			goto l2306E230;
		}
		t1_106 = a3_101 | a4_104;
		if (t1_106 != 0x00)
		{
			a1_107 = a4_104;
			t1_106 = a3_101;
			goto l2306E194;
		}
l2306E240:
		s2_111 = (word32) (s1_17 < (struct Eq_84 *) -3);
		goto l2306E248;
	}
	if (s3_284 == 0x07FF)
	{
		if (a0_55 != 0x00)
		{
			ui32 a3_63 = (word32) ((a1_107 & 0x00400000) < 1);
			if (a4_100 != s3_284)
			{
				a4_100 = a3_63 << 0x04;
				goto l2306E530;
			}
			a4_100 = a3_63 << 0x04;
l2306E280:
			if (a2_56 != 0x00 && a5_183 << 0x09 >= 0x00)
				a4_100.u0 = 16;
			goto l2306E290;
		}
		if (a4_100 != s3_284)
		{
			a4_100.u0 = 0;
l2306E294:
			s2_111 = a3 >> 0x1F;
			if (a2_56 == 0x00)
			{
				a7_184.u0 = 0;
				s2_111.u0 = 0;
				a5_183.u0 = 0x00400000;
				a6_124.u0 = 0x07FF;
				a4_100.u0 = 16;
				goto l2306E544;
			}
			goto l2306E4B0;
		}
	}
	else if (a4_100 != 0x07FF)
	{
		a4_100.u0 = 0;
l2306E290:
		if (a0_55 == 0x00)
			goto l2306E294;
l2306E530:
		if (a2_56 != 0x00)
			goto l2306E538;
		a5_183 = a1_107;
		a7_184 = a0 << 0x03;
l2306E4B0:
		goto l2306E4B4;
	}
	a4_100.u0 = 0;
	goto l2306E280;
}

