pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0006.c
// 2306F8DC: void __subdf3(Register Eq_2 ra, Register Eq_2 a0, Register Eq_64250 a1, Register Eq_2 a2, Register Eq_64250 a3, Register ptr32 fflags, Register ptr32 frm)
// Called from:
//      modf
void __subdf3(Eq_2 ra, Eq_2 a0, Eq_64250 a1, Eq_2 a2, Eq_64250 a3, ptr32 fflags, ptr32 frm)
{
	struct Eq_84 * s3_17 = __csrrs(frm, fp + -32);
	Eq_2 a5_136 = a2 >> 0x1D | (a3 & 0x000FFFFF) << 0x03;
	Eq_357801 a6_210 = a3 >> 0x14 & 0x07FF;
	Eq_357801 s1_291 = a1 >> 0x14 & 0x07FF;
	Eq_357801 s2_104 = a1 >> 0x1F;
	Eq_2 t3_111 = a0 >> 0x1D | (a1 & 0x000FFFFF) << 0x03;
	Eq_2 a7_100 = a0 << 0x03;
	Eq_357801 a3_39 = a3 >> 0x1F;
	Eq_2 t1_193 = a2 << 0x03;
	if (a6_210 != 0x07FF || (a5_136 | a2 << 0x03) == 0x00)
		a3_39 = a3 >> 0x1F ^ 1;
	Eq_357801 a4_130 = s1_291 - a6_210;
	if (a3_39 == a1 >> 0x1F)
	{
		if (a4_130 > 0x00)
		{
			Eq_357801 a3_495;
			if (a6_210 == 0x00)
			{
				if ((a5_136 | a2 << 0x03) == 0x00)
					goto l2306F970;
				a3_495 = (word32) a4_130 - 1;
				if (a4_130 == ~0x00)
				{
					t1_193 = (a2 << 0x03) + (a0 << 0x03);
					a5_136 = t3_111 + a5_136 + CONVERT(t1_193 <u a0 << 0x03, bool, word32);
					goto l2306F99C;
				}
				if (a4_130 == 0x07FF)
				{
l2306F9AC:
					a5_136 = t3_111 | a0 << 0x03;
					if (a5_136 != 0x00)
					{
						if (t3_111 << 0x09 < 0x00)
						{
l2306F978:
							a5_136 = t3_111;
							goto l2306F97C;
						}
						a5_136 = t3_111;
l2306F9C0:
						s1_291.u0 = 16;
						goto l2306FC30;
					}
					a7_100.u0 = 0;
l23070328:
					s1_291.u0 = 0;
					goto l23070110;
				}
l2306F9F4:
				Eq_358490 a3_530;
				ui32 t1_515;
				if (a3_495 <= 56)
				{
					if (a3_495 <= 31)
					{
						int32 a2_532 = 32 - a3_495;
						t1_515 = a5_136 << a2_532 | (a2 << 0x03) >> a3_495 | (word32) ((a2 << 0x03) << a2_532 != 0x00);
						a3_530 = a5_136 >> a3_495;
						goto l2306FA28;
					}
					uint32 a4_519 = a5_136 >> (word32) a3_495 - 32;
					int32 a2_520 = 0;
					if (a3_495 != 32)
						a2_520 = a5_136 << 64 - a3_495;
					t1_515 = a4_519 | (word32) ((a2_520 | a2 << 0x03) != 0x00);
				}
				else
					t1_515 = (word32) ((a5_136 | a2 << 0x03) != 0x00);
				a3_530.u0 = 0;
l2306FA28:
				t1_193 = t1_515 + (a0 << 0x03);
				a5_136 = a3_530 + t3_111 + CONVERT(t1_193 <u a0 << 0x03, bool, word32);
				a4_130 = s1_291;
				goto l2306FA3C;
			}
			if (s1_291 != 0x07FF)
			{
				a5_136 |= 0x00800000;
				a3_495 = a4_130;
				goto l2306F9F4;
			}
l2306F9D0:
			a5_136 = t3_111 | a0 << 0x03;
			if (a5_136 != 0x00)
			{
				if (t3_111 << 0x09 >= 0x00)
				{
					a5_136 = t3_111;
					goto l2306FB84;
				}
				a5_136 = t3_111;
l2307033C:
				a4_130.u0 = 0x07FF;
				goto l2306FCD0;
			}
			a7_100.u0 = 0;
			goto l23070308;
		}
		if (a4_130 != 0x00)
		{
			Eq_357801 s0_420;
			a4_130 = a6_210 - s1_291;
			if (s1_291 == 0x00)
			{
				if ((t3_111 | a0 << 0x03) == 0x00)
				{
					if (a4_130 != 0x07FF)
					{
l2306FE90:
						if (a4_130 != 0x00)
						{
							a7_100 = t1_193;
							goto l2306FCD0;
						}
						goto l2306FE94;
					}
					goto l2306FAD4;
				}
				s0_420 = (word32) a4_130 - 1;
				if (a4_130 == ~0x00)
				{
					Eq_2 a7_479 = (a0 << 0x03) + (a2 << 0x03);
					a5_136 = t3_111 + a5_136 + CONVERT(a7_479 <u a2 << 0x03, bool, word32);
					t1_193 = a7_479;
l2306F99C:
					a4_130.u0 = 1;
					goto l2306FA3C;
				}
				if (a4_130 == 0x07FF)
				{
l2306FAD4:
					a7_100 = a5_136 | a2 << 0x03;
					if (a7_100 == 0x00)
					{
						a5_136.u0 = 0;
						goto l23070110;
					}
					a7_100 = a2 << 0x03;
					a6_210.u0 = 0;
					if (a5_136 << 0x09 >= 0x00)
						goto l2306F9C0;
					goto l2306FC30;
				}
			}
			else
			{
				if (a6_210 == 0x07FF)
				{
					a7_100 = a5_136 | a2 << 0x03;
					if (a7_100 != 0x00)
					{
						a7_100 = a2 << 0x03;
						if (a5_136 << 0x09 >= 0x00)
						{
l2306FB84:
							goto l2306FB88;
						}
						goto l2307033C;
					}
					a5_136.u0 = 0;
l23070308:
					a4_130.u0 = 0x07FF;
					goto l23070328;
				}
				t3_111 |= 0x00800000;
				s0_420 = a4_130;
			}
			Eq_358662 s0_448;
			ui32 a7_433;
			if (s0_420 <= 56)
			{
				if (s0_420 <= 31)
				{
					int32 a0_450 = 32 - s0_420;
					a7_433 = t3_111 << a0_450 | (a0 << 0x03) >> s0_420 | (word32) ((a0 << 0x03) << a0_450 != 0x00);
					s0_448 = t3_111 >> s0_420;
					goto l2306FB4C;
				}
				uint32 a4_437 = t3_111 >> (word32) s0_420 - 32;
				int32 a0_438 = 0;
				if (s0_420 != 32)
					a0_438 = t3_111 << 64 - s0_420;
				a7_433 = a4_437 | (word32) ((a0_438 | a0 << 0x03) != 0x00);
			}
			else
				a7_433 = (word32) ((t3_111 | a0 << 0x03) != 0x00);
			s0_448.u0 = 0;
l2306FB4C:
			Eq_2 a7_464 = a7_433 + (a2 << 0x03);
			a5_136 = s0_448 + a5_136 + CONVERT(a7_464 <u a2 << 0x03, bool, word32);
			t1_193 = a7_464;
			a4_130 = a6_210;
l2306FA3C:
			if (a5_136 << 0x08 < 0x00)
			{
				a4_130 = (word32) a4_130.u0 + 1;
				if (a4_130 != 0x07FF)
				{
					uint32 a3_695 = a5_136 & ~0x00800000;
					a7_100 = a3_695 << 0x1F | (t1_193 >> 0x01 | t1_193 & 1);
					a5_136 = a3_695 >> 0x01;
					goto l2306FCD0;
				}
				if (s3_17 != null)
				{
					if (s3_17 == (struct Eq_84 *) 3)
					{
						if (a1 >> 0x1F == 0x00)
							goto l2306FD58;
l23070310:
						goto l2306FD0C;
					}
					if (s3_17 != (struct Eq_84 *) 2)
						goto l23070310;
					if (a1 >> 0x1F == 0x00)
					{
l2306FD0C:
						a4_130.u0 = 0x07FE;
						a6_210.u0 = 0;
						a5_136.u0 = -1;
						a7_100.u0 = -1;
						s1_291.u0 = 5;
l2306FD10:
						Eq_2 a3_808;
						s1_291 |= 1;
						if (s3_17 != (struct Eq_84 *) 2)
						{
							if (s3_17 != (struct Eq_84 *) 3)
							{
								if (s3_17 != null || (a7_100 & 0x0F) == 4)
									goto l230703B0;
								a3_808 = (word16) a7_100.u0 + 4;
l2306FD38:
								a5_136 = (word32) a5_136 + (word32) (a3_808 < a7_100);
								a7_100 = a3_808;
l230703B0:
								if (a6_210 != 0x00)
								{
l2306FC44:
									s1_291 |= 2;
									goto l23070110;
								}
								goto l23070110;
							}
							if (s2_104 != 0x00)
								goto l230703B0;
						}
						else if (s2_104 == 0x00)
							goto l230703B0;
						a3_808 = (word16) a7_100.u0 + 8;
						goto l2306FD38;
					}
				}
				goto l2306FD58;
			}
			goto l2306FE90;
		}
		a4_130 = (word32) s1_291.u0 + 1;
		if (((word32) s1_291.u0 + 1 & 0x07FE) != 0x00)
		{
			if (s1_291 == -0x07FE)
			{
				if (s3_17 != null)
				{
					if (s3_17 == (struct Eq_84 *) 3)
					{
						if (a1 >> 0x1F != 0x00)
							goto l2306FCFC;
					}
					else if (s3_17 != (struct Eq_84 *) 2 || a1 >> 0x1F == 0x00)
						goto l2306FCFC;
				}
				a4_130.u0 = 0x07FF;
l2306FD58:
				a5_136.u0 = 0;
				a7_100.u0 = 0;
				s1_291.u0 = 5;
l23070110:
				if (a5_136 << 0x08 >= 0x00)
				{
l23070130:
					ui32 a7_917 = a5_136 << 0x1D | a7_100 >> 0x03;
					uint32 a5_919 = a5_136 >> 0x03;
					if (s1_291 != 0x00)
						__csrrs(fflags, ra);
					return;
				}
				a4_130 = (word32) a4_130.u0 + 1;
				if (a4_130 != 0x07FF)
				{
					a5_136 &= ~0x00800000;
					goto l23070130;
				}
				a7_100.u0 = 0;
				if (s3_17 != null)
				{
					if (s3_17 == (struct Eq_84 *) 3)
					{
						if (s2_104 == 0x00)
							goto l230703E4;
					}
					else if (s3_17 == (struct Eq_84 *) 2 && s2_104 != 0x00)
						goto l230703E4;
					a7_100.u0 = -1;
					a4_130.u0 = 0x07FE;
				}
l230703E4:
				s1_291 |= 5;
				a5_136 = a7_100;
				goto l23070130;
			}
			uint32 t1_359 = (a0 << 0x03) + (a2 << 0x03);
			word32 t3_362 = t3_111 + a5_136 + CONVERT(t1_359 <u a0 << 0x03, bool, word32);
			a7_100 = t3_362 << 0x1F | t1_359 >> 0x01;
			a5_136 = t3_362 >> 0x01;
l2306FCD0:
			a6_210.u0 = 0;
l2306F97C:
			s1_291.u0 = 0;
			goto l2306FC30;
		}
		ui32 a3_367 = t3_111 | a0 << 0x03;
		if (s1_291 == 0x00)
		{
			if (a3_367 != 0x00)
			{
				if ((a5_136 | a2 << 0x03) == 0x00)
					goto l2306FFE4;
				t1_193 = (a0 << 0x03) + (a2 << 0x03);
				t3_111 = t3_111 + a5_136 + CONVERT(t1_193 <u a0 << 0x03, bool, word32);
				if (t3_111 << 0x08 < 0x00)
				{
					a5_136 = t3_111 & ~0x00800000;
					a7_100 = t1_193;
					a6_210.u0 = 0;
					a4_130.u0 = 1;
					goto l2306FC30;
				}
l2306FE98:
				a7_100 = t1_193;
l2306FFE4:
				a5_136 = a7_100 | t3_111;
				if (a5_136 == 0x00)
				{
					a7_100.u0 = 0;
					a4_130.u0 = 0;
					goto l23070328;
				}
				uint32 a6_592 = (t3_111 << 0x01) + (a7_100 >> 0x1F);
				Eq_358035 a5_593 = a7_100 << 0x01;
				s1_291.u0 = 0;
				if ((a5_593 & 7) != 0x00)
				{
					if (s3_17 != (struct Eq_84 *) 2)
					{
						if (s3_17 != (struct Eq_84 *) 3)
						{
							s1_291.u0 = 1;
							if (s3_17 == null && (a5_593 & 0x0F) != 4)
								a6_592 += (word32) (a5_593 < -4) ^ 1;
						}
						else
						{
							s1_291 = s2_104;
							if (s2_104 == 0x00)
							{
								a6_592 += (word32) (a5_593 < -8) ^ 1;
								s1_291.u0 = 1;
							}
						}
					}
					else
					{
						s1_291.u0 = 1;
						if (s2_104 != 0x00)
						{
							a6_592 += (word32) (a5_593 < -8) ^ 1;
							s1_291 = s2_104;
						}
					}
				}
				a6_210 = (a6_592 >> 0x18 ^ 1) & 1;
				a5_136 = t3_111;
				a4_130.u0 = 0;
				goto l2306FC30;
			}
l2306FE94:
			t3_111 = a5_136;
			goto l2306FE98;
		}
		if (s1_291 == 0x07FF)
		{
			if (a3_367 != 0x00)
			{
				s1_291 = (word32) ((t3_111 & 0x00400000) < 1) << 0x04;
				if (a6_210 != 0x07FF)
					goto l2306FC90;
			}
			else
			{
				if (a6_210 != s1_291)
				{
					a7_100 = a2 << 0x03;
					goto l2307033C;
				}
				s1_291.u0 = 0;
			}
		}
		else
		{
			s1_291.u0 = 0;
			if (a6_210 != 0x07FF)
				goto l2306FC8C;
		}
		if ((a5_136 | a2 << 0x03) == 0x00)
		{
			if (a3_367 != 0x00)
			{
l2306FC98:
				a5_136 = t3_111;
				goto l230700E8;
			}
			goto l23070400;
		}
		if (a5_136 << 0x09 >= 0x00)
			s1_291.u0 = 16;
l2306FC8C:
		if (a3_367 != 0x00)
		{
l2306FC90:
			if ((a5_136 | a2 << 0x03) == 0x00)
				goto l2306FC98;
l23070100:
			s2_104.u0 = 0;
			a5_136.u0 = 0x00400000;
			a7_100.u0 = 0;
			a4_130.u0 = 0x07FF;
			goto l23070110;
		}
l23070400:
		a7_100 = a2 << 0x03;
		goto l230700E8;
	}
	Eq_2 s4_289;
	Eq_2 s0_286;
	if (a4_130 > 0x00)
	{
		Eq_357801 a3_222;
		if (a6_210 == 0x00)
		{
			if ((a5_136 | a2 << 0x03) == 0x00)
			{
l2306F970:
				if (a4_130 != 0x07FF)
					goto l2306F978;
				goto l2306F9AC;
			}
			a3_222 = (word32) a4_130 - 1;
			if (a4_130 == ~0x00)
			{
				t1_193 = (a0 << 0x03) - (a2 << 0x03);
				a5_136 = t3_111 - a5_136 - (word32) (a0 << 0x03 < t1_193);
				goto l2306FDA0;
			}
			if (a4_130 == 0x07FF)
				goto l2306F9AC;
		}
		else
		{
			if (s1_291 == 0x07FF)
				goto l2306F9D0;
			a5_136 |= 0x00800000;
			a3_222 = a4_130;
		}
		Eq_357921 a3_246;
		ui32 t1_231;
		if (a3_222 <= 56)
		{
			if (a3_222 <= 31)
			{
				int32 a2_248 = 32 - a3_222;
				t1_231 = a5_136 << a2_248 | (a2 << 0x03) >> a3_222 | (word32) ((a2 << 0x03) << a2_248 != 0x00);
				a3_246 = a5_136 >> a3_222;
				goto l2306FDE4;
			}
			uint32 a4_235 = a5_136 >> (word32) a3_222 - 32;
			int32 a2_236 = 0;
			if (a3_222 != 32)
				a2_236 = a5_136 << 64 - a3_222;
			t1_231 = a4_235 | (word32) ((a2_236 | a2 << 0x03) != 0x00);
		}
		else
			t1_231 = (word32) ((a5_136 | a2 << 0x03) != 0x00);
		a3_246.u0 = 0;
l2306FDE4:
		t1_193 = (a0 << 0x03) - t1_231;
		a5_136 = t3_111 - a3_246 - (word32) (a0 << 0x03 < t1_193);
		a4_130 = s1_291;
		goto l2306FDF8;
	}
	if (a4_130 != 0x00)
	{
		Eq_357801 s0_134;
		a4_130 = a6_210 - s1_291;
		if (s1_291 == 0x00)
		{
			if ((t3_111 | a0 << 0x03) == 0x00)
			{
				s2_104 = a3_39;
				if (a4_130 != 0x07FF)
					goto l2306FE90;
				goto l2306FAD4;
			}
			s0_134 = (word32) a4_130.u0 - 1;
			if (a4_130 == ~0x00)
			{
				Eq_2 a7_211 = (a2 << 0x03) - (a0 << 0x03);
				a5_136 = a5_136 - t3_111 - (word32) (a2 << 0x03 < a7_211);
				s2_104 = a3_39;
				t1_193 = a7_211;
l2306FDA0:
				a4_130.u0 = 1;
				goto l2306FDF8;
			}
			if (a4_130 == 0x07FF)
			{
				a7_100 = a5_136 | a2 << 0x03;
				if (a7_100 == 0x00)
				{
					a5_136.u0 = 0;
					s2_104 = a3_39;
					goto l23070110;
				}
				a7_100 = a2 << 0x03;
				s2_104 = a3_39;
				a6_210.u0 = 0;
				if (a5_136 << 0x09 >= 0x00)
					goto l2306F9C0;
l2306FC30:
				if ((a7_100 & 7) == 0x00)
				{
					if (a6_210 == 0x00 || (s1_291 & 1) == 0x00)
						goto l23070110;
					goto l2306FC44;
				}
				goto l2306FD10;
			}
		}
		else
		{
			if (a6_210 == 0x07FF)
			{
				a7_100 = a5_136 | a2 << 0x03;
				if (a7_100 == 0x00)
				{
					a5_136.u0 = 0;
					a4_130.u0 = 0x07FF;
					s2_104 = a3_39;
					goto l23070328;
				}
				a7_100 = a2 << 0x03;
				if (a5_136 << 0x09 < 0x00)
				{
					a4_130.u0 = 0x07FF;
					s2_104 = a3_39;
					goto l2306FCD0;
				}
				s2_104 = a3_39;
l2306FB88:
				a4_130.u0 = 0x07FF;
				a6_210.u0 = 0;
				goto l2306F9C0;
			}
			t3_111 |= 0x00800000;
			s0_134 = a4_130;
		}
		Eq_358303 s0_168;
		ui32 a7_153;
		if (s0_134 <= 56)
		{
			if (s0_134 <= 31)
			{
				int32 a0_170 = 32 - s0_134;
				a7_153 = t3_111 << a0_170 | (a0 << 0x03) >> s0_134 | (word32) ((a0 << 0x03) << a0_170 != 0x00);
				s0_168 = t3_111 >> s0_134;
				goto l2306FF54;
			}
			uint32 a4_157 = t3_111 >> (word32) s0_134 - 32;
			int32 a0_158 = 0;
			if (s0_134 != 32)
				a0_158 = t3_111 << 64 - s0_134;
			a7_153 = a4_157 | (word32) ((a0_158 | a0 << 0x03) != 0x00);
		}
		else
			a7_153 = (word32) ((t3_111 | a0 << 0x03) != 0x00);
		s0_168.u0 = 0;
l2306FF54:
		Eq_2 a7_184 = (a2 << 0x03) - a7_153;
		a5_136 = a5_136 - s0_168 - (word32) (a2 << 0x03 < a7_184);
		t1_193 = a7_184;
		a4_130 = a6_210;
		s2_104 = a3_39;
l2306FDF8:
		if (a5_136 << 0x08 >= 0x00)
			goto l2306FE90;
		s0_286 = a5_136 & 0x007FFFFF;
		s4_289 = t1_193;
		s1_291 = a4_130;
l230701D8:
		Eq_2 a0_298;
		if (s0_286 != 0x00)
		{
			word32 a4_1910;
			a0_298 = __clzsi2(s0_286, out a4_1910);
		}
		else
		{
			word32 a4_1909;
			a0_298 = (word32) __clzsi2(s4_289, out a4_1909) + 32;
		}
		uint32 s0_308;
		Eq_357801 a4_304 = (word32) a0_298 - 8;
		if (a4_304 <= 31)
		{
			s0_308 = s4_289 >> 32 - a4_304 | s0_286 << a4_304;
			t1_193 = s4_289 << a4_304;
		}
		else
		{
			s0_308 = s4_289 << (word32) a0_298 - 40;
			t1_193.u0 = 0;
		}
		if (a4_304 < s1_291)
		{
			a4_130 = s1_291 - a4_304;
			a5_136 = s0_308 & ~0x00800000;
			goto l2306FE90;
		}
		int32 a4_326 = a4_304 - s1_291;
		if (a4_326 <= -30)
		{
			int32 a4_345 = 32 - (a4_326 + 1);
			a7_100 = s0_308 << a4_345 | t1_193 >> a4_326 + 1 | (word32) (t1_193 << a4_345 != 0x00);
			t3_111 = s0_308 >> a4_326 + 1;
			goto l2306FFE4;
		}
		uint32 a4_331 = s0_308 >> a4_326 + -31;
		int32 a3_332 = 0;
		if (a4_326 != -31)
			a3_332 = s0_308 << 64 - (a4_326 + 1);
		a7_100 = a4_331 | (word32) ((t1_193 | a3_332) != 0x00);
l23070094:
		t3_111.u0 = 0;
		goto l2306FFE4;
	}
	if (((word32) s1_291.u0 + 1 & 0x07FE) != 0x00)
	{
		s4_289 = (a0 << 0x03) - (a2 << 0x03);
		s0_286 = t3_111 - a5_136 - (word32) (a0 << 0x03 < s4_289);
		if (s0_286 << 0x08 < 0x00)
		{
			s4_289 = (a2 << 0x03) - (a0 << 0x03);
			s0_286 = a5_136 - t3_111 - (word32) (a2 << 0x03 < s4_289);
			s2_104 = a3_39;
			goto l230701D8;
		}
		a7_100 = s4_289 | s0_286;
		if (a7_100 != 0x00)
			goto l230701D8;
		goto l2307008C;
	}
	ui32 a1_73 = t3_111 | a0 << 0x03;
	ui32 a2_74 = a5_136 | a2 << 0x03;
	if (s1_291 == 0x00)
	{
		if (a1_73 == 0x00)
		{
			if (a2_74 == 0x00)
			{
				s2_104 = (word32) (s3_17 < (struct Eq_84 *) -3);
				t3_111.u0 = 0;
				a7_100.u0 = 0;
				goto l2306FFE4;
			}
			t3_111 = a5_136;
			a7_100 = a2 << 0x03;
l2307007C:
			s2_104 = a3_39;
			goto l2306FFE4;
		}
		if (a2_74 == 0x00)
			goto l2306FFE4;
		Eq_2 a2_105 = (a0 << 0x03) - (a2 << 0x03);
		Eq_2 a4_108 = t3_111 - a5_136 - (word32) (a0 << 0x03 < a2_105);
		if (a4_108 << 0x08 < 0x00)
		{
			a7_100 = (a2 << 0x03) - (a0 << 0x03);
			t3_111 = a5_136 - t3_111 - (word32) (a2 << 0x03 < a7_100);
			goto l2307007C;
		}
		a7_100 = a2_105 | a4_108;
		if (a7_100 != 0x00)
		{
			t3_111 = a4_108;
			a7_100 = a2_105;
			goto l2306FFE4;
		}
l2307008C:
		s2_104 = (word32) (s3_17 < (struct Eq_84 *) -3);
		goto l23070094;
	}
	if (s1_291 == 0x07FF)
	{
		if (a1_73 != 0x00)
		{
			s1_291 = (word32) ((t3_111 & 0x00400000) < 1) << 0x04;
			if (a6_210 != 0x07FF)
				goto l230700FC;
		}
		else
		{
			if (a6_210 != s1_291)
			{
				s1_291.u0 = 0;
l230700DC:
				if (a2_74 == 0x00)
				{
					a7_100.u0 = 0;
					s2_104.u0 = 0;
					a5_136.u0 = 0x00400000;
					a4_130.u0 = 0x07FF;
					s1_291.u0 = 16;
					goto l23070110;
				}
				a7_100 = a2 << 0x03;
				s2_104 = a3_39;
l230700E8:
				a6_210.u0 = 0;
				a4_130.u0 = 0x07FF;
				goto l2306FC30;
			}
			s1_291.u0 = 0;
		}
	}
	else
	{
		s1_291.u0 = 0;
		if (a6_210 != 0x07FF)
			goto l230700D8;
	}
	if (a2_74 != 0x00 && a5_136 << 0x09 >= 0x00)
		s1_291.u0 = 16;
l230700D8:
	if (a1_73 == 0x00)
		goto l230700DC;
l230700FC:
	if (a2_74 == 0x00)
		goto l2306FC98;
	goto l23070100;
}

